[
  {
    "title": "'PigeonBot' is the first robot that can bend its wings like a real bird",
    "created": "31 May, 2020",
    "author": "Sathya",
    "views": "463",
    "content": "<p>Pigeons may be considered rats of the sky, but some scientists have found greater value in these urban birds: <strong>the blueprint for a new generation of flying machines.</strong></p><p>Birds can modify the shape of their wings by fanning out their feathers or shuffling them closer together. Those adjustments allow birds to cut through the sky more nimbly than rigid drones. Now, using new insights into exactly how pigeons joints control the spread of their wing feathers, researchers have built a robotic pigeon, dubbed <strong>PigeonBot</strong>, whose feathered wings change shape like the real deal</p><p>This research paves the way for creating more agile aircraft, says <strong>Dario Floreano, a roboticist at the Swiss Federal Institute of Technology Lausanne in Switzerland</strong> not involved in the work.</p><p>With birdlike wings, airborne machines could make tighter turns in cluttered spaces, such as around buildings or in forests, and could better navigate rough air, Floreano says (SN: 1/24/15). The new robot, described January 16 in Science Robotics, also offers a way to study the nuts and bolts of bird flight without animal experiments.</p><div class=\"ads-page-3\"></div><p>Researchers bent and extended the wings of dead pigeons to investigate how the birds control their wing shape. Those experiments revealed that the angles of two wing joints, the wrist and the finger, most affect the alignment of a wings flight feathers. The orientations of those long, stiff feathers, which support the bird in flight, help determine the wings shape. Based on those findings, the team built a robot with real pigeon feathers, whose faux wrists and fingers can morph its wing shape as seen in the pigeon cadavers.</p><p>Besides laying the groundwork for building more graceful drones, whats really cool about this robot is  you can make manipulations in a robot wing that you could never do or want to do in a bird to study flight, says <strong>David Lentink, an engineer and biologist at Stanford University.</strong></p><p>For instance, Lentink wondered whether a pigeon could steer itself just by bending the finger joint of either its left or right wing. The problem is, of course, I dont really know how to train a bird to just move its finger  and I actually am very good in bird training, he says by phone, as two pet birds chirp in the background.</p><p>A controllable robotic pigeon solves that problem. In flight tests, Lentinks team observed that bending only the finger of one wing eased the robot into a banked turn  offering the first evidence that birds may sometimes use just their fingers to steer in flight.</p><div class=\"ads-page-3\"></div><p>In a second study, reported in the Jan. 17 Science, Lentinks group used their robotic wing design to confirm another insight into bird flight: how gaps are prevented from forming between feathers on extended wings. In experiments that involved rubbing one bird feather across the top of another  to mimic overlapping flight feathers fanning out  researchers found that two feathers initially slid apart easily, but then snagged on each other. Scanning electron and X-ray microscopy images revealed that tiny hooks protruding from the top of one feather latch onto ridges on the underside of the other when they slide too far apart. Those microscopic hooks unfasten when the feathers slot back together.</p><p><strong>Thats the secret. They have this directional Velcro that holds feathers together</strong>, Lentink says.</p><p>To confirm the effect of these microstructures, the researchers rotated the feathers on their robot so that they wouldnt slide against each other when wings were extended. In wind tunnel and outdoor flight tests, gaps formed between feathers on the modified robot wings, undermining the wings stability.</p><p>This is the best set of robotic wings yet for testing how birds coordinate their flight feathers to maneuver through the air, says Tyson Hedrick, a biomechanist the University of North Carolina at Chapel Hill not involved in the work. But theres plenty of room for improvement. For instance, a future flying robot could include a shoulder joint, to investigate how tilting a birds wings up and down influences flight, he says.</p>",
    "type": "Social Media",
    "category": "Robot",
    "banner394x449": "upload/banner394x449/public/pigeon-bot_feat.jpg",
    "banner600x500": "upload/banner600x500/public/pigeon-bot_feat.jpg",
    "banner788x443": "upload/banner788x443/public/pigeon-bot_feat.jpg",
    "banner800x460": "upload/banner800x460/public/pigeon-bot_feat.jpg",
    "file": "2020-05-31-PigeonBot-is-the-first-robot-that-can-bend-its-wings.json"
  },
  {
    "title": "Scientists Have Created Hexagonal Salt, For First Time Ever",
    "created": "01 June, 2020",
    "author": "Nithya",
    "views": "463",
    "content": "<p>While it probably won't make it to your dining table, a new scientific achievement might be able to help in everything from radar equipment to electric cars: <strong>scientists have been able to form salt, aka sodium chloride (NaCl), in a hexagonal shape</strong></p><p>This is work done at the smallest of scales, with researchers able to get a thin film of hexagonal salt to form on top of a layer of diamond, due to the chemical interaction of both film and diamond substrate - something the team actually predicted would happen in advance through simulations.</p><div class=\"ads-page-3\"></div><p>It's the latest in a series of discoveries where scientists have been <strong>able to synthesise 2D materials with unusual crystal structures</strong>, and it's partly this self-imposed restriction to two dimensions that is enabling new and exotic structures to be formed.</p><p>\"Initially we decided to perform only a computational study of the formation of new 2D structures on different substrates, driven by the hypothesis that if a substrate interacts strongly with the NaCl thin film, one can expect major changes in the structure of the thin film,\" says material scientist Kseniya Tikhomirova from the Skolkovo Institute of Science and Technology (Skoltech) in Russia.</p><p>\"<strong>Indeed, we obtained very interesting results and predicted the formation of a hexagonal NaCl film on the diamond substrate</strong>, and decided to perform experiments. Thanks to our colleagues who performed the experiments, we synthesised this hexagonal NaCl, which proves our theory.\"</p><p>To begin with, Tikhomirova and her colleagues used a custom algorithm called USPEX to predict low-energy crystal structures based on the chemical elements used to make them. That in turn led to a hypothesis about the <strong>formation of NaCl structures on top of the diamond layer</strong>.</p><div class=\"ads-page-3\"></div><p>In order to prove the hypothesis correct, a series of high-pressure experiments were carried out to create a layer of hexagonal NaCl averaging just 6 nanometres thick - a layer that was verified with X-ray and electron diffraction measurements.</p><p>As soon as the film got any thicker than that, it reverted back to the standard cubic structure of salt - the one you would see if you seasoned your food with it and looked under an ultra-powerful microscope.</p><p>\"<strong>This shows that this simple and common compound, seemingly well-studied, hides many interesting phenomena, especially in nanoscale</strong>,\" says material scientist Alexander Kvashnin.</p><p>Where this might prove most useful is in diamond field-effect transistors or FETs, which can be deployed in a variety of high-powered electronics, including electric vehicles and telecommunications devices.</p><div class=\"ads-page-3\"></div><p>These FETs currently rely on hexagonal boron nitride, but hexagonal NaCl is likely to improve the stability of FETs even further (and make them more suitable for a broader range of purposes).</p><p>There's plenty more research ahead, too, not only in developing the hexagonal NaCl structures and the FETs based on them, but also <strong>predicting how exotic structures could be formed from other kinds of compounds</strong>.</p><p>Graphene remains the standard bearer for a 2D material that can exhibit surprising and useful properties, but it's likely that there are many other such discoveries still to come. As methods of modelling and analysis develop, hexagonal salt is likely to be just the start.</p><p>\"Our results show that the <strong>field of 2D materials is still very young, and scientists have discovered only a small portion of possible materials with intriguing properties</strong>,\" says Kvashnin.</p><p>The research has been published in the Journal of Physical Chemistry Letters.</p>",
    "type": "Sci-Tech",
    "category": "Salt",
    "banner394x449": "upload/banner394x449/public/salt-2.jpg",
    "banner600x500": "upload/banner600x500/public/salt-2.jpg",
    "banner788x443": "upload/banner788x443/public/salt-2.jpg",
    "banner800x460": "upload/banner800x460/public/salt-2.jpg",
    "file": "2020-06-01-Scientists-Have-Created-Hexagonal-Salt.json"
  },
  {
    "title": "Courtship time - Make it memorable, ways to add some spice",
    "created": "04 June, 2020",
    "author": "Karthik",
    "views": "463",
    "content": "<p>Finally you found a guy/girl with whom you can't wait to start most excitement time of your life.. But you see lot of time for wedding and So you got lot of time to know each other even more better.. The Best you can do is make this time memorable ;)</p><h3>1. Wedding planning, will be best time pass for each of you.</h3><p>Hmm, Obviously meeting in person in this courtship period would happen with this wedding planning action items.. So plan a day before like what else can be done on each wedding planning action item execution.. Like Need to buy a dress, plan something like we get matching dress and you both can have a walk, after this purchase ;)</p><h3>2. Try to know about Family, Friends of each other.</h3><p>Discuss in general like, how every day goes.. get to know who does what?</p><h3>3. Leave hints about what each of you like.</h3><p>Both of you should be leaving hints like what you like, what you expect.. none of you both are mind readers so make it easy for each other.. by doing so, both will know exactly what you are ;)</p><div class=\"ads-page-3\"></div><h3>4. Stop being shy, flirt a little.</h3><p>Yeah, stop being shy you two are going to get married soon.. complement each other, be honest about it.. and flirt a little.. makes your time memorable.</p><h3>5. Plan surprises once/twice</h3><p>Okay surprises, Men are little slow when it comes to planning surprises.. So try to make it memorable..</p><p>You found a person with whom you want to grow up old, Make the moments special and meaningful..</p>",
    "type": "Lifestyle",
    "category": "Love",
    "banner394x449": "upload/banner394x449/public/courtship_1.jpg",
    "banner600x500": "upload/banner600x500/public/courtship_1.jpg",
    "banner788x443": "upload/banner788x443/public/courtship_1.jpg",
    "banner800x460": "upload/banner800x460/public/courtship_1.jpg",
    "file": "2020-06-04-Courtship-time-Make-it-memorable-ways-to-add-some-spice.json"
  },
  {
    "title": "Egg Stuffed Paratha Recipe - Home made",
    "created": "04 June, 2020",
    "author": "Nithya",
    "views": "463",
    "content": "<p>Egg Stuffed Paratha is a delicious and healthy Paratha dish, filled with egg mixture. Both the eggs and whole wheat are healthy as it provides the right amount of proteins and carbs. The egg mixture has finely chopped onions, green chili and coriander leaves. This is then slided into the half cooked paratha pockets and cooked further. The Egg Stuffed Parathas are quite filling in itself.</p><h3>Ingredients Needed?</h3><p><strong>For the dough: </strong> Wheat flour 1 cup, Water, Oil & Salt for taste.</p><p><strong>For the egg stuffing: </strong> 2 Eggs, 1 Onion, 5 Green chilli, Coriander leaves, Chilli powder, Cumin powder, Garam masala, Chaat masala & Salt for taste.</p><div class=\"ads-page-3\"></div><h3>How to Cook?</h3><p>In a bowl, add wheat flour, salt, oil and mix.. Gradually add water and knead the dough.. Divide the dough into equal portions.. Place one of the portions onto a rolling surface and flatten it.. Roll out the dough flat..</p><p>Meanwhile, crack open the eggs into a glass/bowl, add all the ingredients for the stuffing.. Mix everything well (keep it dry, not too watery)..</p><p>Heat a tawa, place the rolled out chapati onto the tawa.. Flip the chapati and cook on both sides for a 10 - 15 seconds..</p><p>Make a slit on the chapati, create a pocket.. Pour the egg mixture into the slit and seal it.. Let the chapati cook and egg set inside.. Apply ghee and cook on both sides till it is completely cooked..</p><p>Cut the parathas and serve hot..</p><ul class=\"check\"><li>Prep time: 30 minutes</li><li>Cook time: 15 minutes</li><li>Number of servings: 4 persons</li></ul>",
    "type": "Food",
    "category": "Egg",
    "banner394x449": "upload/banner394x449/public/egg.jpg",
    "banner600x500": "upload/banner600x500/public/egg.jpg",
    "banner788x443": "upload/banner788x443/public/egg.jpg",
    "banner800x460": "upload/banner800x460/public/egg.jpg",
    "file": "2020-06-04-Egg-Stuffed-Paratha-Home-made-recipe.json"
  },
  {
    "title": "Bangalore <=> Mysore (2 Days + 1 Night, Ride Plan)",
    "created": "04 June, 2020",
    "author": "Karthik",
    "views": "463",
    "content": "<p>Two days Ride from <strong>Bangalore <i class=\"fa fa-angle-double-right\"></i> Mysore <i class=\"fa fa-angle-double-right\"></i> Bangalore</strong>, If you are a Couple riding on Bike or You are riding with a Friend in two different Bikes, then this plan for two days works very well. Below is the route mentioned where you can plan accordingly, if at all you need to spend some more time in some place in the list, you can skip the next place in the planned route.</p>\n                                <h3>Route</h3>\n                                <p><strong>Bangalore <i class=\"fa fa-arrow-right\"></i> Chamundeshwari Temple <i class=\"fa fa-arrow-right\"></i> Mysuru Sand Sculpture Museum <i class=\"fa fa-arrow-right\"></i> Karanji Lake <i class=\"fa fa-arrow-right\"></i> Mysore Palace <i class=\"fa fa-arrow-right\"></i> KRS Dam <i class=\"fa fa-arrow-right\"></i> Yedmuri Falls / Balmuri Falls <i class=\"fa fa-arrow-right\"></i> Ranganathittu Bird Sanctuary <i class=\"fa fa-arrow-right\"></i> Sri Ranganathaswamy Temple (Pancharanga Kshetram) <i class=\"fa fa-arrow-right\"></i> Janapada Loka <i class=\"fa fa-arrow-right\"></i> Bangalore</strong></p>\n                                <div class=\"ads-page-3\"></div>\n                                <h3>Map - <a target=\"_blank\" href=\"https://goo.gl/maps/kUECyoA6y1y84P2i7\">https://goo.gl/maps/kUECyoA6y1y84P2i7</a></h3>\n                                1. Bangalore <i class=\"fa fa-arrow-right\"></i> <strong>Chamundeshwari Temple: </strong>\n                                <ul class=\"check\">\n                                    <li>Distance: 3h 30min - 4h (176 km)</li>\n                                    <li>Leave Bangalore as soon as possible in the morning, 4:00 / 4:30 so that you reach somewhere between 7:30 - 8:00.</li>\n                                    <li>Time you can Spend: 1 - 2 hours.</li>\n                                    <li>It is considered as a Shakti Peetha and one among the 18 Maha Shakti Peethas.</li>\n                                    <li>Have Breakfast around 9:30 - 10:30.</li>\n                                </ul>\n                                2. Chamundeshwari Temple <i class=\"fa fa-arrow-right\"></i> <strong>Mysuru Sand Sculpture Museum: </strong>\n                                <ul class=\"check\">\n                                    <li>Distance:  15 min (7 km) </li>\n                                    <li>Time you can Spend: 2 - 2.5 hours</li>\n                                    <li>With 150 sand sculptures on display, on a one-acre land. Also three-dimensional selfie gallery.</li>\n                                    <li>Have Lunch around 1:30 - 2:00.</li>\n                                </ul>\n                                <div class=\"ads-page-3\"></div>\n                                3. Mysuru Sand Sculpture Museum <i class=\"fa fa-arrow-right\"></i> <strong>Karanji Lake: </strong>\n                                <ul class=\"check\">\n                                    <li>Distance: 10 min (4 km) </li>\n                                    <li>Time you can Spend: 1.5 - 2 hours</li>\n                                    <li>Karanji Lake has a nature park consisting of a butterfly park and a walk-through aviary and You have a Boating.</li>\n                                </ul>\n                                4. Karanji Lake <i class=\"fa fa-arrow-right\"></i> <strong>Mysore Palace: </strong>\n                                <ul class=\"check\">\n                                    <li>Distance: 5 min (2 km)</li>\n                                    <li>Time you can Spend: 1 - 1.5 hours</li>\n                                    <li>An historical palace, where you can see Indo-Saracenic architectural style of domes.</li>\n                                </ul>\n                                5. Mysore Palace <i class=\"fa fa-arrow-right\"></i> <strong>KRS Dam: </strong>\n                                <ul class=\"check\">\n                                    <li>Distance: 40 min (24 km) </li>\n                                    <li>Time you can Spend: till 8:00 PM to 8:30 PM</li>\n                                    <li>Brindavan Gardens is show garden that has botanical park, with fountains, as well as boat rides beneath dam.</li>\n                                    <li>Have Dinner around 8:00 - 8:30.</li>\n                                </ul>\n                                <p>Book hotel's near by to the Dam area so that you can reach by 9:00 and take rest.</p>\n                                <div class=\"ads-page-3\"></div>\n                                6. KRS Dam <i class=\"fa fa-arrow-right\"></i> <strong>Yedmuri Falls / Balmuri Falls: </strong>\n                                <ul class=\"check\">\n                                    <li>Distance: 15 min (7 - 8 km)</li>\n                                    <li>Leave hotel by having Breakfast around 8:30 - 9:00</li>\n                                    <li>Time you can Spend: 1.5 - 2 hours</li>\n                                    <li>You can swim if you can, You have Boating with small ones(theppa in kannada), Have a tasty fish their.</li>\n                                </ul>\n                                7. Yedmuri Falls / Balmuri Falls <i class=\"fa fa-arrow-right\"></i> <strong>Ranganathittu Bird Sanctuary: </strong>\n                                <ul class=\"check\">\n                                    <li>Distance: 20 min (11 km)</li>\n                                    <li>Time you can Spend: 2 - 3 hours</li>\n                                    <li>Roughly 170 bird species[10] have been recorded. Ranger-guided boat tours of isles are available, are a good way to watch birds, crocodiles, otters, and bats.</li>\n                                    <li>Have Lunch around 2:00 - 2:30</li>\n                                </ul>\n                                8. Ranganathittu Bird Sanctuary <i class=\"fa fa-arrow-right\"></i> <strong>Sri Ranganathaswamy Temple: </strong>\n                                <ul class=\"check\">\n                                    <li>Distance: 30 min (15 km)</li>\n                                    <li>Time you can Spend: 1 - 1.5 hours</li>\n                                    <li>It is one of the five important pilgrimage sites of Sri Vaishnavism along the river Kaveri for devotees of Ranganatha.</li>\n                                </ul>\n                                <div class=\"ads-page-3\"></div>\n                                9. Sri Ranganathaswamy Temple <i class=\"fa fa-arrow-right\"></i> <strong>Janapada Loka: </strong>\n                                <ul class=\"check\">\n                                    <li>Distance: 1h - 1h 15min (75 km)</li>\n                                    <li>Time you can Spend: 1.5 - 2 hours</li>\n                                    <li>Have some drinks & snaks around 5:00 PM</li>\n                                    <li>You can see Folk arts museum, Loka Mahal, Chitra Kuteera, Doddamane, Shilamala, Ayagaramala.</li>\n                                </ul>\n                                10. Janapada Loka <i class=\"fa fa-arrow-right\"></i> <strong>Bangalore: </strong>\n                                <ul class=\"check\">\n                                    <li>Distance: 1h 30min - 2h (55 km) </li>\n                                    <li>You can be at home by 9:00 - 9:30.</li>\n                                </ul><p>Hope you like, 2 days trip plan from <strong>Bangalore <i class=\"fa fa-angle-double-right\"></i> Mysore <i class=\"fa fa-angle-double-right\"></i> Bangalore</strong>. Its bit tight schedule, if you feel you need to spend some time in between you can skip the coming one and plan your trip accordingly.</p>",
    "type": "Travel",
    "category": "Bangalore, Mysore, Couple",
    "banner394x449": "upload/banner394x449/public/b-m-b_0.png",
    "banner600x500": "upload/banner600x500/public/b-m-b_0.png",
    "banner788x443": "upload/banner788x443/public/b-m-b_0.png",
    "banner800x460": "upload/banner800x460/public/b-m-b_0.png",
    "file": "2020-06-04-Two-days-trip-from-Bangalore-to-Mysore.json"
  },
  {
    "title": "UnConditional Love in a Couple's Relationship",
    "created": "06 June, 2020",
    "author": "Sathya",
    "views": "463",
    "content": "<p>It is commonly said that Women are complex in mental nature while Men remain easy to understand and simple. Whatever be the reasons that backup this comment, <strong>in relationships both Men and Women follow slightly diverted paths.</strong> What Men look for in a relationship is not what motivates Women to fall in relationships. The differences in desires, mentalities, passion, expression levels etc., are resulted from some unknown causes; might be hormonal differences, mindset changes or social concepts.</p>\n                                <p><strong>Women get time to be settled in a relationship</strong>, but if settled down, they remain dedicated and sacrificing for it; while <strong>Men jump into relationships so easily and get out of it with same easiness</strong>. However, experts say that if provided with the requirements and if matched with his desires, even Men ardently remain in the relationships.</p>\n                                <div class=\"ads-page-3\"></div>\n                                <h3>UnConditional Love ??</h3>\n                                <p>UnConditional Love is the active choice to Love someone no matter what may come your way.</p>\n                                <p>In UnConditional Love, satisfaction comes from putting someone else first and prioritizing their health and happiness with no expectation of reward for yourself. Experts agree that this is only possible if <strong>you first practice unconditional Love with yourself</strong>.</p>\n                                <ul class=\"check\">\n                                    <li><strong>Practice open communication</strong>, so that both of your needs can be met.</li>\n                                    <li><strong>Communicate in a non-defensive way</strong>. Express your feelings while listening and taking the other person's feelings into account.</li>\n                                    <li><strong>Don't let the little annoyances of life override your Love</strong>. Unconditional Love means seeing past the squabbles about the little things in life. If you have a commitment of Love that is larger than those things, you will have staying power.</li>\n                                    <li><strong>Share power in your relationship</strong>. No one person should get everything they want, or this will lead to resentment by the other person.</li>\n                                </ul>\n                                <p>One thing is certain; relationships that are completely lacking in unconditional Love are unlikely to succeed. <strong>Beliefs and Lifestyle are likely to change over time</strong>.</p>",
    "type": "Lifestyle",
    "category": "Couple",
    "banner394x449": "upload/banner394x449/public/rafal_0.jpg",
    "banner600x500": "upload/banner600x500/public/rafal_0.jpg",
    "banner788x443": "upload/banner788x443/public/rafal_0.jpg",
    "banner800x460": "upload/banner800x460/public/rafal_0.jpg",
    "file": "2020-06-06-Un-Conditional-Love-in-a-relationship.json"
  },
  {
    "title": "Checklist for making a Eco-Friendly Home",
    "created": "07 June, 2020",
    "author": "Karthik",
    "views": "463",
    "content": "<p>To build a home, which makes low-impact environmentally. And built using materials & technology that lowers its energy needs in future. And also make sure built home is reliable for few decades with minimal energy spent on it. To do this, you have to consider Energy? what Sustainable materials to be used? how it impacts on our health? And what is costs</p>\n                                <p>Before getting into the details of each individual items, lets make a checklist of few things a human needs in day to day life. Below is the checklist.</p>\n                                <div class=\"ads-page-3\"></div>\n                                <h4>Checklist</h4>\n                                <ul class=\"check\">\n                                    <li><strong>Land + Compound Wall + Lot of Trees</strong> - yeah you need this</li>\n                                    <li><strong>Thermal insulation, Walls & Roof</strong> - to absorb/release the heat</li>\n                                    <li><strong>Borewell</strong> - for water</li>\n                                    <li><strong>Photovoltaic panels</strong> - for electric energy</li>\n                                    <li><strong>Vegetable patch + Geothermal heating + Farming</strong> - for food</li>\n                                    <li><strong>Greywater collection + Composting toilet</strong> - for reuseable water</li>\n                                    <li><strong>Biogas Plant</strong> - for gas</li>\n                                    <li><strong>Rainwater harvesting</strong> - for water</li>\n                                    <li><strong>Wind turbine</strong> - for extra energy</li>\n                                    <li><strong>Garden / Mini Forest + Pond + Bicycle</strong> - for Lifestyle</li>\n                                    <li><strong>Gear</strong> - for all this above work</li>\n                                </ul>\n                                <p>If you start thinking with the above list, then you will be able to visualize a small home in a small forest with necessary needs. Let read the in-details of each item in the list in the future articles.</p>",
    "type": "Sci-Tech",
    "category": "Environment, House, SolarPanel, RainHarvesting",
    "banner394x449": "upload/banner394x449/public/eco-home.jpg",
    "banner600x500": "upload/banner600x500/public/eco-home.jpg",
    "banner788x443": "upload/banner788x443/public/eco-home.jpg",
    "banner800x460": "upload/banner800x460/public/eco-home.jpg",
    "file": "2020-06-07-Home-with-low-impact-on-envirnoment.json"
  },
  {
    "title": "Indian style Spanish omelette, Egg + Potato + Onion",
    "created": "07 June, 2020",
    "author": "Nithya",
    "views": "463",
    "content": "<p>Egg with Potato plus Onion will make a delicious and healthy breakfast, You have have it as a Breakfast or you can have it as a Snack in the day, will also be a great starter in the barbecue. This combination of dish is called Spanish omelette, but lets make it in Indian Style.</p>\n                                <h3>Ingredients Needed?</h3>\n                                <p>3 Eggs, 4 medium sized Potato (chopped in small) & 4 medium sized Onion (chopped in small), 4-5 Green chilli (chopped in small), Chilli powder Oil & Salt for taste.</p>\n                                <div class=\"ads-page-3\"></div>\n                                <h3>How to Cook?</h3>\n                                <p>Have a bowl on stove with low flame, Put 3-4 table spoons of Oil (as needed).. Put the chopped Onion, chopped Potato & chopped Chilli and Fry in the low flame.. Put some salt and continue to Fry for 6-8 min untill the stuff is medium fried..</p>\n                                <p>Take the Fried stuff into another bowl and let it cool for a while, Meanwhile you prepare the other stuff</p>\n                                <p>Take a bowl and break the Eggs & add Salt + Chilli powder and Mix it well, actually mix it for 2-3 min.. so that the mixture is thick..</p>\n                                <p>Now mix the Fried stuff in to the Egg stuff and mix it well, Now you have the complete stuff ready which is ready for cooking..</p>\n                                <p>Now have a tawa on the stove and Put 2-3 tea spoons of Oil and Pour the prepared stuff, Let it Fry in the low flame for 2-3 min.. Now Fry the other side of Omellete for 2-3 min.. Once its fried on both sides take it to out, its ready for serve..</p>\n                                <ul class=\"check\">\n                                    <li>Prep time: 30 minutes</li>\n                                    <li>Cook time: 15 minutes</li>\n                                    <li>Number of servings: 3 persons</li>\n                                </ul>",
    "type": "Food",
    "category": "Egg",
    "banner394x449": "upload/banner394x449/public/spanish-omelette.jpg",
    "banner600x500": "upload/banner600x500/public/spanish-omelette.jpg",
    "banner788x443": "upload/banner788x443/public/spanish-omelette.jpg",
    "banner800x460": "upload/banner800x460/public/spanish-omelette.jpg",
    "file": "2020-06-07-Indian-style-spanish-omellete.json"
  },
  {
    "title": "Bangalore <=> Ghati Subramanya (Morning Ride Plan)",
    "created": "12 June, 2020",
    "author": "Karthik",
    "views": "463",
    "content": "<p><strong>Ghati Subramanya</strong> is an ancient Hindu temple, 50 kms away from Bangalore towards Doddaballapur situated on the outskirts of Bangalore. Ghati Subramanya has a recorded <strong>history of more than 600 years</strong>. Ghati Subramanya Temple was first developed by the Ghorpade rulers of Sandur who ruled parts of Bellary.</p>\n                                <p>The uniqueness of this temple is the prime deity <strong>\"Lord Karthikeya\" (Subramanya)</strong> & <strong>\"Lord Narasimha\"</strong> is found together. According to mythology, both idols are believed to have emerged from the earth.</p>\n                                <h3>Route</h3>\n                                <p><strong>Bangalore <i class=\"fa fa-arrow-right\"></i> Yelahanka <i class=\"fa fa-arrow-right\"></i> Doddaballapur <i class=\"fa fa-arrow-right\"></i> Ghati Subramanya</strong></p>\n                                <div class=\"ads-page-3\"></div>\n                                <h3>Map - <a href=\"https://goo.gl/maps/1aYV1i5QfNegutMQ9\" target=\"_blank\">https://goo.gl/maps/1aYV1i5QfNegutMQ9</a></h3>\n                                1. Bangalore <i class=\"fa fa-arrow-right\"></i> <strong>Yelahanka</strong>\n                                <ul class=\"check\">\n                                    <li>Leave Bangalore as soon as possible in the morning, so that you reach somewhere between 5:15 - 5:30.</li>\n                                    <li>You have to take diversion from here towards Doddaballapur.</li>\n                                    <li>Traffic will be less in the mornings & Roads are good.</li>\n                                </ul>\n                                2. Yelahanka <i class=\"fa fa-arrow-right\"></i> <strong>Doddaballapur</strong>\n                                <ul class=\"check\">\n                                    <li>Ride towards Doddaballapur, you will reach by 6:10 - 6:30.</li>\n                                    <li>Take a 5 min - 10 min break, have Tea/Coffee.</li>\n                                    <li>You have to take diversion from here towards Ghati Subramanya.</li>\n                                    <li>Traffic will be less in the mornings & Roads are quite good.</li>\n                                </ul>\n                                <div class=\"ads-page-3\"></div>\n                                3. Doddaballapur <i class=\"fa fa-arrow-right\"></i> <strong>Ghati Subramanya</strong>\n                                <ul class=\"check\">\n                                    <li>Ride towards Ghati Subramanya, you will reach by 6:50 - 7:00.</li>\n                                    <li>Get into the temple, you would feel pleasent in the morning, It might take, 15 min - 20 min for Darshana.</li>\n                                    <li>Have tiffen after coming out of temple, Explore park near temple, Their is a small shopping area, if interested checkout. Then Return back to Bangalore.</li>\n                                    <li>Traffic will be less in the mornings & Roads are quite good, but ride carefully on village roads people / animals will be crossing the roads.</li>\n                                </ul>\n                                4. Ghati Subramanya <i class=\"fa fa-arrow-right\"></i> <strong>Bangalore</strong>\n                                <ul class=\"check\">\n                                    <li>Ride towards Bangalore, you might be riding back around 8:30 - 9:00.</li>\n                                    <li>On the return from temple, you can stop roadside to get some fresh vegetables, fruits sold from nearby farms.</li>\n                                    <li>You would be in Bangalore somewhere around 10:00.</li>\n                                </ul>\n                                <p>Hope you like, Morning trip plan from <strong>Bangalore <i class=\"fa fa-angle-double-right\"></i> Ghati Subramanya <i class=\"fa fa-angle-double-right\"></i> Bangalore</strong>. Its bit tight schedule, But it will be nice to have ride in the Morning.</p>",
    "type": "Travel",
    "category": "Bangalore, GhatiSubramanya",
    "banner394x449": "upload/banner394x449/public/Peoples-Blog-Bangalore-Ghati-Subramanya.png",
    "banner600x500": "upload/banner600x500/public/Peoples-Blog-Bangalore-Ghati-Subramanya.png",
    "banner788x443": "upload/banner788x443/public/Peoples-Blog-Bangalore-Ghati-Subramanya.png",
    "banner800x460": "upload/banner800x460/public/Peoples-Blog-Bangalore-Ghati-Subramanya.png",
    "file": "2020-06-12-Short-trip-from-Bangalore-to-Ghati.json"
  },
  {
    "title": "Openness in a Couples Relationships can be Secret/Private",
    "created": "14 June, 2020",
    "author": "Karthik",
    "views": "463",
    "content": "<p>In a healthy romantic relationship, as time goes on trust is earned, and we eventually open up more & more. Based on each others mutual respect & valuing, couples are sometimes unclear in how much they should or want to share within each other. Each of them have right to privacy and each decide, how much to share or how much to open up.</p>\n                                <p>Few are too open or soon offer too much information, which can be inappropriate.. Few are too closed or hardly share anything personal.. Few of them share, if they feel other person is safe to share..</p>\n                                <p>Safe ones are these people, <strong>who will listen and not be judgemental or not shamed to listen</strong>. When someone listens like that, person will feel accepted for who they are. In a relationship both can experience different levels of closeness.</p>\n                                <div class=\"ads-page-3\"></div>\n                                <p>If you are with someone who is close and is ready to listen and understand what you are sharing which is secret or private for you, then you are the happiest couple.</p>\n                                <p>If you are with someone who is not that close, if you feel so then its your responsibility to sort it like set the boundaries, which can be improved in further time. <strong>End of the day you are dealing with your life partner</strong>.</p>\n                                <h3>Upto what extent I can share?</h3>\n                                <p>Hahaa.. Its difficult, if you are not sure what level of openness is fine or not. This actually depends upon your past experiences, and the person whom you communicate too.</p>\n                                <p>You generally share your most intimate stuff with your romatic partners, <strong>you will tend to create or already have a special bond</strong>, thats unique and only one to say. This is the one which creates strong attachment, a sense of trust & a sense of that partner belongs to you.</p>\n                                <div class=\"ads-page-3\"></div>\n                                <h3>What if I hold back?</h3>\n                                <p>Here is the relationship starts suffering, when we are holding back. Yes we have right, to have privacy and secrets to ourself, but this is the point where we start loosing the trust, Emotionally we might not be able to show up, It might lead to decrease in the intimacy levels with partner. Its nearly impossible to feel connected.</p>\n                                <h3>Why do you want to hold back?</h3>\n                                <p>Their could be many reasons, may be you have shared something in the past and did not felt safe. This is not something you have to be worried or feared about, You have to move towards more trusting ways so that you can open up to experience the emotional feel of connection.</p>\n                                <h3>Why will I keep it private?</h3>\n                                <p>Keeping private is very individuals choice, It is really not required to share every thought, feeling or an experience. Healthy Adult relationship between couple will be more like have each others space and respect each others privacy.</p>\n                                <div class=\"ads-page-3\"></div>\n                                <h3>What is the difference? Secret & Privacy</h3>\n                                <p>Having privacy in a relationship might not affect on your relationship, but a secret will surely make any one you hurt.</p>\n                                <p><strong>Lets deal with a example</strong>, If you do not like your partners hairstyle or eating/sleeping habits or friends. If you are keeping it private, then as time goes on this will be a secret which can hurt your relationship.</p>\n                                <p>So <strong>how do you deal with such stuff?</strong> Best way is start revealing part by part to your partner, so that you are getting into same pace with the conflicts with your relationship.</p>\n                                <p>Also keeping something secret from your partner, will feel the partner like in some way you are manipulating. You loose trust, intimacy & emotion between partners.</p>\n                                <p>Finally, what i want to say is.. <strong>we have to learn to give ourself..</strong> In a healthy relationship, we will find the words to convey what we want to share, so that it will be received as a welcomed gift by other.</p>",
    "type": "Lifestyle",
    "category": "Relationship, Couple",
    "banner394x449": "upload/banner394x449/public/Peoples-Blog-Openness-in-couples-relationship_0.jpg",
    "banner600x500": "upload/banner600x500/public/Peoples-Blog-Openness-in-couples-relationship_0.jpg",
    "banner788x443": "upload/banner788x443/public/Peoples-Blog-Openness-in-couples-relationship_0.jpg",
    "banner800x460": "upload/banner800x460/public/Peoples-Blog-Openness-in-couples-relationship_0.jpg",
    "file": "2020-06-14-Openness-in-Relationships-Secret-or-Private.json"
  },
  {
    "title": "Construction materials for Thermal Resistance Walls, Earth Bricks",
    "created": "20 June, 2020",
    "author": "Karthik",
    "views": "463",
    "content": "<p>Construction process can be tedious, time consuming, and expensive. To overcome this during construction, varied methods of construction is being considered and developed. Also, materials and equipment used for construction are also being fabricated to enhance the quality of construction and furthermore minimize the time and cost. <strong>Interlocking bricks is one such advancement in construction industry</strong>.</p>\n                                <p>Interlocking bricks are <strong>enhanced form of conventional clay bricks</strong>. Each brick is designed to lock itself to the other bricks around without the use of much mortar. The self-locking is achieved using shear-key and lock mechanism. Based on the design, the shape of shear-key will vary and a complimentary lock is provided on the opposite side of brick. Load transfer is achieved by shear transfer and gravity.</p>\n                                <div class=\"ads-page-3\"></div>\n                                <p>Interlocking bricks are <strong>compressed and stabilized earth bricks which contributes to strength of the structure</strong>.</p>\n                                <h3>How Interlocking Bricks are made?</h3>\n                                <ul class=\"check\">\n                                    <li>These Bricks are made by mixing soil, cement and sand mixture. The finished blocks even stronger than masonry stones.</li>\n                                    <li>The soil which is choosen <strong>should not be too sandy, it should actually be lumps and cracks</strong>.</li>\n                                    <li>Should not use soil, which is on the surface. It contains too much organics. Organic matter continues to breakdown over time while sand, silt, and clay are much more stable and will not rot away.</li>\n                                    <li>Material ratio: <strong>Cement (10%) + Clay (90%) + Water (appropriate)</strong>.</li>\n                                    <li>Bricks are cured for 7 - 14 days and it will reach its highest strength after 28 days.</li>\n                                </ul>\n                                <div class=\"ads-page-3\"></div>\n                                <h3>Pros and Cons of these Earth Bricks</h3>\n                                <strong>Pros</strong>\n                                <ul class=\"check\">\n                                    <li>These bricks <strong>result in higher density, which in turn converts itself into high thermal mass</strong>.</li>\n                                    <li>No need of plastering or very less plastering.</li>\n                                    <li>Interlocking bricks are an effective and proven earthquake resistant construction materials.</li>\n                                    <li>Less Labour cost, Less time for construction.</li>\n                                </ul>\n                                <strong>Cons</strong>\n                                <ul class=\"check\">\n                                    <li>You can build upto two storey building, more than 2-3 storey building is not recommended.</li>\n                                    <li>If rain water enters to the walls, it might be a hostage for insects and other undesired things. Solution for this is, doing minimal plastering for lines & corners</li>\n                                </ul>",
    "type": "Sci-Tech",
    "category": "Environment, House",
    "banner394x449": "upload/banner394x449/public/Peoples-Blog-Interlock-Clay-Brick.png",
    "banner600x500": "upload/banner600x500/public/Peoples-Blog-Interlock-Clay-Brick.png",
    "banner788x443": "upload/banner788x443/public/Peoples-Blog-Interlock-Clay-Brick.png",
    "banner800x460": "upload/banner800x460/public/Peoples-Blog-Interlock-Clay-Brick.png",
    "file": "2020-06-20-Construction-materials-for-Thermal-Resistant-Walls.json"
  },
  {
    "title": "Why to have a Green Roof or Eco Friendly Roof on a Building",
    "created": "21 June, 2020",
    "author": "Karthik",
    "views": "463",
    "content": "<p>A roof of a building that is <strong>partially or completely covered with vegetation</strong>, that is planted over a waterproofing membrane. It may also include additional layers such as a root barrier and drainage and irrigation systems. <strong>Rooftop ponds</strong> are another form of green roofs which are used to treat greywater.</p>\n                                <p><strong>Vegetation, soil, drainage layer, roof barrier and irrigation system</strong> constitute green roof.</p>\n                                <p>Green roofs serve several purposes for a building, like absorbing rainwater, providing insulation, creating a habitat for wildlife. They <strong>effectively use the natural functions of plants</strong> to filter water and will have quality air around the home.</p>\n                                <div class=\"ads-page-3\"></div>\n                                <p>There are many <strong>Environmental benefits of having a Eco friendly roof</strong> for a building.</p>\n                                <ul class=\"check\">\n                                    <li>Thermal Reduction & Energy Conservation.</li>\n                                    <li>Management of Oxygen & CO2 levels naturally.</li>\n                                    <li>Ecological benefits.</li>\n                                </ul>\n                                <h3>Thermal Reduction & Energy Conservation</h3>\n                                <p>Green roofs will <strong>reduce heating by adding mass and thermal resistance value</strong>, also will reduce the heat island by increasing evapotranspiration. Green roofs improve and reduce energy consumption. Green roof <strong>reduces cooling (by evaporative cooling) loads on a building</strong> by fifty to ninety percent.</p>\n                                <p>Temperature inside the home will be less than outside during summers & Temperature will be more inside than outside the home in the winters.</p>\n                                <div class=\"ads-page-3\"></div>\n                                <h3>Management of Oxygen & CO2 levels naturally</h3>\n                                <p>Environmental benefit of greens roofs is the ability to sequester carbon. This <strong>CO2 is naturally absorbed by plant tissue</strong>. The carbon is stored in the plant tissue and the soil substrate through plant litter and root exudates it. Green roofs also indirectly reduce CO2 given off by power plants through their ability to insulate buildings.</p>\n                                <h3>Ecological benefits</h3>\n                                <p>Green roofs create natural habitat for wild. <strong>Green roofs can attract beneficial insects, birds, bees and butterflies</strong>. Rooftop greenery complements wild areas by providing stepping stones for songbirds, migratory birds and other wildlife creatures.</p>\n                                <div class=\"ads-page-3\"></div>\n                                <h3>Cons</h3>\n                                <ul class=\"check\">\n                                    <li>Green roofs <strong>requires bit more maintenance</strong> energy compared to a standard roof. Standard maintenance include removing stones, <strong>controlling weeds, cutting plants</strong> so that it will not grow very big, <strong>checking moisture levels, and fertilizing</strong>.</li>\n                                    <li>The maintenance energy use for green roofs <strong>varies on many things like: climate, intensity of rainfall, type of building, type of vegetation, and external coatings</strong>.</li>\n                                </ul>",
    "type": "Sci-Tech",
    "category": "Environment, House",
    "banner394x449": "upload/banner394x449/public/Peoples-Blog-Green-Roof.jpg",
    "banner600x500": "upload/banner600x500/public/Peoples-Blog-Green-Roof.jpg",
    "banner788x443": "upload/banner788x443/public/Peoples-Blog-Green-Roof.jpg",
    "banner800x460": "upload/banner800x460/public/Peoples-Blog-Green-Roof.jpg",
    "file": "2020-06-21-Why-to-have-a-Green-Roof-or-Eco-Friendly-Roof-on-a-Building.json"
  },
  {
    "title": "Bangalore -> Murdeshwar -> Gokarna -> Goa -> Dandeli -> Bangalore",
    "created": "23 June, 2020",
    "author": "Karthik",
    "views": "463",
    "content": "<p>Ten days Ride from <strong>Bangalore <i class=\"fa fa-angle-double-right\"></i> Murdeshwar <i class=\"fa fa-angle-double-right\"></i> Gokarna <i class=\"fa fa-angle-double-right\"></i> Goa <i class=\"fa fa-angle-double-right\"></i> Dandeli <i class=\"fa fa-angle-double-right\"></i> Bangalore</strong>, If you are a Couple riding on Bike or You are riding with a Friend in two different Bikes, then this plan for ten days works very well. Below is the route mentioned where you can plan accordingly, if at all you need to spend some more time in some place in the list, you can skip the next place in the planned route.</p>\n                                <h3>Route</h3>\n                                <p><strong>Bangalore <i class=\"fa fa-arrow-right\"></i> Murdeshwar <i class=\"fa fa-arrow-right\"></i> Mirjan Fort <i class=\"fa fa-arrow-right\"></i> Sri Mahabaleshwara Swamy Temple <i class=\"fa fa-arrow-right\"></i> Om Beach <i class=\"fa fa-arrow-right\"></i> Half Moon Beach <i class=\"fa fa-arrow-right\"></i> Paradise Beach <i class=\"fa fa-arrow-right\"></i> Palolem Beach <i class=\"fa fa-arrow-right\"></i> Butterfly Beach <i class=\"fa fa-arrow-right\"></i> Patnem Beach <i class=\"fa fa-arrow-right\"></i> Cola Beach <i class=\"fa fa-arrow-right\"></i> Colva Beach <i class=\"fa fa-arrow-right\"></i> Aguada Fort <i class=\"fa fa-arrow-right\"></i> Panjim <i class=\"fa fa-arrow-right\"></i> Calangute <i class=\"fa fa-arrow-right\"></i> Anjuna Beach <i class=\"fa fa-arrow-right\"></i> Vagator Beach <i class=\"fa fa-arrow-right\"></i> Arambol Beach <i class=\"fa fa-arrow-right\"></i> Dandeli <i class=\"fa fa-arrow-right\"></i> Bangalore</strong></p>\n                                <div class=\"ads-page-3\"></div>\n<!--                                <h3>Map - <a target=\"_blank\" href=\"https://goo.gl/maps/kUECyoA6y1y84P2i7\">https://goo.gl/maps/kUECyoA6y1y84P2i7</a></h3>-->\n                                1. Bangalore <i class=\"fa fa-arrow-right\"></i> <strong>Murdeshwar: </strong>\n                                <ul class=\"check\">\n                                    <li>Distance: 9h - 10h (500 km)</li>\n                                    <li>Leave Bangalore in the morning, 5:00 / 5:30 so that you reach somewhere between 3:30 - 4:00.</li>\n                                    <li>Take rest, have dinner with some Sea food.</li>\n                                    <li>Leave to Murdeshwar Temple in the early morning, you can spend time for 3h - 4h.</li>\n                                    <li>Have Breakfast around 10:00 - 10:30.</li>\n                                    <li>Leave to the next destination.</li>\n                                </ul>\n                                2. Murdeshwar <i class=\"fa fa-arrow-right\"></i> <strong>Mirjan Fort, Gokarna: </strong>\n                                <ul class=\"check\">\n                                    <li>Distance:  1h - 1h 20min (60 km) </li>\n                                    <li>Time you can Spend: 2 - 2.5 hours</li>\n                                    <li>This beautiful piece of architecture comes alive in all its greenery.</li>\n                                    <li>Have Lunch around 2:00 - 2:30.</li>\n                                </ul>\n                                <div class=\"ads-page-3\"></div>\n                                3. Mirjan Fort, Gokarna <i class=\"fa fa-arrow-right\"></i> <strong>Sri Mahabaleshwara Swamy Temple, Gokarna: </strong>\n                                <ul class=\"check\">\n                                    <li>Distance: 30min - 40min (20 km) </li>\n                                    <li>Time you can Spend: 1.5 - 2 hours</li>\n                                    <li>Shiva linga at Mahabaleshwar Temple is one of the most vital.</li>\n                                </ul>\n                                4. Sri Mahabaleshwara Swamy Temple, Gokarna <i class=\"fa fa-arrow-right\"></i> <strong>Om Beach & Half Moon Beach & Paradise Beach, Gokarna: </strong>\n                                <ul class=\"check\">\n                                    <li>Distance: 20 min (10 km)</li>\n                                    <li>Take rest, stay nearby hotel of Om Beach.</li>\n                                    <li>Spend an evening walk at the Om Beach</li>\n                                    <li>Next day morning post breakfast, get on to a Trail towards Half Moon beach</li>\n                                    <li>Its 1 kilometer, you will reach by 10:00 -10:30, Spend 2 - 3 hours in the beach.</li>\n                                    <li>Next get on to a trail towards Paradise Beach, its 750 meters, you will reach by 2:00 - 2:30, Spend time for 2 - 3 hours.</li>\n                                    <li>Walk back to the hotel, via Half moon beach & Om beach, make sure you reach by sunset.</li>\n                                    <li>Have a sweet dinner on the beach side. and take rest to night.</li>\n                                </ul>\n                                <div class=\"ads-page-3\"></div>\n                                5. Om Beach & Half Moon Beach & Paradise Beach, Gokarna <i class=\"fa fa-arrow-right\"></i> <strong>Palolem, Goa: </strong>\n                                <ul class=\"check\">\n                                    <li>Distance: 2:30 - 3:00 min (100 km) </li>\n                                    <li>Ride will be along the sea line, you will come across many beaches, Have breakfast on the ride.</li>\n                                    <li>Time you can Spend at Palolem Beach for 2-3 hours.</li>\n                                    <li>Their is one small beach Butterfly Beach nearby Palolem Beach 7.5 km</li>\n                                    <li>Visit to Butterfly Beach around 3:00, Spend time till sunset, before sunset come back towards Palolem Beach and go to Patnem Beach.</li>\n                                    <li>Stay near by Patnem Beach for this night, and have a walk around 8:00 - 9:00 near beach.</li>\n                                </ul>\n                                6. Palolem, Goa <i class=\"fa fa-arrow-right\"></i> <strong>Cola Beach <i class=\"fa fa-arrow-right\"></i> Colva: </strong>\n                                <ul class=\"check\">\n                                    <li>Next day morning ride towards, Cola Beach</li>\n                                    <li>Distance: 30 - 40 min (18 km) </li>\n                                    <li>Time you can Spend: 4 - 5 hours</li>\n                                    <li>You can swim here, you have a small fresh water lake kind of envirnoment. Really a nice place to spend some time more.</li>\n                                    <li>Leave towards Colva, Distance: 1h - 1h 15min (35 km) </li>\n                                    <li>Spend for some time in Colva Beach, and Stay near by Colva for that night.</li>\n                                </ul>\n                                <div class=\"ads-page-3\"></div>\n                                7. Colva <i class=\"fa fa-arrow-right\"></i> <strong>Panjim: </strong>\n                                <ul class=\"check\">\n                                    <li>Distance: 1h - 1h 15min (35 km)</li>\n                                    <li>Look around Aguada fort in the morning, Time you can Spend: 1 - 2 hours</li>\n                                    <li>Get the tickets for Casino for the evening and take rest till evening.</li>\n                                    <li>Get into the Casino in the evening around 7:00 or 8:00, Spend whole night in the Casino and leave Casino in the morning around 4:30 -5:30.</li>\n                                </ul>\n                                8. Panjim <i class=\"fa fa-arrow-right\"></i> <strong>Calangute: </strong>\n                                <ul class=\"check\">\n                                    <li>Next Day morning, move towards Calangute Beach and take rest till evening</li>\n                                    <li>Evening Candolim and Calungute Beach are bit good. Time you can Spend: 1 - 1.5 hours</li>\n                                    <li>Checkout the best deal for the Pub and get into pub by 6:00, spend till 11:00 their. and Take rest for that night.</li>\n                                </ul>\n                                <div class=\"ads-page-3\"></div>\n                                9. Calangute <i class=\"fa fa-arrow-right\"></i> <strong>Arambol: </strong>\n                                <ul class=\"check\">\n                                    <li>Next Day morning, move towards Anjuna Beach, spend some time 1 - 2 hours.</li>\n                                    <li>Have sea food, Next move towards Vagator Beach, spend some couple of hours.</li>\n                                    <li>Reach Arambol by 4:00 or 5:00, Have a good evening in the Arambol Beach.</li>\n                                    <li>Spend that night in Arambol, and Crowd is not disturbing. You can have a great Beach Party.</li>\n                                </ul>\n                                10. Arambol <i class=\"fa fa-arrow-right\"></i> <strong>Dandeli: </strong>\n                                <ul class=\"check\">\n                                    <li>Next Day morning, move towards Dandeli. Morning ride will be good.</li>\n                                    <li>Distance: 4h - 4h 30 min (160 km) </li>\n                                    <li>You can do river rafting, and other water activities.</li>\n                                    <li>Spend that night in Dandeli, Take a complete rest.</li>\n                                </ul>\n                                <div class=\"ads-page-3\"></div>\n                                11. Dandeli <i class=\"fa fa-arrow-right\"></i> <strong>Bangalore: </strong>\n                                <ul class=\"check\">\n                                    <li>Next Day morning, move towards Bangalore.</li>\n                                    <li>Distance: 9h - 10h (460 km) </li>\n                                </ul>\n                                <p>Hope you like, Ten days Ride from <strong>Bangalore <i class=\"fa fa-angle-double-right\"></i> Murdeshwar <i class=\"fa fa-angle-double-right\"></i> Gokarna <i class=\"fa fa-angle-double-right\"></i> Goa <i class=\"fa fa-angle-double-right\"></i> Dandeli <i class=\"fa fa-angle-double-right\"></i> Bangalore</strong>. Its bit tight schedule, if you feel you need to spend some time in between you can skip the coming one and plan your trip accordingly.</p>",
    "type": "Travel",
    "category": "Bangalore, Murdeshwar, Gokarna, Goa, Dandeli",
    "banner394x449": "upload/banner394x449/public/Peoples-Blog-Bangalore-Goa.png",
    "banner600x500": "upload/banner600x500/public/Peoples-Blog-Bangalore-Goa.png",
    "banner788x443": "upload/banner788x443/public/Peoples-Blog-Bangalore-Goa.png",
    "banner800x460": "upload/banner800x460/public/Peoples-Blog-Bangalore-Goa.png",
    "file": "2020-06-23-Bangalore-Murdeshwar-Gokarna-Goa-Dandeli.json"
  },
  {
    "title": "Growing Enough Food to Feed a Family Year-Round by Yourself",
    "created": "28 June, 2020",
    "author": "Karthik",
    "views": "463",
    "content": "<p>It's a great thought of growing enough food to feed your family year round by yourself. Certain things are really important for such a though, like <strong>how much food is needed</strong> for your family, <strong>which crops to plant</strong>, how to <strong>get the most from your plot</strong>, and how to <strong>preserve your extra harvest.</strong></p>\n                                <h3>How much food is needed?</h3>\n                                <p>Let's say a 200 square feet plot will harvest the feeds for a single person all around the year. Then, 800 square feet of plot should do for 4 people family (bigger the family scale up the plot as needed).</p>\n                                <p>Some crops can take up more space than others, so based on these also plot size would increase.. Let's say 1600 square feet (double) of plot would do for 4 people of family.</p>\n                                <div class=\"ads-page-3\"></div>\n                                <h3>Which crops to plant?</h3>\n                                <p>Plant more of what your family likes to eat a lot, and we have to consider the climate as well, and also you should have a plan to preserve during off season.</p>\n                                <p>Here are few vegetables utilized in daily life.. Tomatoes, Carrot, Potatoes, Beet root, Broccoli, Corn, Spinach, Onion, Chilli, Beans, Cabbage, Chives, Cassava, Cauliflower, Cucumber, Daikon, Fennel, Ginger, Gourd, Horseradish, Lettuce, Lime, Mushroom, Olives, Oyster, Pumpkins, Parsley, Palm Heart, Quince, Radish, Rosemary, Red Cabbage, Shallots, Snow Peas, Sorrel, Spinach, Turnips, Watercress, Yam.</p>\n                                <h3>How to get most from your plot?</h3>\n                                <p>Their are several factors on how to get most from the Plot, such as quality of seeds, quality of soil, required amount of water, required planting space and photosynthesis (weather). Also, few steps can be taken to maximize production through the year from the Plot.</p>\n                                <ul class=\"check\">\n                                    <li>Do Intercropping</li>\n                                    <li>Plant again and again</li>\n                                    <li>Harvest early & consistently</li>\n                                    <li>Grow vegetables suited to your area</li>\n                                </ul>\n                                <div class=\"ads-page-3\"></div>\n                                <h3>How to preserve your extra harvest?</h3>\n                                <p>Their are many ways to preserve the harvest for the future utilization. and Also we should consider few things, which vegetables are good for preserving long term and short term. Few of popular ways to preserve food are..</p>\n                                <ul class=\"check\">\n                                    <li>Frezzing</li>\n                                    <li>Drying etc..</li>\n                                </ul>\n                                <h4>Finally..</h4>\n                                <p>The key is to start early planting and have a plan for next planting and preserving. If things are going good, means you have enough food for next one month.</p>",
    "type": "Food",
    "category": "Potatoes, Carrots, Tomatoes",
    "banner394x449": "upload/banner394x449/public/Peoples-Blog-Growing-Enough-Food-to-Feed-a-Family.jpg",
    "banner600x500": "upload/banner600x500/public/Peoples-Blog-Growing-Enough-Food-to-Feed-a-Family.jpg",
    "banner788x443": "upload/banner788x443/public/Peoples-Blog-Growing-Enough-Food-to-Feed-a-Family.jpg",
    "banner800x460": "upload/banner800x460/public/Peoples-Blog-Growing-Enough-Food-to-Feed-a-Family.jpg",
    "file": "2020-06-28-Growing-Enough-Food-to-Feed-a-Family.json"
  }
]
