[
  {
    "title": "Lunar Eclipse June 2020: When Is Next Lunar Eclipse, India Timings, How to Watch Live",
    "created": "29 May, 2020",
    "author": "Nithya",
    "views": "463",
    "content": "<p>The next lunar eclipse will grace the night skies on June 5 and June 6.<br/>The second lunar eclipse of 2020 is set to take place next month and lunar enthusiasts in India will be able to watch it with their naked eyes, although slighted fainted. It will be the second of the four lunar eclipses that will appear this year, all of which will be penumbral lunar eclipses. The last lunar eclipse occurred in January. Traditionally, the June full moon is called the Strawberry Moon, therefore, the upcoming penumbral lunar eclipse is also referred to as ‘Strawberry Moon Eclipse' by many.</p><p><strong>What is a penumbral lunar eclipse?</strong></p><p>A penumbral lunar eclipse takes place when the Moon moves through the faint, outer part of Earth's shadow called the penumbra. During this phase, the Moon appears a bit darker than usual and this type of eclipse is also often mistaken for a normal full moon.</p><div class='ads-page-3'></div><p><strong>Where will lunar eclipse June 2020 will be visible</strong></p><p>A significant portion of Earth's popular will be able to watch the June lunar eclipse. It will be visible in part of Europe, most of Asia, Australia, Africa, and parts of South America. The lunar eclipse will also be visible in India, as we mentioned earlier.</p><p><strong>Lunar Eclipse 2020 India time</strong></p><p>According to timeanddate.com, the lunar eclipse will start at 11:15pm IST on June 5 and reach the maximum eclipse at 12:54am on June 6. The penumbral eclipse will end at 2:34am. Moon enthusiasts can watch the eclipse from their home, however, it might look very pale and people would notice the difference.</p>",
    "type": "Sci-Tech",
    "category": "Eclipse",
    "banner394x449": "upload/banner394x449/public/lunar_eclipse_image_pexels_1578662474920.png",
    "banner600x500": "upload/banner600x500/public/lunar_eclipse_image_pexels_1578662474920.png",
    "banner788x443": "upload/banner788x443/public/lunar_eclipse_image_pexels_1578662474920.png",
    "banner800x460": "upload/banner800x460/public/lunar_eclipse_image_pexels_1578662474920.png",
    "file": "2020-05-29-Lunar-Eclipse-June-2020.json"
  },
  {
    "title": "TRAI wants to change your 10-digit phone number into 11-digit number",
    "created": "30 May, 2020",
    "author": "Nithya",
    "views": "463",
    "content": "<p>The existing mobile numbers could have an additional zero and the new mobile numbers could start with a new digit in future</p><p>The Telecom Regulatory Authority of India (TRAI) is planning to make some big changes in the telecom sector of India. The regulatory body on Friday released recommendations for developing a “Unified Number Plan” to ensure adequate numbering resources for fixed line and mobile services. TRAI in the press statement says that these recommendations are based on the comments and inputs given by various stakeholders in the discussion held during OHD in January. However, migration to the unified number scheme involves large scale changes and is not recommended at this stage.</p><ul class=\"check\">    <li>Change in the mobile number scheme is expected to give capacity of 10 billion numbers.</li>    <li>TRAI also recommends mandatory 0 for calling mobile number from landline.</li>    <li>Migration to unified number scheme is not recommended now.</li></ul><p>One of the major recommendations mentioned in the release is changing the 10 digits to 11 digits for regular mobile numbers. The existing mobile numbers could have an additional zero and the new mobile numbers could start with a new digit in future. This change is expected to give a total capacity of 10 billion numbers</p><div class='ads-page-3'></div><p>The second biggest recommendation from TRAI is adding compulsory zero for calling mobile numbers from landline. Currently mobile numbers can be called from landline without adding zero. Going ahead it can become mandatory to dial zero ahead of mobile numbers dialled from landline. However, there won’t be any change in dialling landline to landline, mobile to landline, or mobile to mobile calls. This announcement would be played whenever a fixed line subscriber dials a mobile number without a ‘0’.All the fixed line subscribers should be provided with ‘0’ dialling facility.</p><p>In another important recommendation, it is said that the mobile numbers assigned to internet dongles will also change to 13 digits. Currently, just like our mobile numbers our dongles also have 10 digits. This will be shifted to 13 digits scheme. A total time of month could be given to Telecom service providers to implement this scheme</p>",
    "type": "News",
    "category": "Mobile",
    "banner394x449": "upload/banner394x449/public/google-dialer_4.jpg",
    "banner600x500": "upload/banner600x500/public/google-dialer_4.jpg",
    "banner788x443": "upload/banner788x443/public/google-dialer_4.jpg",
    "banner800x460": "upload/banner800x460/public/google-dialer_4.jpg",
    "file": "2020-05-30-TRAI-wants-to-change-your-10-digit-phone-number.json"
  },
  {
    "title": "'PigeonBot' is the first robot that can bend its wings like a real bird",
    "created": "31 May, 2020",
    "author": "Sathya",
    "views": "463",
    "content": "<p>Pigeons may be considered rats of the sky, but some scientists have found greater value in these urban birds: <strong>the blueprint for a new generation of flying machines.</strong></p><p>Birds can modify the shape of their wings by fanning out their feathers or shuffling them closer together. Those adjustments allow birds to cut through the sky more nimbly than rigid drones. Now, using new insights into exactly how pigeons joints control the spread of their wing feathers, researchers have built a robotic pigeon, dubbed <strong>PigeonBot</strong>, whose feathered wings change shape like the real deal</p><p>This research paves the way for creating more agile aircraft, says <strong>Dario Floreano, a roboticist at the Swiss Federal Institute of Technology Lausanne in Switzerland</strong> not involved in the work.</p><p>With birdlike wings, airborne machines could make tighter turns in cluttered spaces, such as around buildings or in forests, and could better navigate rough air, Floreano says (SN: 1/24/15). The new robot, described January 16 in Science Robotics, also offers a way to study the nuts and bolts of bird flight without animal experiments.</p><div class=\"ads-page-3\"></div><p>Researchers bent and extended the wings of dead pigeons to investigate how the birds control their wing shape. Those experiments revealed that the angles of two wing joints, the wrist and the finger, most affect the alignment of a wings flight feathers. The orientations of those long, stiff feathers, which support the bird in flight, help determine the wings shape. Based on those findings, the team built a robot with real pigeon feathers, whose faux wrists and fingers can morph its wing shape as seen in the pigeon cadavers.</p><p>Besides laying the groundwork for building more graceful drones, whats really cool about this robot is  you can make manipulations in a robot wing that you could never do or want to do in a bird to study flight, says <strong>David Lentink, an engineer and biologist at Stanford University.</strong></p><p>For instance, Lentink wondered whether a pigeon could steer itself just by bending the finger joint of either its left or right wing. The problem is, of course, I dont really know how to train a bird to just move its finger  and I actually am very good in bird training, he says by phone, as two pet birds chirp in the background.</p><p>A controllable robotic pigeon solves that problem. In flight tests, Lentinks team observed that bending only the finger of one wing eased the robot into a banked turn  offering the first evidence that birds may sometimes use just their fingers to steer in flight.</p><div class=\"ads-page-3\"></div><p>In a second study, reported in the Jan. 17 Science, Lentinks group used their robotic wing design to confirm another insight into bird flight: how gaps are prevented from forming between feathers on extended wings. In experiments that involved rubbing one bird feather across the top of another  to mimic overlapping flight feathers fanning out  researchers found that two feathers initially slid apart easily, but then snagged on each other. Scanning electron and X-ray microscopy images revealed that tiny hooks protruding from the top of one feather latch onto ridges on the underside of the other when they slide too far apart. Those microscopic hooks unfasten when the feathers slot back together.</p><p><strong>Thats the secret. They have this directional Velcro that holds feathers together</strong>, Lentink says.</p><p>To confirm the effect of these microstructures, the researchers rotated the feathers on their robot so that they wouldnt slide against each other when wings were extended. In wind tunnel and outdoor flight tests, gaps formed between feathers on the modified robot wings, undermining the wings stability.</p><p>This is the best set of robotic wings yet for testing how birds coordinate their flight feathers to maneuver through the air, says Tyson Hedrick, a biomechanist the University of North Carolina at Chapel Hill not involved in the work. But theres plenty of room for improvement. For instance, a future flying robot could include a shoulder joint, to investigate how tilting a birds wings up and down influences flight, he says.</p>",
    "type": "Sci-Tech",
    "category": "Robot",
    "banner394x449": "upload/banner394x449/public/pigeon-bot_feat.jpg",
    "banner600x500": "upload/banner600x500/public/pigeon-bot_feat.jpg",
    "banner788x443": "upload/banner788x443/public/pigeon-bot_feat.jpg",
    "banner800x460": "upload/banner800x460/public/pigeon-bot_feat.jpg",
    "file": "2020-05-31-PigeonBot-is-the-first-robot-that-can-bend-its-wings.json"
  },
  {
    "title": "SpaceX, NASA make history with first launch of astronauts",
    "created": "31 May, 2020",
    "author": "Nithya",
    "views": "463",
    "content": "<p>A new era of human spaceflight is set to begin as American astronauts once again launch on an American rocket from American soil to the International Space Station as part of NASA Commercial Crew Program. <strong>NASA astronauts Robert Behnken and Douglas Hurley will fly on SpaceXs Crew Dragon spacecraft</strong>, lifting off on a Falcon 9 rocket at 3:22 p.m. EDT May 30, from Launch Complex 39A in Florida, for an extended stay at the space station for the Demo-2 mission. The specific duration of the mission is to be determined.</p><p>As the final flight test for SpaceX, this mission will validate the companys crew transportation system, including the launch pad, rocket, spacecraft, and operational capabilities. This also will be the first time NASA astronauts will test the spacecraft systems in orbit. </p><p><strong>Behnken and Hurley</strong> were among the first astronauts to begin working and training on SpaceXs next-generation human space vehicle and were selected for their extensive test pilot and flight experience, including several missions on the space shuttle.</p><div class=\"ads-page-3\"></div><p><strong>Behnken will be the joint operations commander for the mission, responsible for activities such as rendezvous, docking and undocking, as well as Demo-2 activities while the spacecraft is docked to the space station</strong>. He was selected as a NASA astronaut in 2000 and has completed two space shuttle flights. Behnken flew STS-123 in March 2008 and STS-130 in February 2010, and he performed three spacewalks during each mission. Born in St. Anne, Missouri, he has bachelors degrees in physics and mechanical engineering from Washington University and earned a masters and doctorate in mechanical engineering from California Institute of Technology. Before joining NASA, Behnken was a flight test engineer with the U.S. Air Force.</p><p><strong>Hurley will be the spacecraft commander for Demo-2, responsible for activities such as launch, landing and recovery</strong>. He was selected as an astronaut in 2000 and has completed two spaceflights. Hurley served as pilot and lead robotics operator for both STS‐127 in July 2009 and STS‐135, the final space shuttle mission, in July 2011. The New York native was born in Endicott but considers Apalachin his hometown. He holds a Bachelor of Science degree in Civil Engineering from Tulane University in Louisiana and graduated from the U.S. Naval Test Pilot School in Maryland. Before joining NASA, he was a fighter pilot and test pilot in the U.S. Marine Corps.</p><p>Lifting off from Launch Pad 39A atop a specially instrumented Falcon 9 rocket, Crew Dragon will accelerate its two passengers to approximately 17,000 mph and put it on an intercept course with the International Space Station. Once in orbit, the crew and SpaceX mission control will verify the spacecraft is performing as intended by testing the environmental control system, the displays and control system and the maneuvering thrusters, among other things. In about 24 hours, Crew Dragon will be in position to rendezvous and dock with the space station. The spacecraft is designed to do this autonomously but astronauts aboard the spacecraft and the station will be diligently monitoring approach and docking and can take control of the spacecraft if necessary.</p><p>After successfully docking, Behnken and Hurley will be welcomed aboard station and will become members of the Expedition 63 crew. They will perform tests on Crew Dragon in addition to conducting research and other tasks with the space station crew.</p></p><div class=\"ads-page-3\"></div><p>Although the Crew Dragon being used for this flight test can stay in orbit about 110 days, the specific mission duration will be determined once on station based on the readiness of the next commercial crew launch. The operational Crew Dragon spacecraft will be capable of staying in orbit for at least 210 days as a NASA requirement.<p><strong>Upon conclusion of the mission, Crew Dragon will autonomously undock with the two astronauts on board, depart the space station and re-enter the Earths atmosphere</strong>. Upon splashdown just off Floridas Atlantic Coast, the crew will be picked up at sea by SpaceXs Go Navigator recovery vessel and return to Cape Canaveral.</p><p>The Demo-2 mission will be the final major step before NASAs Commercial Crew Program certifies Crew Dragon for operational, long-duration missions to the space station. This certification and regular operation of Crew Dragon will enable NASA to continue the important research and technology investigations taking place onboard the station, which benefits people on Earth and lays the groundwork for future exploration of the Moon and Mars starting with the agencys Artemis program, which will land the first woman and the next man on the lunar surface in 2024.</p>",
    "type": "News",
    "category": "Astronaut",
    "banner394x449": "upload/banner394x449/public/5ecebfae5af6cc2ad1440cd4.png",
    "banner600x500": "upload/banner600x500/public/5ecebfae5af6cc2ad1440cd4.png",
    "banner788x443": "upload/banner788x443/public/5ecebfae5af6cc2ad1440cd4.png",
    "banner800x460": "upload/banner800x460/public/5ecebfae5af6cc2ad1440cd4.png",
    "file": "2020-05-31-SpaceX-NASA-make-history-with-first-launch-of-astronauts.json"
  },
  {
    "title": "Scientists Have Created Hexagonal Salt, For First Time Ever",
    "created": "01 June, 2020",
    "author": "Nithya",
    "views": "463",
    "content": "<p>While it probably won't make it to your dining table, a new scientific achievement might be able to help in everything from radar equipment to electric cars: <strong>scientists have been able to form salt, aka sodium chloride (NaCl), in a hexagonal shape</strong></p><p>This is work done at the smallest of scales, with researchers able to get a thin film of hexagonal salt to form on top of a layer of diamond, due to the chemical interaction of both film and diamond substrate - something the team actually predicted would happen in advance through simulations.</p><div class=\"ads-page-3\"></div><p>It's the latest in a series of discoveries where scientists have been <strong>able to synthesise 2D materials with unusual crystal structures</strong>, and it's partly this self-imposed restriction to two dimensions that is enabling new and exotic structures to be formed.</p><p>\"Initially we decided to perform only a computational study of the formation of new 2D structures on different substrates, driven by the hypothesis that if a substrate interacts strongly with the NaCl thin film, one can expect major changes in the structure of the thin film,\" says material scientist Kseniya Tikhomirova from the Skolkovo Institute of Science and Technology (Skoltech) in Russia.</p><p>\"<strong>Indeed, we obtained very interesting results and predicted the formation of a hexagonal NaCl film on the diamond substrate</strong>, and decided to perform experiments. Thanks to our colleagues who performed the experiments, we synthesised this hexagonal NaCl, which proves our theory.\"</p><p>To begin with, Tikhomirova and her colleagues used a custom algorithm called USPEX to predict low-energy crystal structures based on the chemical elements used to make them. That in turn led to a hypothesis about the <strong>formation of NaCl structures on top of the diamond layer</strong>.</p><div class=\"ads-page-3\"></div><p>In order to prove the hypothesis correct, a series of high-pressure experiments were carried out to create a layer of hexagonal NaCl averaging just 6 nanometres thick - a layer that was verified with X-ray and electron diffraction measurements.</p><p>As soon as the film got any thicker than that, it reverted back to the standard cubic structure of salt - the one you would see if you seasoned your food with it and looked under an ultra-powerful microscope.</p><p>\"<strong>This shows that this simple and common compound, seemingly well-studied, hides many interesting phenomena, especially in nanoscale</strong>,\" says material scientist Alexander Kvashnin.</p><p>Where this might prove most useful is in diamond field-effect transistors or FETs, which can be deployed in a variety of high-powered electronics, including electric vehicles and telecommunications devices.</p><div class=\"ads-page-3\"></div><p>These FETs currently rely on hexagonal boron nitride, but hexagonal NaCl is likely to improve the stability of FETs even further (and make them more suitable for a broader range of purposes).</p><p>There's plenty more research ahead, too, not only in developing the hexagonal NaCl structures and the FETs based on them, but also <strong>predicting how exotic structures could be formed from other kinds of compounds</strong>.</p><p>Graphene remains the standard bearer for a 2D material that can exhibit surprising and useful properties, but it's likely that there are many other such discoveries still to come. As methods of modelling and analysis develop, hexagonal salt is likely to be just the start.</p><p>\"Our results show that the <strong>field of 2D materials is still very young, and scientists have discovered only a small portion of possible materials with intriguing properties</strong>,\" says Kvashnin.</p><p>The research has been published in the Journal of Physical Chemistry Letters.</p>",
    "type": "Sci-Tech",
    "category": "Salt",
    "banner394x449": "upload/banner394x449/public/salt-2.jpg",
    "banner600x500": "upload/banner600x500/public/salt-2.jpg",
    "banner788x443": "upload/banner788x443/public/salt-2.jpg",
    "banner800x460": "upload/banner800x460/public/salt-2.jpg",
    "file": "2020-06-01-Scientists-Have-Created-Hexagonal-Salt.json"
  },
  {
    "title": "Courtship time - Make it memorable, ways to add some spice",
    "created": "04 June, 2020",
    "author": "Karthik",
    "views": "463",
    "content": "<p>Finally you found a guy/girl with whom you can't wait to start most excitement time of your life.. But you see lot of time for wedding and So you got lot of time to know each other even more better.. The Best you can do is make this time memorable ;)</p><h3>1. Wedding planning, will be best time pass for each of you.</h3><p>Hmm, Obviously meeting in person in this courtship period would happen with this wedding planning action items.. So plan a day before like what else can be done on each wedding planning action item execution.. Like Need to buy a dress, plan something like we get matching dress and you both can have a walk, after this purchase ;)</p><h3>2. Try to know about Family, Friends of each other.</h3><p>Discuss in general like, how every day goes.. get to know who does what?</p><h3>3. Leave hints about what each of you like.</h3><p>Both of you should be leaving hints like what you like, what you expect.. none of you both are mind readers so make it easy for each other.. by doing so, both will know exactly what you are ;)</p><div class=\"ads-page-3\"></div><h3>4. Stop being shy, flirt a little.</h3><p>Yeah, stop being shy you two are going to get married soon.. complement each other, be honest about it.. and flirt a little.. makes your time memorable.</p><h3>5. Plan surprises once/twice</h3><p>Okay surprises, Men are little slow when it comes to planning surprises.. So try to make it memorable..</p><p>You found a person with whom you want to grow up old, Make the moments special and meaningful..</p>",
    "type": "Lifestyle",
    "category": "Love",
    "banner394x449": "upload/banner394x449/public/courtship_1.jpg",
    "banner600x500": "upload/banner600x500/public/courtship_1.jpg",
    "banner788x443": "upload/banner788x443/public/courtship_1.jpg",
    "banner800x460": "upload/banner800x460/public/courtship_1.jpg",
    "file": "2020-06-04-Courtship-time-Make-it-memorable-ways-to-add-some-spice.json"
  },
  {
    "title": "Egg Stuffed Paratha Recipe - Home made",
    "created": "04 June, 2020",
    "author": "Nithya",
    "views": "463",
    "content": "<p>Egg Stuffed Paratha is a delicious and healthy Paratha dish, filled with egg mixture. Both the eggs and whole wheat are healthy as it provides the right amount of proteins and carbs. The egg mixture has finely chopped onions, green chili and coriander leaves. This is then slided into the half cooked paratha pockets and cooked further. The Egg Stuffed Parathas are quite filling in itself.</p><h3>Ingredients Needed?</h3><p><strong>For the dough: </strong> Wheat flour 1 cup, Water, Oil & Salt for taste.</p><p><strong>For the egg stuffing: </strong> 2 Eggs, 1 Onion, 5 Green chilli, Coriander leaves, Chilli powder, Cumin powder, Garam masala, Chaat masala & Salt for taste.</p><div class=\"ads-page-3\"></div><h3>How to Cook?</h3><p>In a bowl, add wheat flour, salt, oil and mix.. Gradually add water and knead the dough.. Divide the dough into equal portions.. Place one of the portions onto a rolling surface and flatten it.. Roll out the dough flat..</p><p>Meanwhile, crack open the eggs into a glass/bowl, add all the ingredients for the stuffing.. Mix everything well (keep it dry, not too watery)..</p><p>Heat a tawa, place the rolled out chapati onto the tawa.. Flip the chapati and cook on both sides for a 10 - 15 seconds..</p><p>Make a slit on the chapati, create a pocket.. Pour the egg mixture into the slit and seal it.. Let the chapati cook and egg set inside.. Apply ghee and cook on both sides till it is completely cooked..</p><p>Cut the parathas and serve hot..</p><ul class=\"check\"><li>Prep time: 30 minutes</li><li>Cook time: 15 minutes</li><li>Number of servings: 4 persons</li></ul>",
    "type": "Food",
    "category": "Egg",
    "banner394x449": "upload/banner394x449/public/egg.jpg",
    "banner600x500": "upload/banner600x500/public/egg.jpg",
    "banner788x443": "upload/banner788x443/public/egg.jpg",
    "banner800x460": "upload/banner800x460/public/egg.jpg",
    "file": "2020-06-04-Egg-Stuffed-Paratha-Home-made-recipe.json"
  },
  {
    "title": "Bangalore <i class='fa fa-exchange'></i> Mysore (2 Days + 1 Night, Ride Plan)",
    "created": "04 June, 2020",
    "author": "Karthik",
    "views": "463",
    "content": "<p>Two days Ride from <strong>Bangalore <i class=\"fa fa-angle-double-right\"></i> Mysore <i class=\"fa fa-angle-double-right\"></i> Bangalore</strong>, If you are a Couple riding on Bike or You are riding with a Friend in two different Bikes, then this plan for two days works very well. Below is the route mentioned where you can plan accordingly, if at all you need to spend some more time in some place in the list, you can skip the next place in the planned route.</p>\n                                <h3>Route</h3>\n                                <p><strong>Bangalore <i class=\"fa fa-arrow-right\"></i> Chamundeshwari Temple <i class=\"fa fa-arrow-right\"></i> Mysuru Sand Sculpture Museum <i class=\"fa fa-arrow-right\"></i> Karanji Lake <i class=\"fa fa-arrow-right\"></i> Mysore Palace <i class=\"fa fa-arrow-right\"></i> KRS Dam <i class=\"fa fa-arrow-right\"></i> Yedmuri Falls / Balmuri Falls <i class=\"fa fa-arrow-right\"></i> Ranganathittu Bird Sanctuary <i class=\"fa fa-arrow-right\"></i> Sri Ranganathaswamy Temple (Pancharanga Kshetram) <i class=\"fa fa-arrow-right\"></i> Janapada Loka <i class=\"fa fa-arrow-right\"></i> Bangalore</strong></p>\n                                <div class=\"ads-page-3\"></div>\n                                <h3>Map - <a target=\"_blank\" href=\"https://goo.gl/maps/kUECyoA6y1y84P2i7\">https://goo.gl/maps/kUECyoA6y1y84P2i7</a></h3>\n                                1. Bangalore <i class=\"fa fa-arrow-right\"></i> <strong>Chamundeshwari Temple: </strong>\n                                <ul class=\"check\">\n                                    <li>Distance: 3h 30min - 4h (176 km)</li>\n                                    <li>Leave Bangalore as soon as possible in the morning, 4:00 / 4:30 so that you reach somewhere between 7:30 - 8:00.</li>\n                                    <li>Time you can Spend: 1 - 2 hours.</li>\n                                    <li>It is considered as a Shakti Peetha and one among the 18 Maha Shakti Peethas.</li>\n                                    <li>Have Breakfast around 9:30 - 10:30.</li>\n                                </ul>\n                                2. Chamundeshwari Temple <i class=\"fa fa-arrow-right\"></i> <strong>Mysuru Sand Sculpture Museum: </strong>\n                                <ul class=\"check\">\n                                    <li>Distance:  15 min (7 km) </li>\n                                    <li>Time you can Spend: 2 - 2.5 hours</li>\n                                    <li>With 150 sand sculptures on display, on a one-acre land. Also three-dimensional selfie gallery.</li>\n                                    <li>Have Lunch around 1:30 - 2:00.</li>\n                                </ul>\n                                <div class=\"ads-page-3\"></div>\n                                3. Mysuru Sand Sculpture Museum <i class=\"fa fa-arrow-right\"></i> <strong>Karanji Lake: </strong>\n                                <ul class=\"check\">\n                                    <li>Distance: 10 min (4 km) </li>\n                                    <li>Time you can Spend: 1.5 - 2 hours</li>\n                                    <li>Karanji Lake has a nature park consisting of a butterfly park and a walk-through aviary and You have a Boating.</li>\n                                </ul>\n                                4. Karanji Lake <i class=\"fa fa-arrow-right\"></i> <strong>Mysore Palace: </strong>\n                                <ul class=\"check\">\n                                    <li>Distance: 5 min (2 km)</li>\n                                    <li>Time you can Spend: 1 - 1.5 hours</li>\n                                    <li>An historical palace, where you can see Indo-Saracenic architectural style of domes.</li>\n                                </ul>\n                                5. Mysore Palace <i class=\"fa fa-arrow-right\"></i> <strong>KRS Dam: </strong>\n                                <ul class=\"check\">\n                                    <li>Distance: 40 min (24 km) </li>\n                                    <li>Time you can Spend: till 8:00 PM to 8:30 PM</li>\n                                    <li>Brindavan Gardens is show garden that has botanical park, with fountains, as well as boat rides beneath dam.</li>\n                                    <li>Have Dinner around 8:00 - 8:30.</li>\n                                </ul>\n                                <p>Book hotel's near by to the Dam area so that you can reach by 9:00 and take rest.</p>\n                                <div class=\"ads-page-3\"></div>\n                                6. KRS Dam <i class=\"fa fa-arrow-right\"></i> <strong>Yedmuri Falls / Balmuri Falls: </strong>\n                                <ul class=\"check\">\n                                    <li>Distance: 15 min (7 - 8 km)</li>\n                                    <li>Leave hotel by having Breakfast around 8:30 - 9:00</li>\n                                    <li>Time you can Spend: 1.5 - 2 hours</li>\n                                    <li>You can swim if you can, You have Boating with small ones(theppa in kannada), Have a tasty fish their.</li>\n                                </ul>\n                                7. Yedmuri Falls / Balmuri Falls <i class=\"fa fa-arrow-right\"></i> <strong>Ranganathittu Bird Sanctuary: </strong>\n                                <ul class=\"check\">\n                                    <li>Distance: 20 min (11 km)</li>\n                                    <li>Time you can Spend: 2 - 3 hours</li>\n                                    <li>Roughly 170 bird species[10] have been recorded. Ranger-guided boat tours of isles are available, are a good way to watch birds, crocodiles, otters, and bats.</li>\n                                    <li>Have Lunch around 2:00 - 2:30</li>\n                                </ul>\n                                8. Ranganathittu Bird Sanctuary <i class=\"fa fa-arrow-right\"></i> <strong>Sri Ranganathaswamy Temple: </strong>\n                                <ul class=\"check\">\n                                    <li>Distance: 30 min (15 km)</li>\n                                    <li>Time you can Spend: 1 - 1.5 hours</li>\n                                    <li>It is one of the five important pilgrimage sites of Sri Vaishnavism along the river Kaveri for devotees of Ranganatha.</li>\n                                </ul>\n                                <div class=\"ads-page-3\"></div>\n                                9. Sri Ranganathaswamy Temple <i class=\"fa fa-arrow-right\"></i> <strong>Janapada Loka: </strong>\n                                <ul class=\"check\">\n                                    <li>Distance: 1h - 1h 15min (75 km)</li>\n                                    <li>Time you can Spend: 1.5 - 2 hours</li>\n                                    <li>Have some drinks & snaks around 5:00 PM</li>\n                                    <li>You can see Folk arts museum, Loka Mahal, Chitra Kuteera, Doddamane, Shilamala, Ayagaramala.</li>\n                                </ul>\n                                10. Janapada Loka <i class=\"fa fa-arrow-right\"></i> <strong>Bangalore: </strong>\n                                <ul class=\"check\">\n                                    <li>Distance: 1h 30min - 2h (55 km) </li>\n                                    <li>You can be at home by 9:00 - 9:30.</li>\n                                </ul><p>Hope you like, 2 days trip plan from <strong>Bangalore <i class=\"fa fa-angle-double-right\"></i> Mysore <i class=\"fa fa-angle-double-right\"></i> Bangalore</strong>. Its bit tight schedule, if you feel you need to spend some time in between you can skip the coming one and plan your trip accordingly.</p>",
    "type": "Travel",
    "category": "Bangalore, Mysore, Couple",
    "banner394x449": "upload/banner394x449/public/b-m-b_0.png",
    "banner600x500": "upload/banner600x500/public/b-m-b_0.png",
    "banner788x443": "upload/banner788x443/public/b-m-b_0.png",
    "banner800x460": "upload/banner800x460/public/b-m-b_0.png",
    "file": "2020-06-04-Two-days-trip-from-Bangalore-to-Mysore.json"
  },
  {
    "title": "UnConditional Love in a Couple's Relationship",
    "created": "06 June, 2020",
    "author": "Sathya",
    "views": "463",
    "content": "<p>It is commonly said that Women are complex in mental nature while Men remain easy to understand and simple. Whatever be the reasons that backup this comment, <strong>in relationships both Men and Women follow slightly diverted paths.</strong> What Men look for in a relationship is not what motivates Women to fall in relationships. The differences in desires, mentalities, passion, expression levels etc., are resulted from some unknown causes; might be hormonal differences, mindset changes or social concepts.</p>\n                                <p><strong>Women get time to be settled in a relationship</strong>, but if settled down, they remain dedicated and sacrificing for it; while <strong>Men jump into relationships so easily and get out of it with same easiness</strong>. However, experts say that if provided with the requirements and if matched with his desires, even Men ardently remain in the relationships.</p>\n                                <div class=\"ads-page-3\"></div>\n                                <h3>UnConditional Love ??</h3>\n                                <p>UnConditional Love is the active choice to Love someone no matter what may come your way.</p>\n                                <p>In UnConditional Love, satisfaction comes from putting someone else first and prioritizing their health and happiness with no expectation of reward for yourself. Experts agree that this is only possible if <strong>you first practice unconditional Love with yourself</strong>.</p>\n                                <ul class=\"check\">\n                                    <li><strong>Practice open communication</strong>, so that both of your needs can be met.</li>\n                                    <li><strong>Communicate in a non-defensive way</strong>. Express your feelings while listening and taking the other person's feelings into account.</li>\n                                    <li><strong>Don't let the little annoyances of life override your Love</strong>. Unconditional Love means seeing past the squabbles about the little things in life. If you have a commitment of Love that is larger than those things, you will have staying power.</li>\n                                    <li><strong>Share power in your relationship</strong>. No one person should get everything they want, or this will lead to resentment by the other person.</li>\n                                </ul>\n                                <p>One thing is certain; relationships that are completely lacking in unconditional Love are unlikely to succeed. <strong>Beliefs and Lifestyle are likely to change over time</strong>.</p>",
    "type": "Lifestyle",
    "category": "Couple",
    "banner394x449": "upload/banner394x449/public/rafal_0.jpg",
    "banner600x500": "upload/banner600x500/public/rafal_0.jpg",
    "banner788x443": "upload/banner788x443/public/rafal_0.jpg",
    "banner800x460": "upload/banner800x460/public/rafal_0.jpg",
    "file": "2020-06-06-Un-Conditional-Love-in-a-relationship.json"
  },
  {
    "title": "Checklist for making a Eco-Friendly Home",
    "created": "07 June, 2020",
    "author": "Karthik",
    "views": "463",
    "content": "<p>To build a home, which makes low-impact environmentally. And built using materials & technology that lowers its energy needs in future. And also make sure built home is reliable for few decades with minimal energy spent on it. To do this, you have to consider Energy? what Sustainable materials to be used? how it impacts on our health? And what is costs</p>\n                                <p>Before getting into the details of each individual items, lets make a checklist of few things a human needs in day to day life. Below is the checklist.</p>\n                                <div class=\"ads-page-3\"></div>\n                                <h4>Checklist</h4>\n                                <ul class=\"check\">\n                                    <li><strong>Land + Compound Wall + Lot of Trees</strong> - yeah you need this</li>\n                                    <li><strong>Thermal insulation, Walls & Roof</strong> - to absorb/release the heat</li>\n                                    <li><strong>Borewell</strong> - for water</li>\n                                    <li><strong>Photovoltaic panels</strong> - for electric energy</li>\n                                    <li><strong>Vegetable patch + Geothermal heating + Farming</strong> - for food</li>\n                                    <li><strong>Greywater collection + Composting toilet</strong> - for reuseable water</li>\n                                    <li><strong>Biogas Plant</strong> - for gas</li>\n                                    <li><strong>Rainwater harvesting</strong> - for water</li>\n                                    <li><strong>Wind turbine</strong> - for extra energy</li>\n                                    <li><strong>Garden / Mini Forest + Pond + Bicycle</strong> - for Lifestyle</li>\n                                    <li><strong>Gear</strong> - for all this above work</li>\n                                </ul>\n                                <p>If you start thinking with the above list, then you will be able to visualize a small home in a small forest with necessary needs. Let read the in-details of each item in the list in the future articles.</p>",
    "type": "Sci-Tech",
    "category": "Environment, House, SolarPanel, RainHarvesting",
    "banner394x449": "upload/banner394x449/public/eco-home.jpg",
    "banner600x500": "upload/banner600x500/public/eco-home.jpg",
    "banner788x443": "upload/banner788x443/public/eco-home.jpg",
    "banner800x460": "upload/banner800x460/public/eco-home.jpg",
    "file": "2020-06-07-Home-with-low-impact-on-envirnoment.json"
  },
  {
    "title": "Indian style Spanish omelette, Egg + Potato + Onion",
    "created": "07 June, 2020",
    "author": "Nithya",
    "views": "463",
    "content": "<p>Egg with Potato plus Onion will make a delicious and healthy breakfast, You have have it as a Breakfast or you can have it as a Snack in the day, will also be a great starter in the barbecue. This combination of dish is called Spanish omelette, but lets make it in Indian Style.</p>\n                                <h3>Ingredients Needed?</h3>\n                                <p>3 Eggs, 4 medium sized Potato (chopped in small) & 4 medium sized Onion (chopped in small), 4-5 Green chilli (chopped in small), Chilli powder Oil & Salt for taste.</p>\n                                <div class=\"ads-page-3\"></div>\n                                <h3>How to Cook?</h3>\n                                <p>Have a bowl on stove with low flame, Put 3-4 table spoons of Oil (as needed).. Put the chopped Onion, chopped Potato & chopped Chilli and Fry in the low flame.. Put some salt and continue to Fry for 6-8 min untill the stuff is medium fried..</p>\n                                <p>Take the Fried stuff into another bowl and let it cool for a while, Meanwhile you prepare the other stuff</p>\n                                <p>Take a bowl and break the Eggs & add Salt + Chilli powder and Mix it well, actually mix it for 2-3 min.. so that the mixture is thick..</p>\n                                <p>Now mix the Fried stuff in to the Egg stuff and mix it well, Now you have the complete stuff ready which is ready for cooking..</p>\n                                <p>Now have a tawa on the stove and Put 2-3 tea spoons of Oil and Pour the prepared stuff, Let it Fry in the low flame for 2-3 min.. Now Fry the other side of Omellete for 2-3 min.. Once its fried on both sides take it to out, its ready for serve..</p>\n                                <ul class=\"check\">\n                                    <li>Prep time: 30 minutes</li>\n                                    <li>Cook time: 15 minutes</li>\n                                    <li>Number of servings: 3 persons</li>\n                                </ul>",
    "type": "Food",
    "category": "Egg",
    "banner394x449": "upload/banner394x449/public/spanish-omelette.jpg",
    "banner600x500": "upload/banner600x500/public/spanish-omelette.jpg",
    "banner788x443": "upload/banner788x443/public/spanish-omelette.jpg",
    "banner800x460": "upload/banner800x460/public/spanish-omelette.jpg",
    "file": "2020-06-07-Indian-style-spanish-omellete.json"
  },
  {
    "title": "Bangalore <i class='fa fa-exchange'></i> Ghati Subramanya (Morning Ride Plan)",
    "created": "12 June, 2020",
    "author": "Karthik",
    "views": "463",
    "content": "<p><strong>Ghati Subramanya</strong> is an ancient Hindu temple, 50 kms away from Bangalore towards Doddaballapur situated on the outskirts of Bangalore. Ghati Subramanya has a recorded <strong>history of more than 600 years</strong>. Ghati Subramanya Temple was first developed by the Ghorpade rulers of Sandur who ruled parts of Bellary.</p>\n                                <p>The uniqueness of this temple is the prime deity <strong>\"Lord Karthikeya\" (Subramanya)</strong> & <strong>\"Lord Narasimha\"</strong> is found together. According to mythology, both idols are believed to have emerged from the earth.</p>\n                                <h3>Route</h3>\n                                <p><strong>Bangalore <i class=\"fa fa-arrow-right\"></i> Yelahanka <i class=\"fa fa-arrow-right\"></i> Doddaballapur <i class=\"fa fa-arrow-right\"></i> Ghati Subramanya</strong></p>\n                                <div class=\"ads-page-3\"></div>\n                                <h3>Map - <a href=\"https://goo.gl/maps/1aYV1i5QfNegutMQ9\" target=\"_blank\">https://goo.gl/maps/1aYV1i5QfNegutMQ9</a></h3>\n                                1. Bangalore <i class=\"fa fa-arrow-right\"></i> <strong>Yelahanka</strong>\n                                <ul class=\"check\">\n                                    <li>Leave Bangalore as soon as possible in the morning, so that you reach somewhere between 5:15 - 5:30.</li>\n                                    <li>You have to take diversion from here towards Doddaballapur.</li>\n                                    <li>Traffic will be less in the mornings & Roads are good.</li>\n                                </ul>\n                                2. Yelahanka <i class=\"fa fa-arrow-right\"></i> <strong>Doddaballapur</strong>\n                                <ul class=\"check\">\n                                    <li>Ride towards Doddaballapur, you will reach by 6:10 - 6:30.</li>\n                                    <li>Take a 5 min - 10 min break, have Tea/Coffee.</li>\n                                    <li>You have to take diversion from here towards Ghati Subramanya.</li>\n                                    <li>Traffic will be less in the mornings & Roads are quite good.</li>\n                                </ul>\n                                <div class=\"ads-page-3\"></div>\n                                3. Doddaballapur <i class=\"fa fa-arrow-right\"></i> <strong>Ghati Subramanya</strong>\n                                <ul class=\"check\">\n                                    <li>Ride towards Ghati Subramanya, you will reach by 6:50 - 7:00.</li>\n                                    <li>Get into the temple, you would feel pleasent in the morning, It might take, 15 min - 20 min for Darshana.</li>\n                                    <li>Have tiffen after coming out of temple, Explore park near temple, Their is a small shopping area, if interested checkout. Then Return back to Bangalore.</li>\n                                    <li>Traffic will be less in the mornings & Roads are quite good, but ride carefully on village roads people / animals will be crossing the roads.</li>\n                                </ul>\n                                4. Ghati Subramanya <i class=\"fa fa-arrow-right\"></i> <strong>Bangalore</strong>\n                                <ul class=\"check\">\n                                    <li>Ride towards Bangalore, you might be riding back around 8:30 - 9:00.</li>\n                                    <li>On the return from temple, you can stop roadside to get some fresh vegetables, fruits sold from nearby farms.</li>\n                                    <li>You would be in Bangalore somewhere around 10:00.</li>\n                                </ul>\n                                <p>Hope you like, Morning trip plan from <strong>Bangalore <i class=\"fa fa-angle-double-right\"></i> Ghati Subramanya <i class=\"fa fa-angle-double-right\"></i> Bangalore</strong>. Its bit tight schedule, But it will be nice to have ride in the Morning.</p>",
    "type": "Travel",
    "category": "Bangalore, GhatiSubramanya",
    "banner394x449": "upload/banner394x449/public/Peoples-Blog-Bangalore-Ghati-Subramanya.png",
    "banner600x500": "upload/banner600x500/public/Peoples-Blog-Bangalore-Ghati-Subramanya.png",
    "banner788x443": "upload/banner788x443/public/Peoples-Blog-Bangalore-Ghati-Subramanya.png",
    "banner800x460": "upload/banner800x460/public/Peoples-Blog-Bangalore-Ghati-Subramanya.png",
    "file": "2020-06-12-Short-trip-from-Bangalore-to-Ghati.json"
  }
]
