[{"title":"Carlsberg Elephant Strong","img":"\/assets\/img\/alcohol\/beer\/carlsberg-elephant-strong.jpg","desc":"The strong Carlsberg Elephant is a so-called light 'Bock bier' and was brewed for the first time in 1959. It is vinous and fruity with characteristic taste impressions of apples, melon, banana and Carmel balanced by a dry bitterness. You also sense the hints of oak, bark, roots, nuts and pine. needles. Once enjoyed, never forgotten.","url":"\/carlsberg-elephant-strong.html","category":"","flavour":"This Elephant Strong Beer has a character with Apple, Melon, Banana & Caramel, Balanced with Hint of Oak, Bark, Nuts & Malty with the Note of Barley & Hops. Serve slightly chilled.","abv":"7.2","color":"","brand":"Carlsberg","country":"India","alcohol":"Beer"},{"title":"Paul John XO Brandy","img":"\/assets\/img\/alcohol\/brandy\/paul-john-xo-brandy.jpg","desc":"Created from the famed Ugni Blanc and the rich Bangalore purple grape, the brandy is matured in specially selected, medium toasted new French limousine oak barrels. Paul John XO has gentle honeyed aromas, deliciously resonating with fresh fig, strawberry liquorice, orange zest and a touch of herbs that sets of a light butterscotch. On the palate is tender cranberry and succulent rum raisin in beautifully balanced yet delectably complex flavours. The glorious lengthy finish is intricately meshed with tremendous notes of sweet oak and an alluring natural caramel.","url":"\/paul-john-xo-brandy.html","category":"","flavour":"Sweetly honeyed aroma, deliciously resonating with fresh fig, apricot, strawberry liquorice, orange zest and a touch of herbs that brilliantly sets off the light butterscotch.","abv":"46","color":"","brand":"Paul John","country":"India","alcohol":"Brandy"},{"title":"Hapusa Himalayan Dry Gin","img":"\/assets\/img\/alcohol\/gin\/hapusa-himalayan-dry-gin.jpg","desc":"From Nao Spirits comes Hapusa Gin, a Himalayan gin produced in India using local juniper, turmeric, mango, ginger, cardamom, coriander seeds, gondhoraj limes and almonds. All botanicals are added in a one-shot method to the still, named Agatha. The spirit is a true celebration of Indian ingredients, which would usually be found in every kitchen cupboard and have now been given a new lease of life in Hapusa Gin!","url":"\/hapusa-himalayan-dry-gin.html","category":"","flavour":"An initial burst of vibrant lime citrus, leading into earthy pine, with a nutty undertone, floral notes and a spiced finish, with distinct ginger and juniper lingering.","abv":"43","color":"","brand":"Hapusa","country":"India","alcohol":"Gin"},{"title":"SOCI The Indian Gin Story","img":"\/assets\/img\/alcohol\/gin\/soci-the-indian-gin-story.jpg","desc":"SOCI The Indian Gin Story is a premium craft gin that captures the essence of India through its blend of locally sourced botanicals. With an ABV of 42%, it delivers a crisp and refreshing profile, highlighted by citrus, juniper and distinctive Indian spices. The clear spirit showcases traditional gin characteristics while incorporating unique regional flavors, making it a standout choice for gin enthusiasts. Its elegant balance and aromatic complexity make it ideal for both classic and innovative gin cocktails.","url":"\/soci-the-indian-gin-story.html","category":"Craft Gin","flavour":"Citrusy with juniper and herbaceous notes, complemented by subtle spices and botanicals unique to Indian ingredients.","abv":"42","color":"Clear","brand":"SOCI","country":"India","alcohol":"Gin"},{"title":"Old Monk XXX Dark Rum","img":"\/assets\/img\/alcohol\/rum\/old-monk-xxx-dark-rum.jpg","desc":"Old Monk is one of the top selling rums. A velvet smooth dark rum with a hint of vanilla, it has an alcohol content of 42. 8%. Honoured the world over, Old Monk had been awarded gold medals at Monde World Selections since 1982. It’s a classic 7 year blended dark rum. With the first drop of Old Monk Rum, the sheer aroma of distilled cane sugar grown in lush green fields of India, stirs up the age-old legend. Old Monk Rum is a form of the legendary Samaras of India centuries old scriptures-- The Drink of Gods and Lords of India.","url":"\/old-monk-xxx-dark-rum.html","category":"DARK RUM","flavour":"This Dark rum is Dark Brown in colour. Vanilla Pod, Raisin, Chocolate Coated Peanuts & Fruit sweet aroma and delicious vanilla caramel flavour. This is an excellent choice for making comforting cocktails like a Hot Buttered Rum.","abv":"42.8","color":"","brand":"Old Monk","country":"India","alcohol":"Rum"},{"title":"Stroh 160 Rum","img":"\/assets\/img\/alcohol\/rum\/stroh-original-spiced-rum-160-proof.jpeg","desc":"Stroh 160 Rum is an Austrian overproof rum renowned for its exceptionally high alcohol content of 80% ABV. It is often referred to as Stroh 160 due to its 160 proof rating, which is among the highest available for commercially produced spirits. Flavor Profile: Stroh 160 offers a powerful and distinctive flavor profile. It features rich, intense notes of vanilla, molasses and spices. The high proof contributes to a warming sensation and a robust, bold flavor experience. It is also known for its slightly sweet and spicy characteristics. Uses: Due to its high proof, Stroh 160 is typically used in small quantities. It is a popular ingredient in cocktails, particularly those requiring a strong rum presence. Additionally, it is often used in cooking and baking, especially in recipes that call for flambéing or adding a strong rum flavor. Consumption: While it can be enjoyed in cocktails or diluted, drinking Stroh 160 neat or on the rocks is not common due to its potency. It is recommended to handle it with caution and to use it in moderation, especially if consuming it straight. Stroh 160 Rum is highly regarded for its strength and is often sought after by enthusiasts who appreciate high-proof spirits or need a potent ingredient for their culinary and mixological endeavors.","url":"\/stroh-original-spiced-rum-160-proof.html","category":"Overproof Rum","flavour":"Intense, rich flavor with strong notes of vanilla, spices and molasses. The high proof adds a significant warmth and complexity to the taste.","abv":"80","color":"Deep amber or golden brown","brand":"Stroh","country":"Austria","alcohol":"Rum"},{"title":"Maya Pistola Tequila Rosa Select","img":"\/assets\/img\/alcohol\/tequila\/maya-pistola-tequila-rosa-select.jpg","desc":"Maya Pistola Agavepura is craft 100% Agave Spirit made from the Wild Agave Americana that grows in India’s Deccan Plateau. India’s first aged 100% Agave Spirit, it’s additive-free, double distilled in pot stills which lends the characteristic smoothness and a rich flavor profile. Our spirit is matured in different Oak casks comprising of Virgin American Oak, Ex-Bourbon Casks and Ex-Wine Barrels, depending on the variant type. Authenticity is central to our Ethos, Each bottle is unique. Each bottle has its own character. Each bottle is its own truth.","url":"\/maya-pistola-tequila-rosa-select.html","category":"","flavour":"Dark berries, floral notes with a subtle sweet smoke in the background, Best savored chilled, on ice with soda or tonic","abv":"37.5","color":"","brand":"Maya Pistola","country":"India","alcohol":"Tequila"},{"title":"Villa Vercelli Gold Tequila","img":"\/assets\/img\/alcohol\/tequila\/villa-vercelli-gold-tequila.jpg","desc":"Villa Vercelli Gold Tequila is a premium tequila that stands out for its quality and craftsmanship. Offers a refined and smooth drinking experience due to its aging process and high-quality blue agave. Its complex flavor profile makes it a versatile choice for various cocktails or straight sipping. While it comes with a higher price tag and may have limited availability, its elegant packaging and premium quality make it a desirable option for those who appreciate fine tequila.","url":"\/villa-vercelli-gold-tequila.html","category":"","flavour":"Villa Vercelli Gold Tequila offers a smooth, rich taste with caramel, vanilla, toasted oak and subtle spice, making it ideal for sipping or high-quality cocktails.","abv":"40","color":"Golden or Amber","brand":"Villa Vercelli","country":"India","alcohol":"Tequila"},{"title":"Smoke Vodka Aniseed","img":"\/assets\/img\/alcohol\/vodka\/SMOKE-VODKA-ANISEED-723.jpeg","desc":"The smoke vodka aniseed is a mystical aromatic spirit with a bold and distinct flavour. Derived from “saunf” as it's known in india, this vodka is perfect for complex and flavourful cocktails.","url":"\/smoke-vodka-aniseed.html","category":"Aniseed","flavour":"Delicate aromas of aniseed and licorice, Creamy and sweet, Subtle fennel blossom","abv":"42.8","color":"","brand":"Smoke","country":"India","alcohol":"Vodka"},{"title":"Magic Moments Pure Grain","img":"\/assets\/img\/alcohol\/vodka\/magic-moments-pure-grain.jpeg","desc":"The enthralling taste of Magic Moments, an international packaging not only set the town buzzing, but also unleashed the thirst for making every moment grand. Produced from the finest grains, its triple distilling process is a mark of absolute purity that simply brings magic to life. This premium vodka is smooth and perfectly blends with your senses, giving an enriched taste. The spirit of Magic Moments can be celebrated with various tantalizing flavours that take excellence a notch up. Make every moment magical by choosing any of our flavours and pop open a new celebration, every single time.","url":"\/magic-moments-pure-grain.html","category":"","flavour":"Light to begin with on the nose, but develops a hard finish. A growing warmth on the palate, resulting in a slight spice hit on the back of the throat and a bold, long finish.","abv":"42.8","color":"","brand":"Magic Moment","country":"India","alcohol":"Vodka"},{"title":"Smirnoff Vodka","img":"\/assets\/img\/alcohol\/vodka\/smirnoff-vodka.jpeg","desc":"Smirnoff is the most awarded name in vodka, with countless years of heritage and unmatched quality sold in over 130 countries . It is triple distilled from a blend of different grains and filtered ten times through seven columns of environmentally sustainable charcoal for an exceptionally pure-tasting, smooth spirit.","url":"\/smirnoff-vodka.html","category":"","flavour":"Smirnoff vodka has a clean taste with a slightly sweet flavor. It is also very smooth, which makes it easy to drink. Smirnoff vodka is a good choice for those who are looking for a vodka that is not too strong. If you are looking for a vodka that has a little more flavor, you may want to try another brand.","abv":"41.3","color":"","brand":"Smirnoff","country":"India","alcohol":"Vodka"},{"title":"Romanov Premium Vodka","img":"\/assets\/img\/alcohol\/vodka\/romanov-premium-vodka.jpeg","desc":"The brand derives its name from the Romanov dynasty which ruled the Russian Empire from 1612 to 1917. It has a two-star rating from international taste and Quality Institute. It has a 42.8% alcohol by volume.","url":"\/romanov-premium-vodka.html","category":"","flavour":"This Pure Vodka is Crystal clear (Transparent) in colour. Light to begin on nose, but develops a hard finish. On palate warm and slightly spicy open with the note of pure spirit and Spice. finish is smooth and long.","abv":"42.8","color":"","brand":"Romanov","country":"India","alcohol":"Vodka"},{"title":"Spirytus Rektyfikowany","img":"\/assets\/img\/alcohol\/vodka\/spirytus-rektyfikowany.webp","desc":"Spirytus Rektyfikowany is a high-proof rectified spirit from Poland, boasting an impressive 96% ABV. It is renowned for its neutral flavor profile, which makes it ideal for use in cocktails, infusions and culinary applications where a high concentration of alcohol is needed. Its clear appearance and potent nature require careful handling and it is typically diluted before consumption or use. This spirit is a staple in professional and home kitchens for making homemade liqueurs and other strong alcoholic mixtures.","url":"\/spirytus-rektyfikowany.html","category":"Rectified Spirit","flavour":"Extremely neutral, with a strong alcohol presence and minimal flavor, primarily used as a base spirit.","abv":"96","color":"Clear","brand":"Spirytus","country":"Poland","alcohol":"Vodka"},{"title":"Rampur Double Cask Single Malt Whisky","img":"\/assets\/img\/alcohol\/whiskey\/rampur-double-cask-single-malt.jpeg","desc":"Matured in a combination of ex-bourbon barrels and European oak sherry casks, this Indian single malt from Rampur has a rich, complex character. Aromas of tropical fruits mingle with sweet malt, oak, honey and dried fruits on the nose and the palate offers notes of dark berries, dried fruits, cinnamon, nutmeg and salted caramel.","url":"\/rampur-double-cask-single-malt-whisky.html","category":"India Single Malt Whisky","flavour":"","abv":"45","color":"","brand":"Rampur","country":"India","alcohol":"Whiskey"},{"title":"Paul John Brilliance","img":"\/assets\/img\/alcohol\/whiskey\/paul-john-brilliance.jpeg","desc":"An unpeated whisky from Paul John Distillers, released in early 2013 to much acclaim. It's made using barley from the foothills of the Himalayas and is distilled and matured in Goa, producing a fruity spirit with a creamy texture.","url":"\/paul-john-brilliance.html","category":"India Single Malt Whisky","flavour":"Orange blossom honey with the Vanilla spinning tangled","abv":"46","color":"","brand":"Paul John","country":"India","alcohol":"Whiskey"},{"title":"Amrut Peated Cask Strength Malt","img":"\/assets\/img\/alcohol\/whiskey\/amrut-peated-cask-strength-malt.jpeg","desc":"This Amrut Peated is a remarkable cask-strength belter that has been garnering international awards and recognition ever since its arrival in 2008. Rich in texture and generously peated, this really has the quality to stand up to and even surpass, its similarly-priced Islay rivals.","url":"\/amrut-peated-cask-strength-malt.html","category":"India Single Malt Whisky","flavour":"Malt, Fruit, Oak and Smoke","abv":"62.8","color":"","brand":"Amrut","country":"India","alcohol":"Whiskey"},{"title":"Woodburns Contemporary Indian Whisky","img":"\/assets\/img\/alcohol\/whiskey\/woodburns-contemporary-indian-whisky.jpeg","desc":"A deep, rich amber coloured whisky, Woodburns introduces itself with warm & aromatic notes layered with sesame oil, oak resin, dried green herbs and a touch of smoke. A silky mouthfeel with a well rounded oiliness, Woodburns offers light oak & nutty notes with a subtle sweetness.","url":"\/woodburns-contemporary-indian-whisky.html","category":"Blended Whisky","flavour":"A deep, rich amber coloured whisky, Woodburns introduces itself with warm & aromatic notes layered with sesame oil, oak resin, dried green herbs and a touch of smoke. A silky mouthfeel with a well rounded oiliness, Woodburns offers light oak & nutty notes with a subtle sweetness.","abv":"42.8","color":"","brand":"Woodburns","country":"India","alcohol":"Whiskey"},{"title":"Maqintosh Blue Reserve","img":"\/assets\/img\/alcohol\/whiskey\/maqintosh-blue-reserve.jpeg","desc":"First released in 1982, maqintosh available premium whisky quickly captured the imagination of whisky lovers in india being one of the first whisky brands in india to contain single malts produced in india. Today, the maqintosh brand is in over 22 countries worldwide.","url":"\/maqintosh-blue-reserve.html","category":"","flavour":"The nose is malty and nutty with a good almond touch and notes of ginger, oak, allspice and clove. However, the taste is spicy with clove, cinnamon, cardamom and ginger notes, along with touches of brown sugar and honey.","abv":"42.8","color":"","brand":"Amrut","country":"India","alcohol":"Whiskey"},{"title":"Fireball Cinnamon Whisky","img":"\/assets\/img\/alcohol\/whiskey\/fireball-cinnamon-whisky.jpeg","desc":"The drink goes down smooth and as the branding will have you know, it's fiery. It's warming in the belly and flavourful on the tongue. You'll get the flavour of a cinnamon candy with all the spicy and sweet tones that you've always loved.","url":"\/fireball-cinnamon-whisky.html","category":"Blended Whisky","flavour":"A whack of sweet cinnamon at first, with the spicy burn slowly building, though not reaching a level i would describe as ‘burning like hell’.","abv":"21","color":"","brand":"Fireball","country":"India","alcohol":"Whiskey"},{"title":"Rockford Fine & Rare Whisky","img":"\/assets\/img\/alcohol\/whiskey\/rockford-fine-and-rare-whisky.jpeg","desc":"A Fine & Rare Whisky made from Rarest Oak Aged Scottish Malt Whiskies blended with the Finest Charcoal Filtered Indian Grain Spirits under the expert supervision of our Scottish Master Blender.","url":"\/rockford-fine-and-rare-whisky.html","category":"Blended Whisky","flavour":"Smooth yet complex with excellent maturity, a mellow sweetness together with balanced oak and fruit. Finish: Clean, good length with hints of oak.","abv":"37.5","color":"","brand":"Rockford","country":"India","alcohol":"Whiskey"},{"title":"Roulette Premium Whisky","img":"\/assets\/img\/alcohol\/whiskey\/roulette-premium-whisky.jpeg","desc":"A definite game-changer, roulette whisky is a blended whisky of high quality indian grain matured in ex-bourbon casks with a balanced blend of peated and unpeated malt spirit, thus offering hitherto unheard, unseen and untasted flavours in the popular premium blended whisky segment in india.","url":"\/roulette-premium-whisky.html","category":"Blended Whisky","flavour":"Fruit and honey with a dash of smoky malt. On the palate, deep creamy flavours of vanilla are followed by a hint of fruitiness. The American oak casks give it a rich smokiness that will take you by surprise. Enjoy the drink neat or as a highball.","abv":"42.8","color":"","brand":"Roulette","country":"India","alcohol":"Whiskey"},{"title":"Glenfarclas 105","img":"\/assets\/img\/alcohol\/whiskey\/glenfarclas-105.jpg","desc":"Glenfarclas 105 is a highly regarded cask-strength single malt Scotch whisky from the Glenfarclas distillery, located in the Speyside region of Scotland. It is renowned for its full-bodied flavor profile and rich complexity. The whisky is aged in oak casks, which impart deep, intense flavors and a robust character. Flavor Profile: Glenfarclas 105 offers a rich array of flavors including dried fruit (like raisins and sultanas), vanilla, toffee and a touch of spices. The oak casks contribute to its complex flavor, with notes of oak and a slight nuttiness. The high ABV gives it a warming, intense finish, making it a favorite among whisky enthusiasts who appreciate a strong, bold Scotch. Serving Suggestion: Due to its high alcohol content, it is often enjoyed with a splash of water to help open up the flavors. It can be sipped neat or on the rocks depending on personal preference. Glenfarclas 105 is appreciated for its balance of sweetness and spice and its rich, full flavor profile makes it a standout in the cask-strength category of Scotch whiskies.","url":"\/glenfarclas-105.html","category":"Single Malt Scotch Whisky","flavour":"Rich and complex, featuring notes of dried fruits, vanilla, toffee, spices and oak. The high ABV contributes to a warming, robust finish with a slight kick of spiciness","abv":"60","color":"Deep amber or mahogany","brand":"Glenfarclas","country":"Scotland","alcohol":"Whiskey"},{"title":"J Noon India I Red Wine","img":"\/assets\/img\/alcohol\/wine\/j-noon-india-i-red-wine.jpg","desc":"The Cabernet Sauvignon contributes to the backbone as well as freshness to this exquisite blend. The Petit Verdot, Marselan and Cabernet Franc grapes paint the wine deep purple and provide luscious flavours of black fruits with structured tannins, a full body and a long, silky finish. It places us to the right bank of Bordeaux, with freshness, notes of spearmint and graphite against a backdrop of cedar, fresh tobacco.","url":"\/j-noon-india-i-red-wine.html","category":"RED WINE","flavour":"","abv":"13.5","color":"","brand":"J Noon","country":"India","alcohol":"Wine"}]