[{"author":"Hanukkah John","banner400x400":"\/upload\/authors\/hanukkah-john.jpg","intro":"<p>A keen observer of emotions in people. An explorer of something that is so valid enough but cannot be seen through mere eyes. I believe every human is unique in his or her own thinking pattern or personality. Trying to take tiny steps in the change of outlook towards mental health, I aspire to be a psychologist.<\/p>\n                                <p>It is thrilling as I realize in my journey that human mind is an unending discovery. I am pursuing my degree in English, Journalism and Psychology. Looking forward to intern in journalism or psychology fields.<\/p>","linkedin":"","twitter":"","facebook":"","instagram":"","youtube":"","website":"\/authors\/hanukkah-john.html","file":"Hanukkah-John.json"},{"author":"Jyothi Karthik D","banner400x400":"\/upload\/authors\/jyothi-karthik-d.jpg","intro":"<p>I&#39;m Dr Jyothi Karthik D, a Dental Surgeon having 6 years of experience in treating patients with Dental problems.<\/p><p>Committed to provide our patients with the Good quality Dental care. Help patients to realize how good oral health can improve their quality of life<\/p><ul><li>An accurate and honest assessment for dental diseases and conditions<\/li><li>To guide our patients regarding growth and development issues (teething, habits and orthodontics)<\/li><li>A plan for emergency treatment, including pain or dental trauma<\/li><li>Referrals to other dental specialists when care could and should not be provided within the dental home<\/li><\/ul>","linkedin":"https:\/\/in.linkedin.com\/in\/jyothikarthikd","twitter":"","facebook":"https:\/\/www.facebook.com\/jyothikarthikd","instagram":"https:\/\/www.instagram.com\/jyothikarthik799","youtube":"","website":"\/dentofacts\/about.html","file":"Jyothi-Karthik-D.json"},{"author":"Karthik Kumar D K","banner400x400":"\/upload\/authors\/karthikkumardk.jpeg","intro":"<p>Hey, I’m Karthik — a software engineer who enjoys writing about tech, travel, and the world around us. I contribute to PeoplesBLOG to share honest takes on everything from gadgets and digital tools to social issues and everyday experiences.<\/p><p>I’m curious by nature, detail-driven, and someone who likes to question things that don’t sit right. When I’m not writing or coding, you’ll probably find me on a motorcycle trip or working on a side project.<\/p>","linkedin":"https:\/\/www.linkedin.com\/in\/karthikkumardk","twitter":"https:\/\/twitter.com\/heykarthikwithu","facebook":"https:\/\/www.facebook.com\/karthikkumardk","instagram":"https:\/\/www.instagram.com\/kakumdk","youtube":"https:\/\/www.youtube.com\/c\/karthikkumardk","website":"\/karthikkumardk\/index.html","file":"Karthik-Kumar-D-K.json"},{"author":"Krishna D","banner400x400":"\/upload\/authors\/krishna-d.jpg","intro":"<p>Krishna D, a successful weaver and silk saree businessman in Yelahanka, Bangalore, devoted over 20 years to his craft before experiencing a profound spiritual awakening through the teachings of Brahmarshi Sri Avvaru Annayya Tirthulu Swami.<\/p><p>Inspired by these teachings, he transitioned from his successful business to a path of spiritual dedication, spending many years at Sri Vedanta Swarajya Sangam in Yelahanka, Bangalore.<\/p><p>His deep commitment to Vedantic philosophy ultimately led him to establish an ashram in Madanapalli, Andhra Pradesh.<\/p><p>As Brahmarshi Sri Dondla Krishna Swami, he now shares his teachings with countless individuals across Karnataka and Andhra Pradesh.<\/p><p>His spiritual guidance continues to inspire and transform lives throughout the region.<\/p>","linkedin":"","twitter":"","facebook":"https:\/\/www.facebook.com\/srivedantaswarajyasangam","instagram":"","youtube":"https:\/\/www.youtube.com\/@sri-vedanta-swarajya-sangam","website":"\/sri-vedanta-swarajya-sangam\/gurus\/brahmarshi-sri-dondla-krishna-swami.html","file":"Krishna-D.json"},{"author":"Leela Vasundhara","banner400x400":"\/upload\/authors\/leelavasundara.jpeg","intro":"<p>A practical (ISTJ) Indian, a Very Responsible, Strong-willed and Dutiful & , who loves to sing and read. Technical Writer at Bharat Electronics.<\/p>\n                                <ul class=\"check\">\n                                    <li>Electronics Geek<\/li>\n                                    <li>Book worm<\/li>\n                                <\/ul>","linkedin":"https:\/\/in.linkedin.com\/in\/leelavasundaradk","twitter":"","facebook":"","instagram":"","youtube":"","website":"https:\/\/leelavasundhara.blogspot.com","file":"Leela-Vasundhara.json"},{"author":"Reddamma D","banner400x400":"\/upload\/authors\/reddamma-d.jpg","intro":"<p>I am Reddamma, having 3 decades of practical indian cooking experience. I'm here to share my recipes on Peoples BLOG which are simple, quick, delicious & healthy.<\/p>\n                                <p>I would be sharing only the recipes that are tried, tested and cherished by my family.<\/p>\n                                <p>I appreciate all the readers who take out time to read, try recipes, write comments & share articles. They make me happy and are valuable to share more recipes.<\/p>","linkedin":"","twitter":"","facebook":"","instagram":"","youtube":"","website":"\/authors\/reddamma-d.html","file":"Reddamma-D.json"}]