[{"author":"Hanukkah John","banner400x400":"\/upload\/authors\/hanukkah-john.jpg","intro":"<p>A keen observer of emotions in people. An explorer of something that is so valid enough but cannot be seen through mere eyes. I believe every human is unique in his or her own thinking pattern or personality. Trying to take tiny steps in the change of outlook towards mental health, I aspire to be a psychologist.<\/p>\n                                <p>It is thrilling as I realize in my journey that human mind is an unending discovery. I am pursuing my degree in English, Journalism and Psychology. Looking forward to intern in journalism or psychology fields.<\/p>","linkedin":"https:\/\/in.linkedin.com\/in\/hanukkah-john-227907186","twitter":"","facebook":"","instagram":"","youtube":"","website":"","file":"Hanukkah-John.json"},{"author":"Karthik Kumar D K","banner400x400":"\/upload\/authors\/karthikkumardk.jpeg","intro":"<p>A Techie at heart, Karthik has a penchant for programming and open source. Also a Foodie, Writer, Traveler and sometimes a Social Activist.<\/p>\n                                <p>Software professional \/ Drupal Developer having experience in web applications development, implementation and having strong knowledge of technical specifications, workflow development and deploying.<\/p>","linkedin":"https:\/\/www.linkedin.com\/in\/karthikkumardk","twitter":"https:\/\/twitter.com\/heykarthikwithu","facebook":"https:\/\/www.facebook.com\/karthikkumardk","instagram":"https:\/\/www.instagram.com\/kakumdk","youtube":"https:\/\/www.youtube.com\/c\/karthikkumardk","website":"https:\/\/karthikkumardk.peoplesblog.co.in","file":"Karthik-Kumar-D-K.json"},{"author":"Leela Vasundhara","banner400x400":"\/upload\/authors\/leelavasundara.jpeg","intro":"<p>A practical (ISTJ) Indian, a Very Responsible, Strong-willed and Dutiful & , who loves to sing and read. Technical Writer at Bharat Electronics.<\/p>\n                                <ul class=\"check\">\n                                    <li>Electronics Geek<\/li>\n                                    <li>Book worm<\/li>\n                                <\/ul>","linkedin":"https:\/\/in.linkedin.com\/in\/leelavasundaradk","twitter":"","facebook":"","instagram":"","youtube":"","website":"https:\/\/leelavasundhara.blogspot.com","file":"Leela-Vasundhara.json"},{"author":"Reddamma D","banner400x400":"\/upload\/authors\/reddamma-d.jpg","intro":"<p>I am Reddamma, having 3 decades of practical indian cooking experience. I'm here to share my recipes on Peoples BLOG which are simple, quick, delicious & healthy.<\/p>\n                                <p>I would be sharing only the recipes that are tried, tested and cherished by my family.<\/p>\n                                <p>I appreciate all the readers who take out time to read, try recipes, write comments & share articles. They make me happy and are valuable to share more recipes.<\/p>","linkedin":"","twitter":"","facebook":"","instagram":"","youtube":"","website":"\/authors\/reddamma-d.html","file":"Reddamma-D.json"},{"author":"PeoplesBLOG","banner400x400":"\/upload\/authors\/peoplesblog-bot.jpg","intro":"<p>We do write articles which are mostly related to latest Science & Technology which solve some of human problems, Also we write about Relationships and Ofcourse we like Food a lot & we write about different varieties of Food, especially about Veg & Egg varieties. And we do like to Travel and we do Travel often on Bikes, so we do write about Travelling. Also we put out only some interesting News.<\/p>","linkedin":"","twitter":"","facebook":"","instagram":"","youtube":"","website":"\/authors\/peoplesblog.html","file":"peoplesblog.json"},{"author":"Sathya D K","banner400x400":"\/upload\/authors\/default.svg","intro":"<p>Software professional with a passion for exploring the world. Talented software engineer who merges the worlds of technology and literature. With a deep appreciation for both coding languages and the written word.<\/p><p>Always dreaming about their next travel destination, driven by a curiosity to experience different cultures, landscapes, and cuisines.<\/p>","linkedin":"","twitter":"","facebook":"","instagram":"","youtube":"","website":"\/authors\/sathya-d-k.html","file":"sathya-d-k.json"},{"author":"Valli K","banner400x400":"\/upload\/authors\/default.svg","intro":"<p>Software Engineer by profession, also a foodie and addicted to watching anime & reading manga graphic novels.<\/p><p>Goal of Life should be to Realize the True Self, Experience it and be in blissful state in all worldly conditions.<\/p>","linkedin":"","twitter":"","facebook":"","instagram":"","youtube":"","website":"\/authors\/valli-k.html","file":"valli-k.json"}]