[{"title":"Powerful Solar Storm approaching Earth","created":"13 Jul, 2021","updated":"2022-12-01T09:00:00+05:30","author":"Karthik Kumar D K","summary":"According to website spaceweather.com, a powerful solar storm is approaching the Earth at a speed of 1.6 million kilometers and this storm will hit the Earth someday on 11th July - 13th July 2021.","content":"<p>According to website spaceweather.com, a powerful solar storm is approaching the Earth at a speed of 1.6 million kilometers and this storm will hit the Earth someday on 11th July - 13th July 2021. As per the website spaceweather.com, the storm that originated from the Sun's atmosphere can have a significant impact on a region of space dominated by Earth's magnetic field.<\/p>\n                                <p>According to spaceweather.com, due to solar storms, the outer atmosphere of the Earth can be heated which can have a direct effect on satellites. This can cause interference with GPS navigation, mobile phone signal and satellite TV. The current in power lines can be high, which can also blow transformers.<\/p>\n                                <p>Due to the solar storm, there will be a view of beautiful celestial lighting for the people living at the North or South Pole. The people living closer to these areas can expect to see beautiful aurora at night.<\/p>","banner788x443":"upload\/banner788x443\/public\/WGbfREm2n4jhBBjeNC5ApC.jpg","file":"2021-07-13-08-Powerful-Solar-Storm-approaching-Earth.json"},{"title":"Device with Two Atoms thick, World’s thinnest device","created":"13 Jul, 2021","updated":"2022-12-01T09:00:00+05:30","author":"Leela Vasundhara","summary":"World’s thinnest piece of technology has been developed by the Scientists, which is a device with only two Atoms thick, very tiny. It can be used to store electronic information.","content":"<p>World’s thinnest piece of technology has been developed by the Scientists, which is a device with only two Atoms thick, very tiny. It can be used to store electronic information.<\/p>\n                            <p>This device consists of 2 layers one with Boron & other with Nitrogen, which are arranged in a repeating hexagonal structure.<\/p>\n                            <p>Electrons from Boron & Nitrogen atoms are able to zip between two layers by using the effect called Quantum Tunneling (strange quantum mechanical effect), which changes the state of the device and will allow it to encode digital information.<\/p>","banner788x443":"upload\/banner788x443\/public\/two-atoms-device.jpeg","file":"2021-07-13-13-Device-with-Two-Atoms-thick-Worlds-thinnest-device.json"},{"title":"Heat on Earth’s Atmosphere is Heating much as it did fifteen years ago","created":"13 Jul, 2021","updated":"2022-12-01T09:00:00+05:30","author":"Karthik Kumar D K","summary":"Earth's energy imbalance doubled between 2005 - 2019, this was identified by a team from NASA & NOAA. Energy Im-balance is the difference between the amount of energy absorbed by Earth and the amount of energy emitted by Earth.","content":"<p>Earth's <strong>energy imbalance<\/strong> doubled between 2005 - 2019, this was identified by a team from NASA & NOAA. Energy Im-balance is the difference between the amount of energy absorbed by Earth and the amount of energy emitted by Earth.<\/p>\n                            <p>Means, if there is any energy imbalance on earth, Earth will be gaining energy which will lead to heat up more.<\/p>\n                            <p>So to quantify this, the team used data from two sources, one is NASA’s Clouds & Earth’s Radiant Energy System (CERES). And a system run by NOAA called Agro. CERES would be knowing how much energy is entering & leaving earth.<\/p>\n                            <p>And this research is another data point in the argument that climate change is real and that humans are causing it.<\/p>","banner788x443":"upload\/banner788x443\/public\/earth-heat.jpg","file":"2021-07-13-18-Heat-on-Earths-Atmosphere-is-Heating-much-as-it-did-fifteen-years-ago.json"},{"title":"ISRO successfully conducted the Third Test on Vikas Engine for Gaganyaan","created":"17 Jul, 2021","updated":"2022-12-01T09:00:00+05:30","author":"Karthik Kumar D K","summary":"On July 14, 2021, ISRO has successfully conducted the third long-duration hot test of the liquid propellant Vikas Engine for the core L110 liquid stage of the human-rated GSLV MkIII vehicle, as part of the engine qualification requirements for the Gaganyaan Programme.","content":"<p>On July 14, 2021, ISRO has successfully conducted the third long-duration hot test of the <strong>liquid propellant Vikas Engine<\/strong> for the core L110 liquid stage of the human-rated GSLV MkIII vehicle, as part of the engine qualification requirements for the <strong>Gaganyaan<\/strong> Programme.<\/p>\n                            <p>The engine was fired for a duration of 240 seconds at the engine test facility of ISRO Propulsion Complex (IPRC), Mahendragiri in Tamil Nadu.<\/p>\n                            <p>The performance of the engine met the test objectives and the engine parameters were closely matching with the predictions during the entire duration of the test.<\/p>\n                            <p>Source: <a href=\"https:\/\/www.isro.gov.in\/update\/14-jul-2021\/third-successful-vikas-engine-long-duration-hot-test-gaganyaan-program\"><strong><i><u>https:\/\/www.isro.gov.in\/update\/14-jul-2021\/third-successful-vikas-engine-long-duration-hot-test-gaganyaan-program<\/u><\/i><\/strong><\/a><\/p>\n                            <p><strong>Elon Musk, the CEO of SpaceX<\/strong>, congratulated the <strong>Indian Space Research Organisation (ISRO)<\/strong> on the successful completion of the third long-duration hot test of the liquid propellant Vikas engine for the Gaganyaan programme, India's first manned space mission.<\/p>\n                            <p><strong>Union Minister of State (Independent charge) of Space<\/strong>, Jitendra Singh said in February this year that the first unmanned mission is planned in December 2021 and the second unmanned one in 2022-23 followed by the human spaceflight demonstration.<\/p>","banner788x443":"upload\/banner788x443\/public\/gaganyaan_vikas_engine_isro.jpg","file":"2021-07-17-17-ISRO-successfully-conducted-the-Third-Test-on-Vikas-Engine-for-Gaganyaan.json"},{"title":"July 23rd - National Broadcasting Day","created":"23 Jul, 2021","updated":"2022-12-01T09:00:00+05:30","author":"Karthik Kumar D K","summary":"During the British Raj, Broadcasting began in June 1923 with the programs by the Bombay Presidency Radio Club and other radio clubs.","content":"<p>During the British Raj, Broadcasting began in June 1923 with the programs by the Bombay Presidency Radio Club and other radio clubs.<\/p>\n                            <ul class=\"check\">\n                                <li>The private <strong>Indian Broadcasting Company Ltd (IBC)<\/strong> was authorized to operate two radio stations in an agreement on 23 July 1927.<\/li>\n                                <li><strong>IBC started with two stations<\/strong>, one in Bombay (now Mumbai) on 23 July 1927 and other in Calcutta (now Kolkata) on 26 August 1927.<\/li>\n                                <li><strong>Government took over IBC Ltd<\/strong>, since the company went into liquidation on 1 March 1930.<\/li>\n                                <li>The <strong>Government started Indian State Broadcasting Service (ISBS)<\/strong> on 1 April 1930 on an experimental basis and made it permanent in May 1932.<\/li>\n                                <li>Later this <strong>became All India Radio<\/strong> on 8 June 1936.<\/li>\n                            <\/ul>\n                            <p>In India, <strong>July 23rd is observed as National Broadcasting Day<\/strong> since first broadcasting was started on this day in 1927 in Bombay (now Mumbai).<\/p>","banner788x443":"upload\/banner788x443\/public\/radio-broadcasting.jpg","file":"2021-07-23-13-July-twenty-third-National-Broadcasting-Day.json"},{"title":"July 26th - Kargil Vijay Diwas","created":"26 Jul, 2021","updated":"2022-12-01T09:00:00+05:30","author":"Karthik Kumar D K","summary":"In 1999, India successfully took command of high outposts on this date. The Kargil war was fought for more than 60 days & ended on this date.","content":"<p>In 1999, <strong>India successfully took command of high outposts<\/strong> on this date. The Kargil war was fought for more than 60 days & ended on this date.<\/p>\n                            <p><strong>Pakistani army<\/strong> took advantage of the melting snow & took command of high outposts of India, <strong>by betraying the bilateral agreement<\/strong> of both the nations that posts would remain unattended during winter season.<\/p>\n                            <p><strong>Pakistani army denied involvement in the war<\/strong> & claimed that it was caused by independent Kashmiri rebel forces, however <strong>documents left behind by casualties & later statements by<\/strong> Pakistan's Prime Minister and Chief of Army Staff, <strong>showed involvement of Pakistani paramilitary forces<\/strong>, led by General Ashraf Rashid.<\/p>\n                            <p>The Kargil war resulted in loss of life on both sides and was ended when <strong>India regained control<\/strong> over the post and <strong>ejected the Pakistani Army out<\/strong> of the territory.<\/p>\n                            <p><strong>Kargil Vijay Diwas<\/strong> is celebrated on 26 July every year in honour of the Kargil War's Heroes.<\/p>","banner788x443":"upload\/banner788x443\/public\/kargil-vijay-diwas.jpg","file":"2021-07-26-10-July-twenty-sixth-Kargil-Vijay-Diwas.json"},{"title":"GSLV-F10 to launch Earth Observation Satellite","created":"12 Aug, 2021","updated":"2022-12-01T09:00:00+05:30","author":"Karthik Kumar D K","summary":"GSLV-F10 is slated to launch Earth Observation Satellite, EOS-03 on August 12th, 2021 from Satish Dhawan Space Centre SHAR, Sriharikota.","content":"<p>GSLV-F10 is slated to launch Earth Observation Satellite, <strong>EOS-03<\/strong> on August 12th, 2021 from Satish Dhawan Space Centre SHAR, Sriharikota.<\/p>\n                            <p><strong>Countdown for the launch of GSLV-F10\/EOS-03<\/strong> mission commenced on August 11th at 03:43 Hrs (IST) from Satish Dhawan Space Centre (SDSC) SHAR, Sriharikota<\/p>\n                            <p>GSLV-F10 <strong>launch took place today (12th Aug) at 05:43 Hrs IST as scheduled<\/strong>. Performance of first and second stages was normal. However, Cryogenic Upper Stage ignition did not happen due to technical anomaly. The <strong>mission couldn't be accomplished<\/strong> as intended.<\/p>\n                            <p>ISRO chairman <strong>K. Sivan<\/strong> said that a \"technical anomaly was observed in the cryogenic stage and the mission could not be accomplished.\"<\/p>\n                            <p>Veteran space scientist <strong>G Madhavan Nair<\/strong> said that \"This is a very complex mission. Normally, the Cryogenic stage is the most difficult one compared to all other rocket propulsions. This is the eighth launch of cryogenic stage. <strong>This was the first unsuccessful one<\/strong>.\"<\/p>","banner788x443":"upload\/banner788x443\/public\/gslv-f10-launch.png","file":"2021-08-12-15-GSLV-F-ten-to-launch-Earth-Observation-Satellite.json"},{"title":"Virtual QUAD meet on 12th August, 2021","created":"13 Aug, 2021","updated":"2022-12-01T09:00:00+05:30","author":"Karthik Kumar D K","summary":"On August 12th, 2021 Senior Officials from four democracies - Australia, India, Japan, and the U.S. - met virtually to discuss Quad initiatives on economic recovery, maritime security, and human rights that promote a free and open IndoPacific region.","content":"<p>On August 12th, 2021 <strong>Senior Officials from four democracies<\/strong> - Australia, India, Japan, and the U.S. - met virtually to discuss Quad initiatives on economic recovery, maritime security, and human rights that promote a free and open IndoPacific region.<\/p>\n                            <p>The <strong>four democracies acknowledged that global security and prosperity<\/strong> depends on the region remaining inclusive, resilient, and healthy.<\/p>\n                            <p>The officials examined <strong>ways to advance ongoing cooperation on numerous topics of mutual interest<\/strong>, including strategic challenges confronting the region, countering disinformation, promoting democracy and human rights, strengthening international institutions including the United Nations and related organizations, and <strong>supporting countries vulnerable to coercive actions<\/strong> in the Indo-Pacific region<\/p>\n                            <ul class=\"check\">\n                                <li>They discussed the importance of sustained international cooperation to <strong>end the COVID-19 pandemic in the Indo-Pacific<\/strong> and to promote economic recovery.<\/li>\n                                <li>The senior officials discussed the importance of peace and security in the <strong>Taiwan Strait<\/strong>, the ongoing <strong>crisis in Burma<\/strong>, and reaffirmed the <strong>Quad's strong support for ASEAN centrality<\/strong> and the ASEAN Outlook on the Indo-Pacific.<\/li>\n                                <li>They <strong>welcomed the opportunity to continue regular consultations<\/strong> at the ministerial, senior official, and working levels and to hold a second Leaders’ Summit this fall.<\/li>\n                            <\/ul>\n                            <p>Senior Officials from four democracies involved in this discussion were.<\/p>\n                            <ul class=\"check\">\n                                <li>Australia: <strong>Mr. Justin Hayhurst<\/strong>, Deputy Secretary (Indo-Pacific Group) and <strong>Dr. Lauren Bain<\/strong>, Assistant Secretary, ASEAN and Regional Architecture Branch, from Department of Foreign Affairs and Trade.<\/li>\n                                <li>India: <strong>Ms. Vani Rao<\/strong>, Joint Secretary (Americas) and <strong>Mr. Naveen Srivastava<\/strong>, Additional Secretary (East Asia), from Ministry of External Affairs.<\/li>\n                                <li>Japan: <strong>Mr. OKANO Masataka<\/strong>, Deputy Minister for Foreign Policy and <strong>Mr. ENDO Kazuya<\/strong>, Deputy Director General, Asian and Oceanian Affairs Bureau, from the Ministry of Foreign Affairs.<\/li>\n                                <li>U.S.: <strong>Mr. Richard Buangan<\/strong>, Acting Senior Bureau Official for the Bureau of East Asian and Pacific Affairs, Department of State and <strong>Mr. Dean Thompson<\/strong>, Acting Assistant Secretary (South and Central Asian Affairs), from Department of State.<\/li>\n                            <\/ul>","banner788x443":"upload\/banner788x443\/public\/quad-aug-2021.webp","file":"2021-08-13-12-Virtual-QUAD-meet-on-twelfth-August-twenty-twenty-one.json"},{"title":"India, Russia to assess Taliban actions, before taking any action on Taliban","created":"25 Aug, 2021","updated":"2022-12-01T09:00:00+05:30","author":"Karthik Kumar D K","summary":"Russian President Vladimir Putin and Indian Prime Minister Narendra Modi agreed on the rise of Islamic radicalization in the region and are concerned over spread of terrorism by Taliban affiliated groups in Pakistan.","content":"<p>Russian President <strong>Vladimir Putin<\/strong> and Indian Prime Minister <strong>Narendra Modi<\/strong> agreed on the rise of Islamic radicalization in the region and <strong>are concerned over spread of terrorism by Taliban affiliated groups in Pakistan<\/strong>.<\/p>\n                            <p>The two countries have also <strong>decided to set up combined teams<\/strong> of foreign ministry and national security officials of each country to conduct a detailed assessment of the Afghan situation so that the <strong>future course of action with the Taliban Islamic government is decided by both India and Russia<\/strong>.<\/p>\n                            <p>These <strong>crucial decisions were taken<\/strong> after Russian President Vladimir Putin called up Prime Minister Narendra Modi <strong>on Tuesday (24th Aug 2021)<\/strong> and held a detailed conversation over telephone on the Afghanistan situation and its impact on both South and Central Asia ahead of the G-7 summit.<\/p>\n                            <p><strong>During the conversation<\/strong> between the two leaders, Prime Minister Narendra Modi told President Putin that India was concerned about Islamic radicalization in the region and how Taliban affiliated terrorist groups in Pakistan could use the developing situation to spread terrorism. <strong>It is understood that President Putin agreed with PM Modi’s assessment and expressed concern over radicalization in the Central Asian Republics<\/strong>.<\/p>","banner788x443":"upload\/banner788x443\/public\/india-russia-taliban.png","file":"2021-08-25-13-India-Russia-to-assess-Taliban-actions-before-taking-any-action-on-Taliban.json"},{"title":"Indian Astrophysicists spotted rare merger of three massive black holes","created":"27 Aug, 2021","updated":"2022-12-01T09:00:00+05:30","author":"Karthik Kumar D K","summary":"According to the Press Information Bureau, Astrophysicists in India have spotted a rare merging of three supermassive black holes.","content":"<p>According to the Press Information Bureau, <strong>Astrophysicists in India have spotted<\/strong> a rare merging of three supermassive black holes. They were observing the <strong>merging of two galaxies named NGC7733 and NGC7734<\/strong> in our celestial neighbour.<\/p>\n                            <p>When they detected unusual emissions from the centre of the latter and also a curious movement of a large bright clump having a different velocity than that of NGC7733. Inferring that this was a separate galaxy, the <strong>scientists named it NGC7733N<\/strong>.<\/p>\n                            <p>The <strong>Indian Institute of Astrophysics (IIA) team explains that<\/strong> if two galaxies collide, their black hole will also come closer by transferring the kinetic energy to the surrounding gas. The distance between the blackholes decreases with time until the separation is around a parsec (3.26 light-years). The two black holes are then unable to lose any further kinetic energy in order to get even closer and merge. This is known as the final parsec problem. The presence of a third black hole can solve this problem. The dual merging blackholes can transfer their energy to the third blackhole and merge with each other.<\/p>\n                            <p>Many Active Galactic Nuclei (AGN) <strong>pairs have been detected in the past, but triple AGN are extremely rare<\/strong>, and only a handful has been detected before using X-ray observations. However, the IIA team expects such triple AGN systems to be more common in small merging groups of galaxies. Although this study focuses only on one system, results suggest that small merging groups are ideal laboratories to detect multiple supermassive black holes.<\/p>","banner788x443":"upload\/banner788x443\/public\/Black-Holes-Merge.jpg","file":"2021-08-27-17-Indian-Astrophysicists-spotted-rare-merger-of-three-massive-black-holes.json"},{"title":"Olympics and Paralympics are two different Olympic Games","created":"31 Aug, 2021","updated":"2022-12-01T09:00:00+05:30","author":"Karthik Kumar D K","summary":"There is a key difference between the Olympics and the Paralympics, where in the Olympics the participants will be able-bodied people and whereas in Paralympics the participants will have some form of physical or intellectual disabilities.","content":"<p>There is a <strong>key difference<\/strong> between the Olympics and the Paralympics, where in the Olympics the <strong>participants will be able-bodied people<\/strong> and whereas in Paralympics the <strong>participants will have some form of physical or intellectual disabilities<\/strong>.<\/p>\n                            <p>Paralympics <strong>was originally started<\/strong> as a way to help soldiers who had been wounded in World War II.<\/p>\n                            <p>Paralympic games were <strong>started off as a way to provide rehabilitating sport for veterans<\/strong>, which was eventually turned into recreational sport by having a friendly competition before eventually developing into Paralympics, what is called today.<\/p>\n                            <p>Paralympics is overseen by the <strong>International Paralympic Committee<\/strong> (IPC) whereas the Olympics are overseen by the <strong>International Olympic Committee<\/strong> (IOC).<\/p>\n                            <p>As Summer Olympics and the Winter Olympics, similarly their are Summer Paralympics and the Winter Paralympics. However, <strong>both the Olympics and the Paralympics take place every four years<\/strong>, in two segments.<\/p>\n                            <p>Due to a joint agreement between IOC and IPC, the Summer Paralympics take place in the same city as the Summer Olympics, immediately after the Olympics has concluded. Similarly, the Winter Paralympics take place in the same city after the Winter Olympics.<\/p>\n                            <p>The first modern Olympics took place in <strong>1896<\/strong>, whereas the Paralympics first officially took place in <strong>1960<\/strong>. And yes, the Olympics are much older and are much more popular than the Paralympics.<\/p>\n                            <p>There is a large funding gap between the Olympics and Paralympic athletes, which has caused the Paralympians to strive for treatment equal to non-disabled Olympic athletes. Something that is an ongoing struggle, but Paralympians have now been getting more attention than they previously were.<\/p>\n                            <p>And Paralympics is the <strong>Second biggest sporting event<\/strong> in the world after the Olympics.<\/p>","banner788x443":"upload\/banner788x443\/public\/Olympics-and-Paralympics.jpg","file":"2021-08-31-17-Olympics-and-Paralympics-are-two-different-Olympic-Games.json"},{"title":"Vikram Misri Is New Deputy National Security Advisor","created":"28 Dec, 2021","updated":"2022-12-01T09:00:00+05:30","author":"Karthik Kumar D K","summary":"Vikram Misri has been appointed as the Deputy National Security Advisor in the National Security Council Secretariat.","content":"<p>Vikram Misri is a <strong>career diplomat from the 1989 batch<\/strong> of the <strong>Indian Foreign Service<\/strong>. He was born in Srinagar, Vikram Misri attended the Scindia School before graduating from Delhi's Hindu College. He also holds an MBA degree. And before joining the civil services, he had worked in advertising and ad film-making for three years.<\/p> <p>Earlier Vikram Misri has <strong>served at the Ministry of External Affairs<\/strong> of India, <strong>in the Prime Ministers Office<\/strong>, and also was part of several Indian missions in Europe, Africa, Asia, and North America.<\/p> <p>Now Vikram Misri <strong>has been appointed as the Deputy National Security Advisor<\/strong> in the National Security Council Secretariat. Earlier as an officer of the Foreign Services, he served as the envoy to China till December 11th 2021.<\/p> <p>Here are the few services taken up by him in the past:<\/p> <ul class='check1'> <li>He has served as India Ambassador to <strong>Myanmar and Spain<\/strong>. In 2019, he was appointed as the Ambassador to <strong>Beijing<\/strong> and served during a <strong>critical period in Indo-China ties<\/strong>.<\/li> <li>Mr Misri was a <strong>part of several talks held with China<\/strong> after the troops of both countries violently clashed in the <strong>Galwan Valley in June 2020<\/strong>, resulting in the first casualties from skirmishes in the region in four decades<\/li> <li>He served as the <strong>Private Secretary to<\/strong> then Prime Minister <strong>Inder Kumar Gujral<\/strong>, to former Prime Minister <strong>Manmohan Singh<\/strong> & also to <strong>Narendra Modi<\/strong> in 2014.<\/li> <\/ul>","banner788x443":"upload\/banners\/vikram-misri.JPG","file":"2021-12-28-14-Vikram-Misri-Is-New-Deputy-National-Security-Advisor.json"},{"title":"Fourth QUAD meet on 11th February 2022","created":"13 Feb, 2022","updated":"2022-12-01T09:00:00+05:30","author":"Karthik Kumar D K","summary":"A Joint statement by QUAD member countries Australia, India, Japan, and United States was released post the fourth meeting that happened on 11th Feb 2022 in Melbourne, Australia.","content":"<p>A <strong>Joint statement by QUAD<\/strong> member countries Australia, India, Japan, and United States was released post the <strong>fourth meeting<\/strong> that happened on <strong>11th Feb 2022 in Melbourne, Australia<\/strong>.<p> <p>This Fourth QUAD meeting was with <strong>Marise Payne<\/strong>, Minister for Foreign Affairs Australia, <strong>Subrahmanyam Jaishankar<\/strong>, External Affairs Minister of India, <strong>Hayashi Yoshimasa<\/strong>, Minister of Foreign Affairs of Japan & <strong>Antony Blinken<\/strong>, Secretary of State of the United States of America.<p> <h3>Overview of the meeting:<\/h3> <ul class='check'> <li>Reaffirm the Quad’s commitment to <strong>supporting Indo-Pacific countries efforts<\/strong> to advance a free and open Indo-Pacific.<\/li> <li>Quad partners have collectively provided more than 500 million vaccine doses. Together, <strong>Pledged to donate more than 1.3 billion vaccine doses globally<\/strong>. Pleased with the Quad Vaccine Partnership’s rapid progress in <strong>expanding vaccine production at the Biological E Ltd facility in India<\/strong>, which aims to deliver at least 1 billion vaccines by the end of 2022.<\/li> <li>To <strong>Strengthen HADR<\/strong> cooperation in the Indo-Pacific region.<\/li> <li>Quad is <strong>exchanging information on ever-evolving threats<\/strong> and working with Indo-Pacific countries, and in multilateral fora, to counter all forms of terrorism and violent extremism.<\/li> <li>Assist countries in the Indo-Pacific in the <strong>area of Cybersecurity<\/strong>.<\/li> <li>Issues <strong>related to the East and South China Seas<\/strong>.<\/li> <li><strong>Condemned the ballistic missile launches<\/strong> by North Korea.<\/li> <li><strong>Related to Myanmar<\/strong>, the four ministers expressed their grave concern over the current situation.<\/li> <li>Exchanged views on the <strong>current situation concerning Ukraine<\/strong>, where tensions are rising.<\/li> <\/ul> <p><strong>Hayashi Yoshimasa<\/strong>, Minister of Foreign Affairs of Japan <strong>conveyed<\/strong> that Prime Minister <strong>Kishida<\/strong> is looking forward to the <strong>next Quad Summit Meeting to be held in Japan<\/strong> in the first half of 2022.<\/p> <h3>Media Statement by QUAD member countries:<\/h3> <ul class='check'> <li><strong>Australian Governament<\/strong> - <a target='_blank' href='https:\/\/www.foreignminister.gov.au\/minister\/marise-payne\/media-release\/quad-cooperation-indo-pacific'>https:\/\/www.foreignminister.gov.au\/minister\/marise-payne\/media-release\/quad-cooperation-indo-pacific<\/a><\/li> <li><strong>Indian Government<\/strong> - <a target='_blank' href='http:\/\/www.mea.gov.in\/Speeches-Statements.htm?dtl\/34856\/Remarks+by+External+Affairs+Minister+Dr+S+Jaishankar+at+the+4th++Quad+Foreign+Ministers+Meeting+Press+Conference'>http:\/\/www.mea.gov.in\/Speeches-Statements.htm?dtl\/34856\/Remarks+by+External+Affairs+Minister+Dr+S+Jaishankar+at+the+4th++Quad+Foreign+Ministers+Meeting+Press+Conference<\/a><\/li> <li><strong>Japan Government<\/strong> - <a target='_blank' href='https:\/\/www.mofa.go.jp\/fp\/nsp\/page6e_000274.html'>https:\/\/www.mofa.go.jp\/fp\/nsp\/page6e_000274.html<\/a><\/li> <li><strong>United States Government<\/strong> - <a target='_blank' href='https:\/\/www.state.gov\/joint-statement-on-quad-cooperation-in-the-indo-pacific\/'>https:\/\/www.state.gov\/joint-statement-on-quad-cooperation-in-the-indo-pacific\/<\/a><\/li> <\/ul>","banner788x443":"upload\/banners\/QUAD-fourth-meet.jpg","file":"2022-02-13-14-Fourth-QUAD-meet-on-11th-February-2022.json"},{"title":"A Comet which is twice the Everest's size is heading toward Earth","created":"27 Jun, 2022","updated":"2022-12-01T09:00:00+05:30","author":"Karthik Kumar D K","summary":"A massive comet named C\/2017 K2 (PanSTARRS) is heading toward the Earth. It is twice the size of Mount Everest and will make its closest approach on July 14.","content":"<p>A massive comet named C\/2017 K2 (PanSTARRS) is heading toward the Earth. It is twice the size of Mount Everest and will make its closest approach on July 14.<\/p>  <p>It was first spotted in 2017. It mostly consists of ice and will not pose any danger to general people, but an astronomer will be more excited.<\/p>  <p><strong>Let&#39;s see what we know about it and how can we watch it?<\/strong><\/p>  <ul> <li>This C\/2017 K2 has been active for a long time. Comets are a mass of rock, ice, and gases that become &quot;active&quot; when warmed by a star. The C\/2017 K2 heading from the edge of the solar system was already bright when seen in 2017. Scientists do not know the reason for this yet.<\/li> <li>The comet has a nucleus diameter of 18km, which is double the size of Mount Everest, a cometary atmosphere of 1.3 lakh kilometres, and a tail that is eight lakh kilometres long,&nbsp;it&#39;s not the largest comet ever.<\/li> <li>Astronomers have theorised that the C\/2017 K2 (PanSTARRS) has been travelling from the Oort cloud to the inner solar system in a hyperbolic orbit for around 30 lakh years.<\/li> <li>And in next month July 2022, this comet will be around 27.7 crore kilometres from our planet. It has a cometary atmosphere the size of Jupiter and should be visible to people with a simple telescope.<\/li> <li>And people can see it in the Northern Hemisphere till this year September 2022. After mid-September, it will touch the hemisphere&#39;s southwestern horizon and shall be suitable for people viewing in the Southern Hemisphere.<\/li> <li>And the Skywatchers using a small telescope in a dark-sky site will witness a fuzzy patch of light around the C\/2017 K2&#39;s nucleus. But, long-exposure images should reveal the comet and its tail in its entirety.<\/li> <\/ul>","banner788x443":"upload\/banners\/a-comet-which-is-twice-the-everest-size-is-heading-toward-earth.jpg","file":"2022-06-27-13-a-comet-which-is-twice-the-everest-size-is-heading-toward-earth.json"},{"title":"Legislative Assistants for Members of Parliament (LAMP) Fellowship","created":"29 Jun, 2022","updated":"2022-12-01T09:00:00+05:30","author":"Hanukkah John","summary":"LAMP Fellowship is an opportunity for young people in India, provided by the Indian Government, to be mentored by a Member of Parliament, during this course of the Fellowship, people will get the opportunity to engage with experts from diverse sectors and understand important policy and development issues of the country.","content":"<p>LAMP Fellowship is an opportunity for young people in India, provided by the Indian Government, to be mentored by a Member of Parliament, during this course of the Fellowship, people will get the opportunity to engage with experts from diverse sectors and understand important policy and development issues of the country.<\/p>  <ul> <li>Primary role is to <strong>provide research support to the Member of Parliament<\/strong> (whom shall be assigned to).<\/li> <li>LAMP Fellow will undertake the work that is Parliament related, such as inputs for bills, parliamentary questions, policy discussions and standing committee meetings.<\/li> <li>Provide background research for the conferences and media events that MPs are attending in their official capacity.<\/li> <li>Some MPs may delegate constituency-related work to their LAMP Fellows, taking up such work (including visits to the constituency) is subject to the agreement between the MP and the LAMP Fellow.<\/li> <\/ul>  <p><strong>Eligibility for the Fellowship<\/strong><\/p>  <ul> <li>Should be an Indian citizen and age 25 or under 25.<\/li> <li>Must have a Bachelor&#39;s degree in any field.<\/li> <\/ul>  <p>Here&rsquo;s are important FAQ&rsquo;s - <a href='https:\/\/prsindia.org\/lamp\/faq' target='_blank'>https:\/\/prsindia.org\/lamp\/faq<\/a><\/p>","banner788x443":"upload\/banners\/legislative-assistants-for-members-of-parliament-lamp-fellowship.jpg","file":"2022-06-29-11-legislative-assistants-for-members-of-parliament-lamp-fellowship.json"},{"title":"ISRO launched three Singapore Satellites with PSLV","created":"01 Jul, 2022","updated":"2022-12-01T09:00:00+05:30","author":"Karthik Kumar D K","summary":"On Thursday 30th Jun 2022 at 18:02 hours IST, India successfully placed into orbit three Singaporean satellites exactly as planned, which will make it the second successful rocket and satellite launch mission in 2022.","content":"<p>On Thursday 30th Jun 2022 at 18:02 hours IST, India successfully placed into orbit three Singaporean satellites exactly as planned, which will make it the second successful rocket and satellite launch mission in 2022.<\/p>  <p>It was the PSLV-C53 rocket which took up the Satellites into space from the Satish Dhawan Space Centre, Sriharikota. And with this successful mission, the PSLV rocket has launched 345 foreign satellites in 36 countries since 1999.<\/p>  <p>Satellites, which are part in this mission are:<\/p>  <ul> <li>The DS-EO carries an electro-optic, multi-spectral payload with 0.5 m resolution imaging capability, while the NeuSAR is Singapore&#39;s first small commercial satellite carrying a SAR payload that is capable of providing images 24 hours a day and in all weather conditions.<\/li> <li>The SCOOB-I satellite is the first in the Student Satellite Series (S3-I) - a hands-on student training program from the NTU&#39;s Satellite Research Centre (SaRC).<\/li> <li>And a PSLV Orbital Experimental Module (POEM) orbiting the earth as a stabilised platform<\/li> <\/ul>  <p>&quot;<em>The PSLV C53 rocket has placed the customer satellites in a precise orbit. The PS4 will write some &#39;POEMs&#39; in space,<\/em>&quot; said ISRO Chairman S. Somanath said after confirming that the space mission achieved its set objectives.<\/p>","banner788x443":"upload\/banners\/isro-launched-three-singapore-satellites-with-pslv.jpeg","file":"2022-07-01-16-isro-launched-three-singapore-satellites-with-pslv.json"},{"title":"Dara Singh Randhawa (Dara Singh)","created":"12 Jul, 2022","updated":"2022-12-01T09:00:00+05:30","author":"Karthik Kumar D K","summary":"Dara Singh was an Indian Professional Wrestler, Actor, Director and Politician. He is known for his undefeated worldwide streak in wrestling. His flooring of King Kong is still remembered.","content":"<p>Dara Singh was an Indian Professional Wrestler, Actor, Director and Politician.<\/p>  <p>He was born on 19th November 1928 in a Jat Sikh family, to Surat Singh Randhawa and Balwant Kaur.<\/p>  <p>He is known for his undefeated worldwide streak in wrestling. His flooring of King Kong is still remembered. According to Thesz, <em>Dara Sing was an authentic wrestler, he was superbly conditioned and had no problem losing to the latter<\/em>. His last tournament, where he announced his retirement, was held in Delhi in June 1983.<\/p>  <p>He started his career as an actor in 1952 with Sangdil. He worked as Hindi and Punjabi film producer, director and writer, and he acted in films and television. His last Hindi movie was Jab We Met and the last Punjabi movie released before his illness was Dil Apna Punjabi. He acted in National Award-winning film Main Maa Punjab Dee directed by Balwant Singh Dullat. His role of Hanuman in the film Bajrangbali (1976) and in Ramanand Sagar&#39;s Ramayan made him popular.<\/p>  <p>He was the first sportsman to be nominated to the Rajya Sabha (upper house) of India.<\/p>  <p>On 7 July 2012, Singh was admitted into Kokilaben Dhirubhai Ambani Hospital, because of a massive heart attack. Two days later, it was confirmed that he had brain damage due to the lack of blood flow. He was discharged from hospital on 11 July 2012, citing that nothing can be done to prolong life, and died the next day at his home in Mumbai. He was cremated at Juhu crematorium.<\/p>  <p>In 1996 Singh was inducted into the Wrestling Observer Newsletter Hall of Fame. In 2016, Dara was included in the list India&#39;s top wrestlers of all time. On 7 April 2018 WWE inducted him in the WWE Hall of Fame Legacy class of 2018.<\/p>","banner788x443":"upload\/banners\/dara-singh-randhawa.jpeg","file":"2022-07-12-12-dara-singh-randhawa.json"},{"title":"Keep good company if you want to be a good person","created":"13 Dec, 2022","updated":"2022-12-13T12:00:00+05:30","author":"Karthik Kumar D K","summary":"Two parrots built a nest in a banyan tree. They lived with their two young ones, which they took good care of. The mother and the father parrot went out to gather food in the morning and came back home by evening.","content":"<p>Two parrots built a nest in a banyan tree. They lived with their two young ones, which they took good care of. The mother and the father parrot went out to gather food in the morning and came back home by evening. One day, when their parents were away, the young parrots were taken by a cruel hunter.<\/p>  <p>One of the birds managed to escape and flew away from the hunter. He ended up at a hermitage and grew up listening to kind words and compassion. The hunter put the other parrot in a cage, and soon it learned a few words and phrases. The hunter and his family were crude and didn&rsquo;t care much about kind words.<\/p>  <p>One day, a passerby was resting outside the hunter&rsquo;s hut. Sensing someone outside, the parrot said, &ldquo;Fool, why are you here? Fool! Leave! I&rsquo;ll cut your throat&rdquo;. Scared, the traveler went away, and on his journey, he reached the hermitage where the other parrot was. The parrot at the hermitage spoke, &ldquo;Welcome traveler. You are free to stay here as long as you want&rdquo;.<\/p>  <p>Surprised, the traveler told the parrot that he encountered a similar parrot elsewhere and it was very cruel. How is that you are so kind?&rdquo; The parrot replied, &ldquo;That must be my brother. I live with the sages, and my brother lives with hunters. I learned the sage&rsquo;s language, and my brother learned the hunter&rsquo;s language. The company we keep decides who we will be&rdquo;.<\/p>  <p><strong>Moral<\/strong><\/p>  <p>&quot;Keep good company if you want to be a good person.&quot;<\/p>","banner788x443":"upload\/banners\/keep-good-company-if-you-want-to-be-a-good-person.jpeg","file":"2022-12-13-12-keep-good-company-if-you-want-to-be-a-good-person.json"},{"title":"How to Think Positive and Best out of a Situation? with King's Painting","created":"13 Jan, 2023","updated":"2023-01-13T12:00:00+05:30","author":"Karthik Kumar D K","summary":"We people might have heard a saying to think positive, many times. In this quick read we are gonna see how a painter thinks positively with a situation to draw a King’s painting.","content":"<p>We people might have heard a saying to think positive, many times. In this quick read we are gonna see how a painter thinks positively with a situation to draw a King&rsquo;s painting.<\/p>  <p>Once upon a time, there was a Kingdom. The king there only had one leg and one eye, but he was very intelligent and kind. Everyone in his kingdom lived a happy and healthy life because of their king. One day the king was walking through the palace hallway and saw the portraits of his ancestors. He thought that one day his children would walk in the same hallway and remember all the ancestors through these portraits.<\/p>  <p>But, the king did not have his portrait painted. Due to his physical disabilities, he wasn&rsquo;t sure how his painting would turn out. So he invited many famous painters from his and other kingdoms to the court. The king then announced that he wants a beautiful portrait made of himself to be placed in the palace. Any painter who can carry out this should come forward. He will be rewarded based on how the painting turns up.<\/p>  <p>All of the painters began to think that the king only has one leg and one eye. How can his picture be made very beautiful? It is not possible and if the picture does not turn out to look beautiful then the king will get angry and punish them. So one by one, all started to make excuses and politely declined to make a painting of the king.<\/p>  <p>But suddenly one painter raised his hand and said that I will make a very beautiful portrait of you which you will surely like. The king became happy hearing that and other painters got curious. The king gave him permission and the painter started drawing the portrait. He then filled the drawing with paints. Finally, after taking a long time, he said that the portrait was ready!<\/p>  <p>All of the courtiers, other painters were curious and nervous thinking, How can the painter make the king&rsquo;s portrait beautiful because the king is physically disabled? What if the king didn&rsquo;t like the painting and got angry? But when the painter presented the portrait, everyone in the court, including the king, was left stunned.<\/p>  <p>The painter made a portrait in which the king was sitting on the horse, on the one-leg side, holding his bow and aiming the arrow with his one eye closed. The king was very pleased to see that the painter had made a beautiful portrait by cleverly hiding the king&rsquo;s disabilities. The King gave him a great reward.<\/p>  <p><strong>Moral<\/strong>: <em>People should always think positive in all situations, so that you get out the best out of a situation.<\/em><\/p>","banner788x443":"upload\/banners\/keep-good-company-if-you-want-to-be-a-good-person.jpg","file":"2023-01-13-12-how-to-think-positive-and-best-out-of-a-situation-with-kings-painting.json"},{"title":"Bad Habits","created":"26 Jan, 2023","updated":"2023-01-26T17:00:00+05:30","author":"Karthik Kumar D K","summary":"Bad habits are hard to get rid of once they have settled in our system. It is best to get rid of them early on.","content":"<p>A wealthy businessman was worried about his son&rsquo;s bad habits. He sought counsel from a wise, old man. The old man met the man&rsquo;s son and took him out for a stroll. They walked into the woods, and the old man showed the boy a small sapling and asked him to pull it out. The boy did so with ease, and they walked on.<\/p>  <p>The old man then asked the boy to pull out a small plant. The boy did that too, with a little effort. As they walked, the old man asked the boy to pull out the bush, which he did. The next was a small tree, which the child had to struggle a lot to pull out. Finally, the old man showed him a bigger tree and asked the child to pull it out.<\/p>  <p>The child failed to pull it out even after trying several times, in different ways. The old man looks at the boy, smiles and says, &ldquo;So is the case with habits, good or bad&rdquo;.<\/p>  <p><strong>Moral<\/strong><\/p>  <p>&quot;<em>Bad habits are hard to get rid of once they have settled in our system. It is best to get rid of them early on.<\/em>&quot;<\/p>","banner788x443":"upload\/banners\/bad-habits.jpeg","file":"2023-01-26-17-bad-habits.json"},{"title":"The Wet Pants","created":"05 Feb, 2023","updated":"2023-02-05T09:00:00+05:30","author":"Karthik Kumar D K","summary":"A nine-year-old boy was sitting at his desk in class, when suddenly, his pants felt wet, and there was a puddle at his feet. His heart almost skipped a beat, as he got worried that his classmates would see that and make fun of him.","content":"<p>A nine-year-old boy was sitting at his desk in class, when suddenly, his pants felt wet, and there was a puddle at his feet. His heart almost skipped a beat, as he got worried that his classmates would see that and make fun of him.<\/p>  <p>He quickly wanted to do something, and saw the teacher and his classmate Susie walking towards him. Susie was carrying a bowl of goldfish. As they came closer, the boy thought that the teacher noticed his wet pants, and suddenly Susie trips and drops the fishbowl in his lap. While thanking God for helping him, he pretends to get angry with Susie and yells at her.<\/p>  <div class='google-ad'>     <ins class='adsbygoogle'          style='display:block; text-align:center;'          data-ad-layout='in-article'          data-ad-format='fluid'          data-ad-client='ca-pub-2683569506254139'          data-ad-slot='4812668708'><\/ins>     <script>         (adsbygoogle = window.adsbygoogle || []).push({});     <\/script> <\/div>  <p>Everyone in the class thinks it is Susie&rsquo;s fault that the boy&rsquo;s pants got wet. The teacher helps the boy change into dry clothes, and the class continues. Later that evening, the boy asks Susie, &ldquo;You did that on purpose, didn&rsquo;t you?&rdquo; &ldquo;I wet my pants once too&rdquo;, whispers Susie.<\/p>  <p><strong>Moral<\/strong>: <em>Each one of us goes through good days and bad days. Only those who help you out on your bad days are your true friends.<\/em><\/p>","banner788x443":"upload\/banners\/the-wet-pants.jpeg","file":"2023-02-05-09-the-wet-pants.json"},{"title":"Controlling anger","created":"10 Feb, 2023","updated":"2023-02-10T13:00:00+05:30","author":"Karthik Kumar D K","summary":"There was once a young boy who had problem controlling his temper. When he became angry, he would just say anything that came to his mind and hurt people.","content":"<p>There was once a young boy who had problem controlling his temper. When he became angry, he would just say anything that came to his mind and hurt people. So his father gave him a bag of nails and a hammer and said, &ldquo;<em>Every time you get angry, hammer one nail into the fence in our backyard<\/em>&rdquo;.<\/p>  <p>The first few days the boy hammered so many nails that he emptied half the bag. Over the weeks, the number of nails he hammered to the fence reduced and gradually, his temper was much in control. Then came a day when he didn&rsquo;t lose his temper at all. His father asked him to remove one nail each day that he manages not to lose his temper.<\/p>  <div class='google-ad'>     <ins class='adsbygoogle'          style='display:block; text-align:center;'          data-ad-layout='in-article'          data-ad-format='fluid'          data-ad-client='ca-pub-2683569506254139'          data-ad-slot='4812668708'><\/ins>     <script>         (adsbygoogle = window.adsbygoogle || []).push({});     <\/script> <\/div>  <p>Finally, on the day the child was removing the last nail, his father says, &ldquo;You have done well, boy. But do you see the holes in the wall? The fence is never going to be the same, even after repainting. Likewise, when you say mean things in anger, you will leave a scar in the person&rsquo;s mind, as the nails did to the fence&rdquo;.<\/p>  <p><strong>Moral<\/strong><em>: Anger is a dangerous weapon like a knife. When you put a knife in a man and draw it out, the wound heals but the scar remains.<\/em><\/p>","banner788x443":"upload\/banners\/controlling-anger.jpeg","file":"2023-02-10-13-controlling-anger.json"},{"title":"The dog at the well","created":"18 Feb, 2023","updated":"2023-02-18T11:00:00+05:30","author":"Karthik Kumar D K","summary":"A dog and her pups lived on a farm, where there was a well. The mother dog told the pups, do not go near the well or play around it.","content":"<p>A dog and her pups lived on a farm, where there was a well. The mother dog told the pups, do not go near the well or play around it. One of the pups wondered why they shouldn&rsquo;t go to the well and decided to explore it. He went to the well. Climbed up the wall and peeked inside.<\/p>  <p>In there, he saw his reflection and thought it was another dog. The pup saw that the other dog in the well (his reflection) was doing whatever he was doing, and got angry for imitating him. He decided to fight with the dog and jumped into the well, only to find no dog there. He barked and barked and swam until the farmer came and rescued him. The pup had learned his lesson.<\/p>  <p><strong>Moral<\/strong><em>: Always listen to what the elders say. Question them, but do not defy them.<\/em><\/p>","banner788x443":"upload\/banners\/the-dog-at-the-well.jpeg","file":"2023-02-18-11-the-dog-at-the-well.json"},{"title":"The other side of the wall","created":"23 Feb, 2023","updated":"2023-02-23T12:00:00+05:30","author":"Karthik Kumar D K","summary":"A young woman inherited a beautiful garden from her grandmother. She loved gardening too and was very proud of her garden.","content":"<p>A young woman inherited a beautiful garden from her grandmother. She loved gardening too and was very proud of her garden. One day, she saw a very beautiful plant in a catalog and wanted that for her garden. She ordered it and planted it at the base of the stonewall in her backyard. She took great care of the plant, which grew quickly and had beautiful green leaves on it.<\/p>  <p>Months passed, but not a single flower bloomed on the tree. Vexed, she almost wanted to cut the tree down. At such a time, her invalid called and said, &ldquo;<em>Thank you so much for the beautiful flowers. You have no idea how much I enjoy looking at the blooms of the vine you have planted<\/em>&rdquo;.<\/p>  <div class='google-ad'>     <ins class='adsbygoogle'          style='display:block; text-align:center;'          data-ad-layout='in-article'          data-ad-format='fluid'          data-ad-client='ca-pub-2683569506254139'          data-ad-slot='4812668708'><\/ins>     <script>         (adsbygoogle = window.adsbygoogle || []).push({});     <\/script> <\/div>  <p>Hearing this, the young girl rushes to the neighbor&rsquo;s side of the wall and sees the most beautiful flower in bloom. All the care she took had paid off. Only the vine crept through the crevices because of which it did not flower on her side of the wall but did generously on the other side.<\/p>  <p><strong>Moral<\/strong><em>: Just because you cannot see the good results of your efforts does not mean that it bore no fruit.<\/em><\/p>","banner788x443":"upload\/banners\/the-other-side-of-the-wall.jpeg","file":"2023-02-23-12-the-other-side-of-the-wall.json"},{"title":"The young crab and his mother.","created":"08 Mar, 2023","updated":"2023-03-08T09:00:00+05:30","author":"Karthik Kumar D K","summary":"One day, a young crab and his mother were on the beach, spending some time together. The young crab gets up to move, but it can only walk sideways.","content":"<p>One day, a young crab and his mother were on the beach, spending some time together. The young crab gets up to move, but it can only walk sideways. His mother scolds him for walking sideways and asks him to walk forward by pointing his toes out front. The young crab responds, &ldquo;<em>I would like to walk forward mom, but I do not know how to<\/em>&rdquo;.<\/p>  <p>Hearing this, his mom gets up to show him how, but even she is unable to bend her knees forward. She realizes that she was being unfair, apologizes sheepishly, and sits back in the sand.<\/p>  <p><strong>Moral<\/strong>: <em>Don&rsquo;t condemn someone for not doing something that you yourself are unable to do.<\/em><\/p>","banner788x443":"upload\/banners\/the-young-crab-and-his-mother.jpg","file":"2023-03-08-09-the-young-crab-and-his-mother.json"},{"title":"The wolf and the shepherds","created":"07 May, 2023","updated":"2023-05-07T09:00:00+05:30","author":"Karthik Kumar D K","summary":"This is one of the many Aesop’s fables that one can relate to in any day and age.","content":"<p>This is one of the many Aesop&rsquo;s fables that one can relate to in any day and age.<\/p>  <p>One day a wolf was chased away from a farm for trying to steal some of the sheep for food. Later that week, the wolf came back to the farm hoping to find some food. He peeped inside the house and found the farmer and his family feasting on lamb roast.<\/p>  <p>&ldquo;Aha!&rdquo;, he thought. &ldquo;If I were to do the same thing that the farmer and his family are doing now, I would be shunted and chased, or even killed for killing a weak, innocent lamb.&rdquo;<\/p>  <p><strong>Moral<\/strong>: We are quick to judge and condemn others for what they do, but see nothing wrong in doing so ourselves<\/p>","banner788x443":"upload\/banners\/the-wolf-and-the-shepherds.jpeg","file":"2023-05-07-09-the-wolf-and-the-shepherds.json"},{"title":"Elephant and friends","created":"20 May, 2023","updated":"2023-05-20T10:00:00+05:30","author":"Karthik Kumar D K","summary":"A lone elephant wandered the forest looking for friends. She came across a monkey and asked, “Will you be my friend, monkey?”","content":"<p>A lone elephant wandered the forest looking for friends. She came across a monkey and asked, &ldquo;Will you be my friend, monkey?&rdquo; &ldquo;You are too big and cannot swing on trees as I do. So I cannot be your friend&rdquo;, said the monkey.<\/p>  <p>The elephant them came across a rabbit and asked him if she could be his friend. &ldquo;You are too big to fit inside my burrow. You cannot be my friend&rdquo;, replied the rabbit.<\/p>  <p>Then the elephant met a frog and asked if she could be her friend. The frog said &ldquo;You are too big and heavy. You cannot jump like me. I am sorry, but you cannot be my friend&rdquo;.<\/p>  <p>The elephant asked a fox, and he got the same reply, that he was too big. The next day, all the animals in the forest were running in fear. The elephant stopped a bear and asked what was happening and was told that a tiger has been attacking all the animals.<\/p>  <div class='google-ad'>     <ins class='adsbygoogle'          style='display:block; text-align:center;'          data-ad-layout='in-article'          data-ad-format='fluid'          data-ad-client='ca-pub-2683569506254139'          data-ad-slot='4812668708'><\/ins>     <script>         (adsbygoogle = window.adsbygoogle || []).push({});     <\/script> <\/div>  <p>The elephant wanted to save the other weak animals and went to the tiger and said &ldquo;Please sir, leave my friends alone. Do not eat them&rdquo;. The tiger didn&rsquo;t listen and asked the elephant to mind her own business. Seeing no other way to solve the problem, the elephant kicked the tiger and scared it away.<\/p>  <p>She then went back to the others and told them what happened. On hearing how the elephant saved their lives, the animals agreed in unison, &ldquo;You are just the right size to be our friend&rdquo;.<\/p>  <p><strong>Moral<\/strong>: <em>Friends come in all shapes and sizes!<\/em><\/p>","banner788x443":"upload\/banners\/elephant-and-friends.jpeg","file":"2023-05-20-10-elephant-and-friends.json"},{"title":"True friends love you anyway","created":"25 May, 2023","updated":"2023-05-25T10:00:00+05:30","author":"Karthik Kumar D K","summary":"Lord Krishna and Sudama were childhood friends. While Krishna thrived and prospered, Sudama didn’t. He lead the life of a poor Brahmin man, living in a small hut with his wife and kids.","content":"<p>Lord Krishna and Sudama were childhood friends. While Krishna thrived and prospered, Sudama didn&rsquo;t. He lead the life of a poor Brahmin man, living in a small hut with his wife and kids. Most days, the kids wouldn&rsquo;t even get enough to eat from what Sudama got as alms. One day, his wife suggested that he go and ask his friend Krishna for help.<\/p>  <p>Sudama was reluctant to seek favors, but he also didn&rsquo;t want his kids to suffer. So his wife borrows some rice from the neighbors to make some rice snacks that Krishna liked, and gave it to Sudama to take it to his friend. Sudama took it and set out to Dwaraka. He was amazed at the gold that was used to build the city. He reached the palace gates and was obstructed by the guards, who judged him by his torn dhoti and poor appearance.<\/p>  <p>Sudama requested the guards to at least inform Krishna that his friend Sudama has come to meet him. The guard, although reluctant, goes and informs the lord. On hearing that Sudama was here, Krishna stops doing whatever he was doing and runs barefoot to meet his childhood friend.<\/p>  <div class='google-ad'>     <ins class='adsbygoogle'          style='display:block; text-align:center;'          data-ad-layout='in-article'          data-ad-format='fluid'          data-ad-client='ca-pub-2683569506254139'          data-ad-slot='4812668708'><\/ins>     <script>         (adsbygoogle = window.adsbygoogle || []).push({});     <\/script> <\/div>  <p>Krishna hugs Sudama welcomes him to his abode and treats him with utmost love and respect. Sudama, ashamed of the poor man&rsquo;s rice snacks he got for Krishna, tries to hide it. But the all-knowing Krishna asks Sudama for his gift and eats his favorite rice snacks that his friend brought for him.<\/p>  <p>Krishna and his friend spend time laughing and talking about their childhood but Sudama, overwhelmed by the kindness and compassion showed by his friend, is unable to ask Krishna for help. When he returns home, Sudama finds that his hut has been replaced by a huge mansion and his wife and kids are dressed in fine clothes.<\/p>  <p>Sudama realized how lucky he was to have a true friend like Krishna. He didn&rsquo;t even ask, but Krishna knew what Sudama wanted and gave it to him.<\/p>  <p><strong>Moral<\/strong><em>: True friends do not distinguish between rich and poor. They are always there for you when you need them.<\/em><\/p>","banner788x443":"upload\/banners\/true-friends-love-you-anyway.jpeg","file":"2023-05-25-08-true-friends-love-you-anyway.json"},{"title":"The farmer and the well","created":"01 Jun, 2023","updated":"2023-06-01T09:00:00+05:30","author":"Karthik Kumar D K","summary":"A farmer looking for a source of water for his farm bought a well from his neighbor. The neighbor was cunning, though, and refused to let the farmer take water from the well.","content":"<p>A farmer looking for a source of water for his farm bought a well from his neighbor. The neighbor was cunning, though, and refused to let the farmer take water from the well. On asking why, he replied, &ldquo;I sold the well to you, not the water&rdquo;, and walked away. The distraught farmer didn&rsquo;t know what to do. So he went to Birbal, a clever man and one of the nine courtiers of Emperor Akbar, for a solution.<\/p>  <p>The emperor called the farmer and his neighbor and asked why the man was not letting the farmer draw water from the well. The cunning man said the same thing again, &ldquo;I sold the well, not the water. So he cannot take my water&rdquo;.<\/p>  <p>To this, Birbal replied, &ldquo;All that sounds fine to me. But if you have sold the water and the water is yours, then you have no business keeping your water in his well. Remove the water or use it all up immediately. If not the water will belong to the owner of the well&rdquo;.<\/p>  <div class='google-ad'>     <ins class='adsbygoogle'          style='display:block; text-align:center;'          data-ad-layout='in-article'          data-ad-format='fluid'          data-ad-client='ca-pub-2683569506254139'          data-ad-slot='4812668708'><\/ins>     <script>         (adsbygoogle = window.adsbygoogle || []).push({});     <\/script> <\/div>  <p>Realizing that he&rsquo;s been tricked and taught his lesson, the man apologized and left.<\/p>  <p><strong>Moral<\/strong>: <em>Cheating will not get you anything. If you do cheat, you&rsquo;ll pay for it soon enough.<\/em><\/p>  <p>Thanks for reading the article,&nbsp;<a href='\/quick-read\/index.html'>for more quick reads <\/a>&nbsp;<a href='\/articles\/index.html'>read our peoples blog articles<\/a>.<\/p>","banner788x443":"upload\/banners\/the-farmer-and-the-well.jpg","file":"2023-06-01-09-the-farmer-and-the-well.json"},{"title":"The camel and the baby","created":"03 Jun, 2023","updated":"2023-06-03T11:00:00+05:30","author":"Karthik Kumar D K","summary":"One day, a camel and her baby were chatting. The baby asked, “Mother, why do we have humps?” The mother replied, “Our humps are for storing water so that we can survive in the desert”.","content":"<p>One day, a camel and her baby were chatting. The baby asked, &ldquo;Mother, why do we have humps?&rdquo; The mother replied, &ldquo;Our humps are for storing water so that we can survive in the desert&rdquo;.<\/p>  <p>&ldquo;Oh&rdquo;, said the child, &ldquo;and why do we have rounded feet mother?&rdquo; &ldquo;Because they are meant to help us walk comfortably in the desert. These legs help us move around in the sand.&rdquo;<\/p>  <p>&ldquo;Alright. But why are our eyelashes so long?&rdquo; &ldquo;To protect our eyes from the desert dust and sand. They are the protective covers for the eyes&rdquo;, replied the mother camel.<\/p>  <p>The baby camel thought for a while and said, &ldquo;So we have humps to store water for desert journeys, rounded hooves to keep us comfortable when we walk in the desert sand, and long eyelashes to protect us from sand and dust during a desert storm. Then what are we doing in a zoo?&rdquo;<\/p>  <p>The mother was dumbfounded.<\/p>  <p><strong>Moral<\/strong>: <em>Your strengths, skills, and knowledge are useless if you are not in the right place<\/em>.&nbsp;<\/p>  <p>Thanks for reading the article,&nbsp;<a href='\/quick-read\/index.html'>for more quick reads<\/a>&nbsp;<a href='\/articles\/index.html'>read our peoples blog articles<\/a>.<\/p>","banner788x443":"upload\/banners\/the-camel-and-the-baby.jpg","file":"2023-06-03-11-the-camel-and-the-baby.json"},{"title":"The boasting traveler","created":"10 Jun, 2023","updated":"2023-06-10T08:00:00+05:30","author":"Karthik Kumar D K","summary":"A man came back from a tour and boasted about his adventurous journeys. He talked at length about the different people he met and his amazing feats that got him fame and praise from people everywhere.","content":"<p>A man came back from a tour and boasted about his adventurous journeys. He talked at length about the different people he met and his amazing feats that got him fame and praise from people everywhere. He went on to say that he went to the Rhodes where he had leaped to such distances that no man could ever match his feat.<\/p>  <p>He even went on to say that there were witnesses who would vouch for his words. Hearing the man boast so much, a smart bystander said, &ldquo;Oh good man, we do not need any witnesses to believe your words. Imagine this place to be Rhodes and leap for us&rdquo;.<\/p>  <p>The lying traveler didn&rsquo;t know what to do and went away quietly.<\/p>  <p><strong>Moral<\/strong>: <em>He who does a thing well does not need to boast<\/em>.<\/p>  <p>Thanks for reading the article,&nbsp;<a href='\/quick-read\/index.html'>for more quick reads<\/a>&nbsp;<a href='\/articles\/index.html'>read our peoples blog articles<\/a>.<\/p>","banner788x443":"upload\/banners\/the-boasting-traveler.jpg","file":"2023-06-10-08-the-boasting-traveler.json"},{"title":"The Golden Touch of Midas","created":"15 Jun, 2023","updated":"2023-06-15T11:00:00+05:30","author":"Karthik Kumar D K","summary":"Once upon a time, in a land far away, there lived a wealthy king named Midas. Although he had riches beyond imagination, he was not content with his wealth. He constantly craved for more and desired to possess everything he laid his eyes upon.","content":"<p>Once upon a time, in a land far away, there lived a wealthy king named Midas. Although he had riches beyond imagination, he was not content with his wealth. He constantly craved for more and desired to possess everything he laid his eyes upon.<\/p>  <p>One day, as he was walking through his magnificent garden, Midas stumbled upon a mysterious creature. It was none other than the god Dionysus, who was pleased with Midas&#39; generosity and decided to grant him a wish. Midas, driven by his insatiable greed, wished that everything he touched would turn into gold.<\/p>  <p>Dionysus warned Midas about the consequences of such a wish, but the king was blinded by his lust for gold and ignored the god&#39;s advice. Little did Midas know that his golden touch would soon become a curse rather than a blessing.<\/p>  <p>Excitedly, Midas returned to his palace and eagerly touched a nearby flower. To his astonishment, the flower immediately transformed into solid gold. He rejoiced at his newfound power, envisioning the limitless wealth he could accumulate.<\/p>  <p>However, as Midas continued to touch various objects, he soon realized the gravity of his mistake. His food turned into gold as he tried to eat, and even the water he attempted to drink became an unquenchable metal. The king&#39;s delight quickly turned into despair, and he realized that his golden touch was isolating him from the joys of life.<\/p>  <p>Midas began to understand the true value of things he had previously taken for granted. He couldn&#39;t embrace his loved ones or feel the warmth of their touch. His golden touch had turned his palace into a cold, lifeless prison. The wealth he had once treasured now seemed meaningless and hollow.<\/p>  <div class='google-ad'>     <ins class='adsbygoogle'          style='display:block; text-align:center;'          data-ad-layout='in-article'          data-ad-format='fluid'          data-ad-client='ca-pub-2683569506254139'          data-ad-slot='4812668708'><\/ins>     <script>         (adsbygoogle = window.adsbygoogle || []).push({});     <\/script> <\/div>  <p>Tormented by his curse, Midas pleaded with Dionysus to take back his wish. The god, moved by Midas&#39; remorse and realization of his mistake, agreed to lift the curse. Dionysus instructed Midas to bathe in the river Pactolus, and upon doing so, the golden touch was finally removed.<\/p>  <p>Freed from the burden of his power, Midas emerged from the river with a newfound appreciation for the simple joys in life. He no longer craved excessive wealth and realized that true happiness could not be found in material possessions alone.<\/p>  <p>From that day forward, Midas vowed to use his wealth and power wisely. He became a humble and generous ruler, sharing his riches with the less fortunate and striving to bring joy and prosperity to his kingdom.<\/p>  <p>The story of King Midas teaches us a valuable moral lesson. It reminds us that the pursuit of wealth and material possessions, without considering the consequences and the value of intangible things like love and human connection, can lead to a lonely and empty existence. True happiness lies in appreciating the simple pleasures and in using our resources to make a positive difference in the lives of others.<\/p>  <p>Thanks for reading the article,&nbsp;<a href='\/quick-read\/index.html'>for more quick reads<\/a>&nbsp;<a href='\/articles\/index.html'>read our peoples blog articles<\/a>.<\/p>","banner788x443":"upload\/banners\/the-golden-touch-of-midas.jpg","file":"2023-06-15-11-the-golden-touch-of-midas.json"},{"title":"The Boy Who Cried Wolf","created":"27 Jun, 2023","updated":"2023-06-27T12:45:00+05:30","author":"Karthik Kumar D K","summary":"Once upon a time, in a small village nestled among rolling hills, there lived a mischievous young shepherd boy named Peter. Peter's job was to watch over the village's flock of sheep and protect them from any harm.","content":"<p>Once upon a time, in a small village nestled among rolling hills, there lived a mischievous young shepherd boy named Peter. Peter&#39;s job was to watch over the village&#39;s flock of sheep and protect them from any harm. However, Peter had a tendency to get bored easily and seek attention in unusual ways.<\/p>  <p>One sunny day, while tending to his sheep, Peter decided to play a trick on the villagers. He climbed up a hill and shouted at the top of his lungs, &quot;Wolf! Wolf! A ferocious wolf is attacking the sheep!&quot;<\/p>  <p>Hearing the boy&#39;s cries, the villagers dropped their work and rushed to the field, alarmed and concerned for their livestock. But when they arrived, they found Peter giggling and rolling on the grass, his sheep peacefully grazing without a trace of danger.<\/p>  <p>The villagers were frustrated and scolded Peter for his prank. They warned him about the seriousness of his actions, as they had wasted their time and energy in responding to a false alarm. They emphasized the importance of honesty and trust.<\/p>  <p>Undeterred by their reprimand, Peter found this prank amusing and decided to repeat it. On another day, when he grew bored once again, he climbed up the hill and shouted, &quot;Wolf! Wolf! Please come quickly, the wolf is attacking!&quot;<\/p>  <p>Again, the villagers, concerned for their sheep and eager to help, hurried to the field. And once again, they found Peter laughing uncontrollably, with no wolf in sight. The villagers were angry and disappointed at being deceived for the second time.<\/p>  <p>Weeks went by, and the villagers began to doubt Peter&#39;s credibility. They no longer took his cries for help seriously, dismissing them as yet another prank. Peter&#39;s mischief had eroded the trust that once existed between him and the villagers.<\/p>  <div class='google-ad'>     <ins class='adsbygoogle'          style='display:block; text-align:center;'          data-ad-layout='in-article'          data-ad-format='fluid'          data-ad-client='ca-pub-2683569506254139'          data-ad-slot='4812668708'><\/ins>     <script>         (adsbygoogle = window.adsbygoogle || []).push({});     <\/script> <\/div>  <p>Then, one fateful day, a real wolf emerged from the forest and made its way towards the sheep. Terrified, Peter called out for help with all his might, &quot;Wolf! Wolf! Please, somebody, help!&quot;<\/p>  <p>But this time, the villagers ignored him, believing it to be another false alarm. They had become numb to his cries. The wolf attacked the flock, scattering the sheep in all directions.<\/p>  <p>Peter watched in horror as the wolf took away some of the sheep he was supposed to protect. He realized the consequences of his actions and understood the importance of honesty and trust. He had lost the trust of the villagers through his repeated lies, and now, when he genuinely needed help, no one came to his aid.<\/p>  <p>The moral of the story is clear: Honesty is a virtue we should always uphold. We must think before we speak and consider the consequences of our actions. Lying and deceiving others can lead to a loss of trust, which is difficult to regain. The tale of the boy who cried wolf reminds us of the importance of honesty, credibility, and the trust we build through our words and actions.<\/p>  <p>Thanks for reading the article,&nbsp;<a href='\/quick-read\/index.html'>for more quick reads<\/a>&nbsp;<a href='\/articles\/index.html'>read our peoples blog articles<\/a>.<\/p>","banner788x443":"upload\/banners\/the-boy-who-cried-wolf.jpg","file":"2023-06-27-12-the-boy-who-cried-wolf.json"},{"title":"The Tortoise and the Hare","created":"29 Jun, 2023","updated":"2023-06-29T11:00:00+05:30","author":"Karthik Kumar D K","summary":"Consistency, perseverance, and determination can triumph over natural talent and overconfidence. The hare, with all his speed, underestimated the power of slow and steady progress.","content":"<p>In a peaceful forest, there lived a confident and speedy hare and a slow but determined tortoise. The hare was known for his incredible speed and often boasted about his swiftness, making fun of the tortoise for his slow nature.<\/p>  <p>One day, tired of the hare&#39;s constant bragging, the tortoise challenged him to a race. The hare laughed heartily at the tortoise&#39;s proposition, unable to fathom how a slow creature like him could compete with his lightning-fast pace. Nevertheless, he accepted the challenge, thinking it would be an easy victory.<\/p>  <p>On the day of the race, all the forest animals gathered to watch. The tortoise positioned himself at the starting line, calm and composed, while the hare bounded around, full of energy and overconfidence. The signal was given, and the race began.<\/p>  <p>As expected, the hare sprinted ahead, leaving the tortoise far behind. Confident of his impending victory, the hare decided to take a break and enjoy the scenery. He lay down under a tree and closed his eyes, confident that he had plenty of time to win the race.<\/p>  <p>Meanwhile, the tortoise moved forward at his own steady pace, never wavering from his determined stride. He plodded along, step by step, undeterred by the hare&#39;s lead. Though slow, he remained focused on reaching the finish line.<\/p>  <div class='google-ad'>     <ins class='adsbygoogle'          style='display:block; text-align:center;'          data-ad-layout='in-article'          data-ad-format='fluid'          data-ad-client='ca-pub-2683569506254139'          data-ad-slot='4812668708'><\/ins>     <script>         (adsbygoogle = window.adsbygoogle || []).push({});     <\/script> <\/div>  <p>Unexpectedly, the hare, lost in his leisure, fell fast asleep. Time passed, and the forest animals began to wonder where the hare had gone. Curiosity led them to the resting hare, who woke up with a start as the tortoise was approaching the finish line.<\/p>  <p>Filled with a sudden burst of energy and panic, the hare sprinted towards the finish line, but it was too late. The tortoise had crossed the finish line, winning the race.<\/p>  <p>The forest erupted in cheers and applause for the tortoise, who had taught them a valuable lesson. The hare, humbled by his defeat, approached the tortoise and congratulated him on his victory.<\/p>  <p><strong>The moral of this story<\/strong> is that consistency, perseverance, and determination can triumph over natural talent and overconfidence. The hare, with all his speed, underestimated the power of slow and steady progress. The tortoise, through his unwavering commitment, proved that patience and steady effort can lead to success.<\/p>  <p>This tale reminds us not to underestimate others based on appearances or abilities. It teaches us the value of discipline, determination, and consistent effort in achieving our goals. Just like the tortoise, we should focus on our own journey, remain persistent, and not let the distractions or arrogance of others deter us from our path.<\/p>  <p>Thanks for reading the article,&nbsp;<a href='\/quick-read\/index.html'>for more quick reads<\/a>&nbsp;<a href='\/articles\/index.html'>read our peoples blog articles<\/a>.<\/p>","banner788x443":"upload\/banners\/the-tortoise-and-the-hare.jpeg","file":"2023-06-29-11-the-tortoise-and-the-hare.json"},{"title":"The Fox and the Grapes","created":"02 Jul, 2023","updated":"2023-07-02T11:30:00+05:30","author":"Karthik Kumar D K","summary":"In a lush vineyard, basking under the warm sun, there hung a cluster of juicy, ripe grapes. Their vibrant colors and tantalizing aroma caught the attention of a clever and cunning fox named Felix.","content":"<p>In a lush vineyard, basking under the warm sun, there hung a cluster of juicy, ripe grapes. Their vibrant colors and tantalizing aroma caught the attention of a clever and cunning fox named Felix.<\/p>  <p>Felix, known for his quick wit and sly nature, desired the sweet taste of those grapes. He jumped and leaped, reaching with all his might, but the grapes remained just out of his grasp. Undeterred, he tried again and again, but to no avail.<\/p>  <p>Growing tired and frustrated, Felix finally gave up, muttering to himself, &quot;Those grapes are probably sour anyway. I don&#39;t need them.&quot; With a disdainful flick of his tail, he walked away, pretending he didn&#39;t care.<\/p>  <p><strong>The moral of this story<\/strong> is that we often scorn or belittle the things we desire but cannot have. Just like Felix, we tend to justify our failures by convincing ourselves that what we couldn&#39;t attain wasn&#39;t worth it after all.<\/p>  <div class='google-ad'>     <ins class='adsbygoogle'          style='display:block; text-align:center;'          data-ad-layout='in-article'          data-ad-format='fluid'          data-ad-client='ca-pub-2683569506254139'          data-ad-slot='4812668708'><\/ins>     <script>         (adsbygoogle = window.adsbygoogle || []).push({});     <\/script> <\/div>  <p>The fox&#39;s reaction to the unreachable grapes represents a defense mechanism known as sour grapes. It is a metaphor for the way we rationalize our disappointments or unattained desires by devaluing them, pretending they were never desirable to begin with.<\/p>  <p>This tale reminds us to reflect on our attitudes and reactions when faced with unfulfilled aspirations. Instead of resorting to bitterness and making excuses, we should acknowledge our desires and use them as motivation to strive harder, learn from our experiences, and grow as individuals.<\/p>  <p>So, rather than adopting a sour grapes mentality, let us embrace perseverance, determination, and a positive outlook. Let us be inspired by the fox&#39;s unsuccessful attempt and use it as a reminder to pursue our goals with unwavering dedication, even when faced with obstacles.<\/p>  <p>Thanks for reading the article,&nbsp;<a href='\/quick-read\/index.html'>for more quick reads<\/a>&nbsp;<a href='\/articles\/index.html'>read our peoples blog articles<\/a>.<\/p>","banner788x443":"upload\/banners\/the-fox-and-the-grapes.jpg","file":"2023-07-02-11-the-fox-and-the-grapes.json"},{"title":"The Proud Rose","created":"05 Jul, 2023","updated":"2023-07-05T15:20:00+05:30","author":"Karthik Kumar D K","summary":"In a beautifully tended garden, there bloomed a magnificent rose. Its petals were vibrant and fragrant, capturing the admiration of all who beheld it. The rose, aware of its exquisite beauty, held its head high with pride.","content":"<p>In a beautifully tended garden, there bloomed a magnificent rose. Its petals were vibrant and fragrant, capturing the admiration of all who beheld it. The rose, aware of its exquisite beauty, held its head high with pride.<\/p>  <p>Every day, as the garden&#39;s other flowers swayed gently in the breeze, the proud rose would boast about its beauty and elegance. It would belittle the other flowers, considering itself superior and deserving of all attention and praise.<\/p>  <p>One day, a humble daisy grew nearby and listened patiently to the rose&#39;s conceited remarks. The daisy, known for its simplicity and humility, gently spoke up, &quot;Dear rose, your beauty is indeed remarkable, but true beauty lies not only in appearance but also in the heart.&quot;<\/p>  <p>The proud rose scoffed at the daisy&#39;s words, dismissing them as the envy of an inferior flower. It continued to flaunt its petals, unaware of the growing resentment it was sowing among the other flowers.<\/p>  <p>One evening, a heavy rainstorm swept through the garden, pouring raindrops upon every blossom. The next morning, as the sun&#39;s rays pierced through the clouds, the garden awakened to a breathtaking sight. Amidst the glistening morning dew, the rose found itself in a state of shock.<\/p>  <p>Its once vibrant petals were now tattered and torn, the heavy rainstorm having taken a toll on its delicate beauty. The rose&#39;s pride turned into sorrow and despair as it realized it was no longer the epitome of perfection it once believed itself to be.<\/p>  <p>The rose, humbled by its newfound appearance, looked around the garden with a sense of remorse. It saw the daisy, standing tall and unaffected by the storm, its simple white petals radiating an inner beauty that surpassed any external adornment.<\/p>  <div class='google-ad'>     <ins class='adsbygoogle'          style='display:block; text-align:center;'          data-ad-layout='in-article'          data-ad-format='fluid'          data-ad-client='ca-pub-2683569506254139'          data-ad-slot='4812668708'><\/ins>     <script>         (adsbygoogle = window.adsbygoogle || []).push({});     <\/script> <\/div>  <p>Approaching the daisy with a touch of humility, the rose spoke softly, &quot;Dear daisy, I have learned a valuable lesson. True beauty lies not in vanity and arrogance but in kindness, humility, and the ability to uplift others.&quot;<\/p>  <p>The daisy smiled warmly and forgave the rose, reminding it that beauty fades, but a kind heart and genuine humility endure. The rose, now humbled and transformed, became a beacon of wisdom in the garden. It used its newfound wisdom to inspire and encourage others, embracing the beauty within every flower.<\/p>  <p><strong>The moral of this story<\/strong> is that true beauty lies beyond appearances and superficiality. It is the inner qualities of kindness, humility, and compassion that make one truly beautiful. The proud rose learned that it is not enough to rely on external beauty and arrogance, as they are fragile and fleeting. Instead, it is the beauty of character that shines through even in the face of adversity.<\/p>  <p>Let this tale remind us to appreciate the virtues of humility and kindness, and to cultivate inner beauty that uplifts and inspires those around us.<\/p>  <p>Thanks for reading the article,&nbsp;<a href='\/quick-read\/index.html'>for more quick reads<\/a>&nbsp;<a href='\/articles\/index.html'>read our peoples blog articles<\/a>.<\/p>","banner788x443":"upload\/banners\/the-proud-rose.jpeg","file":"2023-07-05-15-the-proud-rose.json"},{"title":"The Milkmaid and Her Pail","created":"07 Jul, 2023","updated":"2023-07-07T13:45:00+05:30","author":"Karthik Kumar D K","summary":"Once upon a time, in a quaint village, there lived a young milkmaid named Emma. She was known for her dreams of a better life and her penchant for daydreaming. Emma's family relied on the milk she sold each day to make a living.","content":"<p>Once upon a time, in a quaint village, there lived a young milkmaid named Emma. She was known for her dreams of a better life and her penchant for daydreaming. Emma&#39;s family relied on the milk she sold each day to make a living.<\/p>  <p>One sunny morning, Emma set out for the market, carrying a pail filled to the brim with fresh milk. As she walked, she started to daydream about the possibilities that awaited her. &quot;If I sell this milk,&quot; she thought, &quot;I can buy some eggs. Then, I&#39;ll raise the chickens and sell their eggs. With that money, I can buy a piglet and fatten it up. Once it&#39;s big enough, I can sell it and buy a cow. Oh, I&#39;ll have so much milk to sell! I&#39;ll become rich and live in a grand house!&quot;<\/p>  <p>Lost in her thoughts, Emma began to imagine her future wealth and success. In her excitement, she swung her arms around, forgetting about the pail of milk she was carrying. With one careless swing, the pail toppled over, and all the milk spilled onto the ground.<\/p>  <p>Emma was devastated. She had lost not only the milk but also her imagined fortune. She sat there, feeling disheartened and regretful. She had let her dreams and fantasies get the best of her, neglecting the reality of the present moment.<\/p>  <p><strong>The moral of this story<\/strong> is that it is important to focus on the present and not get lost in unrealistic dreams or fantasies. Emma&#39;s daydreaming led her to neglect her responsibilities, resulting in the loss of the milk and the opportunity to earn money for her family.<\/p>  <p>The tale of the milkmaid and her pail teaches us the value of staying grounded and being mindful of our actions. While it&#39;s important to have aspirations and dreams, it&#39;s equally important to focus on the tasks at hand and make responsible decisions in the present. We should learn from Emma&#39;s mistake and strive for a balance between our dreams and the realities we face.<\/p>  <p>Thanks for reading the article,&nbsp;<a href='\/quick-read\/index.html'>for more quick reads<\/a>&nbsp;<a href='\/articles\/index.html'>read our peoples blog articles<\/a>.<\/p>","banner788x443":"upload\/banners\/the-milkmaid-and-her-pail.jpg","file":"2023-07-07-13-the-milkmaid-and-her-pail.json"},{"title":"A Wise Old Owl","created":"11 Jul, 2023","updated":"2023-07-11T16:00:00+05:30","author":"Karthik Kumar D K","summary":"In the heart of a dense forest, perched high on a sturdy branch, lived a wise old owl named Oliver. With his sparkling eyes and a coat of feathers that glowed in the moonlight, Oliver was respected by all the animals of the forest for his wisdom and counsel.","content":"<p>In the heart of a dense forest, perched high on a sturdy branch, lived a wise old owl named Oliver. With his sparkling eyes and a coat of feathers that glowed in the moonlight, Oliver was respected by all the animals of the forest for his wisdom and counsel.<\/p>  <p>One day, a young squirrel named Sammy came to Oliver seeking advice. Sammy was impulsive and often made hasty decisions without considering the consequences. He approached Oliver with a sense of urgency and asked, &quot;Oh, wise owl, how can I become wiser and make better choices in life?&quot;<\/p>  <p>Oliver looked at Sammy with a gentle gaze and replied, &quot;Dear Sammy, wisdom is not gained overnight. It is a journey that requires patience, observation, and reflection. The first step towards wisdom is to listen attentively and gather knowledge from the world around you.&quot;<\/p>  <p>Intrigued, Sammy nodded and asked, &quot;But how can I become a better listener and gather knowledge, wise owl?&quot;<\/p>  <p>Oliver smiled and shared a story. &quot;Long ago, in this very forest, there lived a group of trees. They stood tall and strong, witnessing the passage of time. Each tree had a unique story to tell and held wisdom within their rings.&quot;<\/p>  <p>&quot;One day,&quot; continued Oliver, &quot;a storm swept through the forest, causing chaos and destruction. The trees bent and swayed with the wind, their branches intertwining, supporting one another in times of adversity.&quot;<\/p>  <p>&quot;The trees taught me the importance of unity and cooperation,&quot; Oliver explained. &quot;To gain wisdom, Sammy, you must learn from others, share your experiences, and lend a helping hand when needed.&quot;<\/p>  <p>Sammy pondered on Oliver&#39;s words, understanding that wisdom came not just from one&#39;s own experiences but also from the collective knowledge of others.<\/p>  <p>Oliver concluded, &quot;Remember, Sammy, wisdom also requires self-reflection. Take time to pause and contemplate your thoughts and actions. Learn from your mistakes and embrace growth. True wisdom is a combination of knowledge, humility, and a genuine desire to learn.&quot;<\/p>  <div class='google-ad'>     <ins class='adsbygoogle'          style='display:block; text-align:center;'          data-ad-layout='in-article'          data-ad-format='fluid'          data-ad-client='ca-pub-2683569506254139'          data-ad-slot='4812668708'><\/ins>     <script>         (adsbygoogle = window.adsbygoogle || []).push({});     <\/script> <\/div>  <p>Grateful for Oliver&#39;s guidance, Sammy thanked the wise old owl and scurried off, determined to embark on his journey towards wisdom.<\/p>  <p><strong>The moral of this story<\/strong> is that wisdom is not a destination but a lifelong pursuit. It requires attentive listening, learning from others, and embracing experiences. By practicing humility and self-reflection, we can continually grow wiser, making better choices and positively impacting our lives and the lives of those around us.<\/p>  <p>Through the tale of the wise old owl, we are reminded that wisdom is not reserved for the old or the learned, but rather for anyone who seeks it with an open heart and a willingness to learn.<\/p>  <p>Thanks for reading the article,&nbsp;<a href='\/quick-read\/index.html'>for more quick reads<\/a>&nbsp;<a href='\/articles\/index.html'>read our peoples blog articles<\/a>.<\/p>","banner788x443":"upload\/banners\/a-wise-old-owl.jpg","file":"2023-07-11-16-a-wise-old-owl.json"}]