[{"title":"Powerful Solar Storm approaching Earth","created":"13 Jul, 2021","updated":"2022-12-01T09:00:00+05:30","author":"Karthik Kumar D K","summary":"According to website spaceweather.com, a powerful solar storm is approaching the Earth at a speed of 1.6 million kilometers and this storm will hit the Earth someday on 11th July - 13th July 2021.","content":"<p>According to website spaceweather.com, a powerful solar storm is approaching the Earth at a speed of 1.6 million kilometers and this storm will hit the Earth someday on 11th July - 13th July 2021. As per the website spaceweather.com, the storm that originated from the Sun's atmosphere can have a significant impact on a region of space dominated by Earth's magnetic field.<\/p>\n                                <p>According to spaceweather.com, due to solar storms, the outer atmosphere of the Earth can be heated which can have a direct effect on satellites. This can cause interference with GPS navigation, mobile phone signal and satellite TV. The current in power lines can be high, which can also blow transformers.<\/p>\n                                <p>Due to the solar storm, there will be a view of beautiful celestial lighting for the people living at the North or South Pole. The people living closer to these areas can expect to see beautiful aurora at night.<\/p>","banner788x443":"upload\/banner788x443\/public\/WGbfREm2n4jhBBjeNC5ApC.jpg","file":"2021-07-13-08-Powerful-Solar-Storm-approaching-Earth.json"},{"title":"Questions to ask Dentist before Dental Implant","created":"13 Jul, 2021","updated":"2022-12-01T09:00:00+05:30","author":"Jyothi S N","summary":"Here are a few questions to remember and ask your dentist before you proceed with your dental implant.","content":"<p>Here are a few questions to remember and ask your dentist before you proceed with your dental implant.<\/p>\n                                <ul class=\"check\">\n                                    <li>Will there be any Discomfort?<\/li>\n                                    <li>Can my body reject Dental Implant?<\/li>\n                                    <li>Are there any chances of infection after Dental Implant?<\/li>\n                                    <li>Is there any need for Implant Rehabilitation?<\/li>\n                                    <li>What are the Dental Implant Steps?<\/li>\n                                    <li>How long Dental implants last?<\/li>\n                                <\/ul>","banner788x443":"upload\/banner788x443\/public\/dental-questions.jpg","file":"2021-07-13-12-Questions-to-ask-Dentist-before-Dental-Implant.json"},{"title":"Device with Two Atoms thick, World’s thinnest device","created":"13 Jul, 2021","updated":"2022-12-01T09:00:00+05:30","author":"Leela Vasundhara","summary":"World’s thinnest piece of technology has been developed by the Scientists, which is a device with only two Atoms thick, very tiny. It can be used to store electronic information.","content":"<p>World’s thinnest piece of technology has been developed by the Scientists, which is a device with only two Atoms thick, very tiny. It can be used to store electronic information.<\/p>\n                            <p>This device consists of 2 layers one with Boron & other with Nitrogen, which are arranged in a repeating hexagonal structure.<\/p>\n                            <p>Electrons from Boron & Nitrogen atoms are able to zip between two layers by using the effect called Quantum Tunneling (strange quantum mechanical effect), which changes the state of the device and will allow it to encode digital information.<\/p>","banner788x443":"upload\/banner788x443\/public\/two-atoms-device.jpeg","file":"2021-07-13-13-Device-with-Two-Atoms-thick-Worlds-thinnest-device.json"},{"title":"Heat on Earth’s Atmosphere is Heating much as it did fifteen years ago","created":"13 Jul, 2021","updated":"2022-12-01T09:00:00+05:30","author":"Karthik Kumar D K","summary":"Earth's energy imbalance doubled between 2005 - 2019, this was identified by a team from NASA & NOAA. Energy Im-balance is the difference between the amount of energy absorbed by Earth and the amount of energy emitted by Earth.","content":"<p>Earth's <strong>energy imbalance<\/strong> doubled between 2005 - 2019, this was identified by a team from NASA & NOAA. Energy Im-balance is the difference between the amount of energy absorbed by Earth and the amount of energy emitted by Earth.<\/p>\n                            <p>Means, if there is any energy imbalance on earth, Earth will be gaining energy which will lead to heat up more.<\/p>\n                            <p>So to quantify this, the team used data from two sources, one is NASA’s Clouds & Earth’s Radiant Energy System (CERES). And a system run by NOAA called Agro. CERES would be knowing how much energy is entering & leaving earth.<\/p>\n                            <p>And this research is another data point in the argument that climate change is real and that humans are causing it.<\/p>","banner788x443":"upload\/banner788x443\/public\/earth-heat.jpg","file":"2021-07-13-18-Heat-on-Earths-Atmosphere-is-Heating-much-as-it-did-fifteen-years-ago.json"},{"title":"ISRO successfully conducted the Third Test on Vikas Engine for Gaganyaan","created":"17 Jul, 2021","updated":"2022-12-01T09:00:00+05:30","author":"Karthik Kumar D K","summary":"On July 14, 2021, ISRO has successfully conducted the third long-duration hot test of the liquid propellant Vikas Engine for the core L110 liquid stage of the human-rated GSLV MkIII vehicle, as part of the engine qualification requirements for the Gaganyaan Programme.","content":"<p>On July 14, 2021, ISRO has successfully conducted the third long-duration hot test of the <strong>liquid propellant Vikas Engine<\/strong> for the core L110 liquid stage of the human-rated GSLV MkIII vehicle, as part of the engine qualification requirements for the <strong>Gaganyaan<\/strong> Programme.<\/p>\n                            <p>The engine was fired for a duration of 240 seconds at the engine test facility of ISRO Propulsion Complex (IPRC), Mahendragiri in Tamil Nadu.<\/p>\n                            <p>The performance of the engine met the test objectives and the engine parameters were closely matching with the predictions during the entire duration of the test.<\/p>\n                            <p>Source: <a href=\"https:\/\/www.isro.gov.in\/update\/14-jul-2021\/third-successful-vikas-engine-long-duration-hot-test-gaganyaan-program\"><strong><i><u>https:\/\/www.isro.gov.in\/update\/14-jul-2021\/third-successful-vikas-engine-long-duration-hot-test-gaganyaan-program<\/u><\/i><\/strong><\/a><\/p>\n                            <p><strong>Elon Musk, the CEO of SpaceX<\/strong>, congratulated the <strong>Indian Space Research Organisation (ISRO)<\/strong> on the successful completion of the third long-duration hot test of the liquid propellant Vikas engine for the Gaganyaan programme, India's first manned space mission.<\/p>\n                            <p><strong>Union Minister of State (Independent charge) of Space<\/strong>, Jitendra Singh said in February this year that the first unmanned mission is planned in December 2021 and the second unmanned one in 2022-23 followed by the human spaceflight demonstration.<\/p>","banner788x443":"upload\/banner788x443\/public\/gaganyaan_vikas_engine_isro.jpg","file":"2021-07-17-17-ISRO-successfully-conducted-the-Third-Test-on-Vikas-Engine-for-Gaganyaan.json"},{"title":"July 23rd - National Broadcasting Day","created":"23 Jul, 2021","updated":"2022-12-01T09:00:00+05:30","author":"Karthik Kumar D K","summary":"During the British Raj, Broadcasting began in June 1923 with the programs by the Bombay Presidency Radio Club and other radio clubs.","content":"<p>During the British Raj, Broadcasting began in June 1923 with the programs by the Bombay Presidency Radio Club and other radio clubs.<\/p>\n                            <ul class=\"check\">\n                                <li>The private <strong>Indian Broadcasting Company Ltd (IBC)<\/strong> was authorized to operate two radio stations in an agreement on 23 July 1927.<\/li>\n                                <li><strong>IBC started with two stations<\/strong>, one in Bombay (now Mumbai) on 23 July 1927 and other in Calcutta (now Kolkata) on 26 August 1927.<\/li>\n                                <li><strong>Government took over IBC Ltd<\/strong>, since the company went into liquidation on 1 March 1930.<\/li>\n                                <li>The <strong>Government started Indian State Broadcasting Service (ISBS)<\/strong> on 1 April 1930 on an experimental basis and made it permanent in May 1932.<\/li>\n                                <li>Later this <strong>became All India Radio<\/strong> on 8 June 1936.<\/li>\n                            <\/ul>\n                            <p>In India, <strong>July 23rd is observed as National Broadcasting Day<\/strong> since first broadcasting was started on this day in 1927 in Bombay (now Mumbai).<\/p>","banner788x443":"upload\/banner788x443\/public\/radio-broadcasting.jpg","file":"2021-07-23-13-July-twenty-third-National-Broadcasting-Day.json"},{"title":"July 26th - Kargil Vijay Diwas","created":"26 Jul, 2021","updated":"2022-12-01T09:00:00+05:30","author":"Karthik Kumar D K","summary":"In 1999, India successfully took command of high outposts on this date. The Kargil war was fought for more than 60 days & ended on this date.","content":"<p>In 1999, <strong>India successfully took command of high outposts<\/strong> on this date. The Kargil war was fought for more than 60 days & ended on this date.<\/p>\n                            <p><strong>Pakistani army<\/strong> took advantage of the melting snow & took command of high outposts of India, <strong>by betraying the bilateral agreement<\/strong> of both the nations that posts would remain unattended during winter season.<\/p>\n                            <p><strong>Pakistani army denied involvement in the war<\/strong> & claimed that it was caused by independent Kashmiri rebel forces, however <strong>documents left behind by casualties & later statements by<\/strong> Pakistan's Prime Minister and Chief of Army Staff, <strong>showed involvement of Pakistani paramilitary forces<\/strong>, led by General Ashraf Rashid.<\/p>\n                            <p>The Kargil war resulted in loss of life on both sides and was ended when <strong>India regained control<\/strong> over the post and <strong>ejected the Pakistani Army out<\/strong> of the territory.<\/p>\n                            <p><strong>Kargil Vijay Diwas<\/strong> is celebrated on 26 July every year in honour of the Kargil War's Heroes.<\/p>","banner788x443":"upload\/banner788x443\/public\/kargil-vijay-diwas.jpg","file":"2021-07-26-10-July-twenty-sixth-Kargil-Vijay-Diwas.json"},{"title":"GSLV-F10 to launch Earth Observation Satellite","created":"12 Aug, 2021","updated":"2022-12-01T09:00:00+05:30","author":"Karthik Kumar D K","summary":"GSLV-F10 is slated to launch Earth Observation Satellite, EOS-03 on August 12th, 2021 from Satish Dhawan Space Centre SHAR, Sriharikota.","content":"<p>GSLV-F10 is slated to launch Earth Observation Satellite, <strong>EOS-03<\/strong> on August 12th, 2021 from Satish Dhawan Space Centre SHAR, Sriharikota.<\/p>\n                            <p><strong>Countdown for the launch of GSLV-F10\/EOS-03<\/strong> mission commenced on August 11th at 03:43 Hrs (IST) from Satish Dhawan Space Centre (SDSC) SHAR, Sriharikota<\/p>\n                            <p>GSLV-F10 <strong>launch took place today (12th Aug) at 05:43 Hrs IST as scheduled<\/strong>. Performance of first and second stages was normal. However, Cryogenic Upper Stage ignition did not happen due to technical anomaly. The <strong>mission couldn't be accomplished<\/strong> as intended.<\/p>\n                            <p>ISRO chairman <strong>K. Sivan<\/strong> said that a \"technical anomaly was observed in the cryogenic stage and the mission could not be accomplished.\"<\/p>\n                            <p>Veteran space scientist <strong>G Madhavan Nair<\/strong> said that \"This is a very complex mission. Normally, the Cryogenic stage is the most difficult one compared to all other rocket propulsions. This is the eighth launch of cryogenic stage. <strong>This was the first unsuccessful one<\/strong>.\"<\/p>","banner788x443":"upload\/banner788x443\/public\/gslv-f10-launch.png","file":"2021-08-12-15-GSLV-F-ten-to-launch-Earth-Observation-Satellite.json"},{"title":"Virtual QUAD meet on 12th August, 2021","created":"13 Aug, 2021","updated":"2022-12-01T09:00:00+05:30","author":"Karthik Kumar D K","summary":"On August 12th, 2021 Senior Officials from four democracies - Australia, India, Japan, and the U.S. - met virtually to discuss Quad initiatives on economic recovery, maritime security, and human rights that promote a free and open IndoPacific region.","content":"<p>On August 12th, 2021 <strong>Senior Officials from four democracies<\/strong> - Australia, India, Japan, and the U.S. - met virtually to discuss Quad initiatives on economic recovery, maritime security, and human rights that promote a free and open IndoPacific region.<\/p>\n                            <p>The <strong>four democracies acknowledged that global security and prosperity<\/strong> depends on the region remaining inclusive, resilient, and healthy.<\/p>\n                            <p>The officials examined <strong>ways to advance ongoing cooperation on numerous topics of mutual interest<\/strong>, including strategic challenges confronting the region, countering disinformation, promoting democracy and human rights, strengthening international institutions including the United Nations and related organizations, and <strong>supporting countries vulnerable to coercive actions<\/strong> in the Indo-Pacific region<\/p>\n                            <ul class=\"check\">\n                                <li>They discussed the importance of sustained international cooperation to <strong>end the COVID-19 pandemic in the Indo-Pacific<\/strong> and to promote economic recovery.<\/li>\n                                <li>The senior officials discussed the importance of peace and security in the <strong>Taiwan Strait<\/strong>, the ongoing <strong>crisis in Burma<\/strong>, and reaffirmed the <strong>Quad's strong support for ASEAN centrality<\/strong> and the ASEAN Outlook on the Indo-Pacific.<\/li>\n                                <li>They <strong>welcomed the opportunity to continue regular consultations<\/strong> at the ministerial, senior official, and working levels and to hold a second Leaders’ Summit this fall.<\/li>\n                            <\/ul>\n                            <p>Senior Officials from four democracies involved in this discussion were.<\/p>\n                            <ul class=\"check\">\n                                <li>Australia: <strong>Mr. Justin Hayhurst<\/strong>, Deputy Secretary (Indo-Pacific Group) and <strong>Dr. Lauren Bain<\/strong>, Assistant Secretary, ASEAN and Regional Architecture Branch, from Department of Foreign Affairs and Trade.<\/li>\n                                <li>India: <strong>Ms. Vani Rao<\/strong>, Joint Secretary (Americas) and <strong>Mr. Naveen Srivastava<\/strong>, Additional Secretary (East Asia), from Ministry of External Affairs.<\/li>\n                                <li>Japan: <strong>Mr. OKANO Masataka<\/strong>, Deputy Minister for Foreign Policy and <strong>Mr. ENDO Kazuya<\/strong>, Deputy Director General, Asian and Oceanian Affairs Bureau, from the Ministry of Foreign Affairs.<\/li>\n                                <li>U.S.: <strong>Mr. Richard Buangan<\/strong>, Acting Senior Bureau Official for the Bureau of East Asian and Pacific Affairs, Department of State and <strong>Mr. Dean Thompson<\/strong>, Acting Assistant Secretary (South and Central Asian Affairs), from Department of State.<\/li>\n                            <\/ul>","banner788x443":"upload\/banner788x443\/public\/quad-aug-2021.webp","file":"2021-08-13-12-Virtual-QUAD-meet-on-twelfth-August-twenty-twenty-one.json"},{"title":"India, Russia to assess Taliban actions, before taking any action on Taliban","created":"25 Aug, 2021","updated":"2022-12-01T09:00:00+05:30","author":"Karthik Kumar D K","summary":"Russian President Vladimir Putin and Indian Prime Minister Narendra Modi agreed on the rise of Islamic radicalization in the region and are concerned over spread of terrorism by Taliban affiliated groups in Pakistan.","content":"<p>Russian President <strong>Vladimir Putin<\/strong> and Indian Prime Minister <strong>Narendra Modi<\/strong> agreed on the rise of Islamic radicalization in the region and <strong>are concerned over spread of terrorism by Taliban affiliated groups in Pakistan<\/strong>.<\/p>\n                            <p>The two countries have also <strong>decided to set up combined teams<\/strong> of foreign ministry and national security officials of each country to conduct a detailed assessment of the Afghan situation so that the <strong>future course of action with the Taliban Islamic government is decided by both India and Russia<\/strong>.<\/p>\n                            <p>These <strong>crucial decisions were taken<\/strong> after Russian President Vladimir Putin called up Prime Minister Narendra Modi <strong>on Tuesday (24th Aug 2021)<\/strong> and held a detailed conversation over telephone on the Afghanistan situation and its impact on both South and Central Asia ahead of the G-7 summit.<\/p>\n                            <p><strong>During the conversation<\/strong> between the two leaders, Prime Minister Narendra Modi told President Putin that India was concerned about Islamic radicalization in the region and how Taliban affiliated terrorist groups in Pakistan could use the developing situation to spread terrorism. <strong>It is understood that President Putin agreed with PM Modi’s assessment and expressed concern over radicalization in the Central Asian Republics<\/strong>.<\/p>","banner788x443":"upload\/banner788x443\/public\/india-russia-taliban.png","file":"2021-08-25-13-India-Russia-to-assess-Taliban-actions-before-taking-any-action-on-Taliban.json"},{"title":"Indian Astrophysicists spotted rare merger of three massive black holes","created":"27 Aug, 2021","updated":"2022-12-01T09:00:00+05:30","author":"Karthik Kumar D K","summary":"According to the Press Information Bureau, Astrophysicists in India have spotted a rare merging of three supermassive black holes.","content":"<p>According to the Press Information Bureau, <strong>Astrophysicists in India have spotted<\/strong> a rare merging of three supermassive black holes. They were observing the <strong>merging of two galaxies named NGC7733 and NGC7734<\/strong> in our celestial neighbour.<\/p>\n                            <p>When they detected unusual emissions from the centre of the latter and also a curious movement of a large bright clump having a different velocity than that of NGC7733. Inferring that this was a separate galaxy, the <strong>scientists named it NGC7733N<\/strong>.<\/p>\n                            <p>The <strong>Indian Institute of Astrophysics (IIA) team explains that<\/strong> if two galaxies collide, their black hole will also come closer by transferring the kinetic energy to the surrounding gas. The distance between the blackholes decreases with time until the separation is around a parsec (3.26 light-years). The two black holes are then unable to lose any further kinetic energy in order to get even closer and merge. This is known as the final parsec problem. The presence of a third black hole can solve this problem. The dual merging blackholes can transfer their energy to the third blackhole and merge with each other.<\/p>\n                            <p>Many Active Galactic Nuclei (AGN) <strong>pairs have been detected in the past, but triple AGN are extremely rare<\/strong>, and only a handful has been detected before using X-ray observations. However, the IIA team expects such triple AGN systems to be more common in small merging groups of galaxies. Although this study focuses only on one system, results suggest that small merging groups are ideal laboratories to detect multiple supermassive black holes.<\/p>","banner788x443":"upload\/banner788x443\/public\/Black-Holes-Merge.jpg","file":"2021-08-27-17-Indian-Astrophysicists-spotted-rare-merger-of-three-massive-black-holes.json"},{"title":"Olympics and Paralympics are two different Olympic Games","created":"31 Aug, 2021","updated":"2022-12-01T09:00:00+05:30","author":"Karthik Kumar D K","summary":"There is a key difference between the Olympics and the Paralympics, where in the Olympics the participants will be able-bodied people and whereas in Paralympics the participants will have some form of physical or intellectual disabilities.","content":"<p>There is a <strong>key difference<\/strong> between the Olympics and the Paralympics, where in the Olympics the <strong>participants will be able-bodied people<\/strong> and whereas in Paralympics the <strong>participants will have some form of physical or intellectual disabilities<\/strong>.<\/p>\n                            <p>Paralympics <strong>was originally started<\/strong> as a way to help soldiers who had been wounded in World War II.<\/p>\n                            <p>Paralympic games were <strong>started off as a way to provide rehabilitating sport for veterans<\/strong>, which was eventually turned into recreational sport by having a friendly competition before eventually developing into Paralympics, what is called today.<\/p>\n                            <p>Paralympics is overseen by the <strong>International Paralympic Committee<\/strong> (IPC) whereas the Olympics are overseen by the <strong>International Olympic Committee<\/strong> (IOC).<\/p>\n                            <p>As Summer Olympics and the Winter Olympics, similarly their are Summer Paralympics and the Winter Paralympics. However, <strong>both the Olympics and the Paralympics take place every four years<\/strong>, in two segments.<\/p>\n                            <p>Due to a joint agreement between IOC and IPC, the Summer Paralympics take place in the same city as the Summer Olympics, immediately after the Olympics has concluded. Similarly, the Winter Paralympics take place in the same city after the Winter Olympics.<\/p>\n                            <p>The first modern Olympics took place in <strong>1896<\/strong>, whereas the Paralympics first officially took place in <strong>1960<\/strong>. And yes, the Olympics are much older and are much more popular than the Paralympics.<\/p>\n                            <p>There is a large funding gap between the Olympics and Paralympic athletes, which has caused the Paralympians to strive for treatment equal to non-disabled Olympic athletes. Something that is an ongoing struggle, but Paralympians have now been getting more attention than they previously were.<\/p>\n                            <p>And Paralympics is the <strong>Second biggest sporting event<\/strong> in the world after the Olympics.<\/p>","banner788x443":"upload\/banner788x443\/public\/Olympics-and-Paralympics.jpg","file":"2021-08-31-17-Olympics-and-Paralympics-are-two-different-Olympic-Games.json"},{"title":"Vikram Misri Is New Deputy National Security Advisor","created":"28 Dec, 2021","updated":"2022-12-01T09:00:00+05:30","author":"Karthik Kumar D K","summary":"Vikram Misri has been appointed as the Deputy National Security Advisor in the National Security Council Secretariat.","content":"<p>Vikram Misri is a <strong>career diplomat from the 1989 batch<\/strong> of the <strong>Indian Foreign Service<\/strong>. He was born in Srinagar, Vikram Misri attended the Scindia School before graduating from Delhi's Hindu College. He also holds an MBA degree. And before joining the civil services, he had worked in advertising and ad film-making for three years.<\/p> <p>Earlier Vikram Misri has <strong>served at the Ministry of External Affairs<\/strong> of India, <strong>in the Prime Ministers Office<\/strong>, and also was part of several Indian missions in Europe, Africa, Asia, and North America.<\/p> <p>Now Vikram Misri <strong>has been appointed as the Deputy National Security Advisor<\/strong> in the National Security Council Secretariat. Earlier as an officer of the Foreign Services, he served as the envoy to China till December 11th 2021.<\/p> <p>Here are the few services taken up by him in the past:<\/p> <ul class='check1'> <li>He has served as India Ambassador to <strong>Myanmar and Spain<\/strong>. In 2019, he was appointed as the Ambassador to <strong>Beijing<\/strong> and served during a <strong>critical period in Indo-China ties<\/strong>.<\/li> <li>Mr Misri was a <strong>part of several talks held with China<\/strong> after the troops of both countries violently clashed in the <strong>Galwan Valley in June 2020<\/strong>, resulting in the first casualties from skirmishes in the region in four decades<\/li> <li>He served as the <strong>Private Secretary to<\/strong> then Prime Minister <strong>Inder Kumar Gujral<\/strong>, to former Prime Minister <strong>Manmohan Singh<\/strong> & also to <strong>Narendra Modi<\/strong> in 2014.<\/li> <\/ul>","banner788x443":"upload\/banners\/vikram-misri.JPG","file":"2021-12-28-14-Vikram-Misri-Is-New-Deputy-National-Security-Advisor.json"},{"title":"Fourth QUAD meet on 11th February 2022","created":"13 Feb, 2022","updated":"2022-12-01T09:00:00+05:30","author":"Karthik Kumar D K","summary":"A Joint statement by QUAD member countries Australia, India, Japan, and United States was released post the fourth meeting that happened on 11th Feb 2022 in Melbourne, Australia.","content":"<p>A <strong>Joint statement by QUAD<\/strong> member countries Australia, India, Japan, and United States was released post the <strong>fourth meeting<\/strong> that happened on <strong>11th Feb 2022 in Melbourne, Australia<\/strong>.<p> <p>This Fourth QUAD meeting was with <strong>Marise Payne<\/strong>, Minister for Foreign Affairs Australia, <strong>Subrahmanyam Jaishankar<\/strong>, External Affairs Minister of India, <strong>Hayashi Yoshimasa<\/strong>, Minister of Foreign Affairs of Japan & <strong>Antony Blinken<\/strong>, Secretary of State of the United States of America.<p> <h3>Overview of the meeting:<\/h3> <ul class='check'> <li>Reaffirm the Quad’s commitment to <strong>supporting Indo-Pacific countries efforts<\/strong> to advance a free and open Indo-Pacific.<\/li> <li>Quad partners have collectively provided more than 500 million vaccine doses. Together, <strong>Pledged to donate more than 1.3 billion vaccine doses globally<\/strong>. Pleased with the Quad Vaccine Partnership’s rapid progress in <strong>expanding vaccine production at the Biological E Ltd facility in India<\/strong>, which aims to deliver at least 1 billion vaccines by the end of 2022.<\/li> <li>To <strong>Strengthen HADR<\/strong> cooperation in the Indo-Pacific region.<\/li> <li>Quad is <strong>exchanging information on ever-evolving threats<\/strong> and working with Indo-Pacific countries, and in multilateral fora, to counter all forms of terrorism and violent extremism.<\/li> <li>Assist countries in the Indo-Pacific in the <strong>area of Cybersecurity<\/strong>.<\/li> <li>Issues <strong>related to the East and South China Seas<\/strong>.<\/li> <li><strong>Condemned the ballistic missile launches<\/strong> by North Korea.<\/li> <li><strong>Related to Myanmar<\/strong>, the four ministers expressed their grave concern over the current situation.<\/li> <li>Exchanged views on the <strong>current situation concerning Ukraine<\/strong>, where tensions are rising.<\/li> <\/ul> <p><strong>Hayashi Yoshimasa<\/strong>, Minister of Foreign Affairs of Japan <strong>conveyed<\/strong> that Prime Minister <strong>Kishida<\/strong> is looking forward to the <strong>next Quad Summit Meeting to be held in Japan<\/strong> in the first half of 2022.<\/p> <h3>Media Statement by QUAD member countries:<\/h3> <ul class='check'> <li><strong>Australian Governament<\/strong> - <a target='_blank' href='https:\/\/www.foreignminister.gov.au\/minister\/marise-payne\/media-release\/quad-cooperation-indo-pacific'>https:\/\/www.foreignminister.gov.au\/minister\/marise-payne\/media-release\/quad-cooperation-indo-pacific<\/a><\/li> <li><strong>Indian Government<\/strong> - <a target='_blank' href='http:\/\/www.mea.gov.in\/Speeches-Statements.htm?dtl\/34856\/Remarks+by+External+Affairs+Minister+Dr+S+Jaishankar+at+the+4th++Quad+Foreign+Ministers+Meeting+Press+Conference'>http:\/\/www.mea.gov.in\/Speeches-Statements.htm?dtl\/34856\/Remarks+by+External+Affairs+Minister+Dr+S+Jaishankar+at+the+4th++Quad+Foreign+Ministers+Meeting+Press+Conference<\/a><\/li> <li><strong>Japan Government<\/strong> - <a target='_blank' href='https:\/\/www.mofa.go.jp\/fp\/nsp\/page6e_000274.html'>https:\/\/www.mofa.go.jp\/fp\/nsp\/page6e_000274.html<\/a><\/li> <li><strong>United States Government<\/strong> - <a target='_blank' href='https:\/\/www.state.gov\/joint-statement-on-quad-cooperation-in-the-indo-pacific\/'>https:\/\/www.state.gov\/joint-statement-on-quad-cooperation-in-the-indo-pacific\/<\/a><\/li> <\/ul>","banner788x443":"upload\/banners\/QUAD-fourth-meet.jpg","file":"2022-02-13-14-Fourth-QUAD-meet-on-11th-February-2022.json"},{"title":"A Comet which is twice the Everest's size is heading toward Earth","created":"27 Jun, 2022","updated":"2022-12-01T09:00:00+05:30","author":"Karthik Kumar D K","summary":"A massive comet named C\/2017 K2 (PanSTARRS) is heading toward the Earth. It is twice the size of Mount Everest and will make its closest approach on July 14.","content":"<p>A massive comet named C\/2017 K2 (PanSTARRS) is heading toward the Earth. It is twice the size of Mount Everest and will make its closest approach on July 14.<\/p>  <p>It was first spotted in 2017. It mostly consists of ice and will not pose any danger to general people, but an astronomer will be more excited.<\/p>  <p><strong>Let&#39;s see what we know about it and how can we watch it?<\/strong><\/p>  <ul> <li>This C\/2017 K2 has been active for a long time. Comets are a mass of rock, ice, and gases that become &quot;active&quot; when warmed by a star. The C\/2017 K2 heading from the edge of the solar system was already bright when seen in 2017. Scientists do not know the reason for this yet.<\/li> <li>The comet has a nucleus diameter of 18km, which is double the size of Mount Everest, a cometary atmosphere of 1.3 lakh kilometres, and a tail that is eight lakh kilometres long,&nbsp;it&#39;s not the largest comet ever.<\/li> <li>Astronomers have theorised that the C\/2017 K2 (PanSTARRS) has been travelling from the Oort cloud to the inner solar system in a hyperbolic orbit for around 30 lakh years.<\/li> <li>And in next month July 2022, this comet will be around 27.7 crore kilometres from our planet. It has a cometary atmosphere the size of Jupiter and should be visible to people with a simple telescope.<\/li> <li>And people can see it in the Northern Hemisphere till this year September 2022. After mid-September, it will touch the hemisphere&#39;s southwestern horizon and shall be suitable for people viewing in the Southern Hemisphere.<\/li> <li>And the Skywatchers using a small telescope in a dark-sky site will witness a fuzzy patch of light around the C\/2017 K2&#39;s nucleus. But, long-exposure images should reveal the comet and its tail in its entirety.<\/li> <\/ul>","banner788x443":"upload\/banners\/a-comet-which-is-twice-the-everest-size-is-heading-toward-earth.jpg","file":"2022-06-27-13-a-comet-which-is-twice-the-everest-size-is-heading-toward-earth.json"},{"title":"Legislative Assistants for Members of Parliament (LAMP) Fellowship","created":"29 Jun, 2022","updated":"2022-12-01T09:00:00+05:30","author":"Hanukkah John","summary":"LAMP Fellowship is an opportunity for young people in India, provided by the Indian Government, to be mentored by a Member of Parliament, during this course of the Fellowship, people will get the opportunity to engage with experts from diverse sectors and understand important policy and development issues of the country.","content":"<p>LAMP Fellowship is an opportunity for young people in India, provided by the Indian Government, to be mentored by a Member of Parliament, during this course of the Fellowship, people will get the opportunity to engage with experts from diverse sectors and understand important policy and development issues of the country.<\/p>  <ul> <li>Primary role is to <strong>provide research support to the Member of Parliament<\/strong> (whom shall be assigned to).<\/li> <li>LAMP Fellow will undertake the work that is Parliament related, such as inputs for bills, parliamentary questions, policy discussions and standing committee meetings.<\/li> <li>Provide background research for the conferences and media events that MPs are attending in their official capacity.<\/li> <li>Some MPs may delegate constituency-related work to their LAMP Fellows, taking up such work (including visits to the constituency) is subject to the agreement between the MP and the LAMP Fellow.<\/li> <\/ul>  <p><strong>Eligibility for the Fellowship<\/strong><\/p>  <ul> <li>Should be an Indian citizen and age 25 or under 25.<\/li> <li>Must have a Bachelor&#39;s degree in any field.<\/li> <\/ul>  <p>Here&rsquo;s are important FAQ&rsquo;s - <a href='https:\/\/prsindia.org\/lamp\/faq' target='_blank'>https:\/\/prsindia.org\/lamp\/faq<\/a><\/p>","banner788x443":"upload\/banners\/legislative-assistants-for-members-of-parliament-lamp-fellowship.jpg","file":"2022-06-29-11-legislative-assistants-for-members-of-parliament-lamp-fellowship.json"},{"title":"ISRO launched three Singapore Satellites with PSLV","created":"01 Jul, 2022","updated":"2022-12-01T09:00:00+05:30","author":"Karthik Kumar D K","summary":"On Thursday 30th Jun 2022 at 18:02 hours IST, India successfully placed into orbit three Singaporean satellites exactly as planned, which will make it the second successful rocket and satellite launch mission in 2022.","content":"<p>On Thursday 30th Jun 2022 at 18:02 hours IST, India successfully placed into orbit three Singaporean satellites exactly as planned, which will make it the second successful rocket and satellite launch mission in 2022.<\/p>  <p>It was the PSLV-C53 rocket which took up the Satellites into space from the Satish Dhawan Space Centre, Sriharikota. And with this successful mission, the PSLV rocket has launched 345 foreign satellites in 36 countries since 1999.<\/p>  <p>Satellites, which are part in this mission are:<\/p>  <ul> <li>The DS-EO carries an electro-optic, multi-spectral payload with 0.5 m resolution imaging capability, while the NeuSAR is Singapore&#39;s first small commercial satellite carrying a SAR payload that is capable of providing images 24 hours a day and in all weather conditions.<\/li> <li>The SCOOB-I satellite is the first in the Student Satellite Series (S3-I) - a hands-on student training program from the NTU&#39;s Satellite Research Centre (SaRC).<\/li> <li>And a PSLV Orbital Experimental Module (POEM) orbiting the earth as a stabilised platform<\/li> <\/ul>  <p>&quot;<em>The PSLV C53 rocket has placed the customer satellites in a precise orbit. The PS4 will write some &#39;POEMs&#39; in space,<\/em>&quot; said ISRO Chairman S. Somanath said after confirming that the space mission achieved its set objectives.<\/p>","banner788x443":"upload\/banners\/isro-launched-three-singapore-satellites-with-pslv.jpeg","file":"2022-07-01-16-isro-launched-three-singapore-satellites-with-pslv.json"},{"title":"Dara Singh Randhawa (Dara Singh)","created":"12 Jul, 2022","updated":"2022-12-01T09:00:00+05:30","author":"Karthik Kumar D K","summary":"Dara Singh was an Indian Professional Wrestler, Actor, Director and Politician. He is known for his undefeated worldwide streak in wrestling. His flooring of King Kong is still remembered.","content":"<p>Dara Singh was an Indian Professional Wrestler, Actor, Director and Politician.<\/p>  <p>He was born on 19th November 1928 in a Jat Sikh family, to Surat Singh Randhawa and Balwant Kaur.<\/p>  <p>He is known for his undefeated worldwide streak in wrestling. His flooring of King Kong is still remembered. According to Thesz, <em>Dara Sing was an authentic wrestler, he was superbly conditioned and had no problem losing to the latter<\/em>. His last tournament, where he announced his retirement, was held in Delhi in June 1983.<\/p>  <p>He started his career as an actor in 1952 with Sangdil. He worked as Hindi and Punjabi film producer, director and writer, and he acted in films and television. His last Hindi movie was Jab We Met and the last Punjabi movie released before his illness was Dil Apna Punjabi. He acted in National Award-winning film Main Maa Punjab Dee directed by Balwant Singh Dullat. His role of Hanuman in the film Bajrangbali (1976) and in Ramanand Sagar&#39;s Ramayan made him popular.<\/p>  <p>He was the first sportsman to be nominated to the Rajya Sabha (upper house) of India.<\/p>  <p>On 7 July 2012, Singh was admitted into Kokilaben Dhirubhai Ambani Hospital, because of a massive heart attack. Two days later, it was confirmed that he had brain damage due to the lack of blood flow. He was discharged from hospital on 11 July 2012, citing that nothing can be done to prolong life, and died the next day at his home in Mumbai. He was cremated at Juhu crematorium.<\/p>  <p>In 1996 Singh was inducted into the Wrestling Observer Newsletter Hall of Fame. In 2016, Dara was included in the list India&#39;s top wrestlers of all time. On 7 April 2018 WWE inducted him in the WWE Hall of Fame Legacy class of 2018.<\/p>","banner788x443":"upload\/banners\/dara-singh-randhawa.jpeg","file":"2022-07-12-12-dara-singh-randhawa.json"}]