{
    "0": "Sex before marriage or after marriage, what do you prefer?",
    "1": "Tell about your first love?",
    "2": "Do you have a favourite sibling?",
    "3": "What have you bought that’s been the biggest waste of money?",
    "4": "What is a secret you have never told anyone?",
    "5": "Do you have a hidden talent?",
    "6": "If you could swap lives with someone in the room, who would it be?",
    "7": "Do you have a favourite friend?",
    "8": "If you could become invisible, what’s the worst thing you’d do?",
    "9": "What’s the worst thing you’ve ever done at work?",
    "10": "Have you ever broken the law?",
    "11": "Who would you call in the room to help bury a body?",
    "12": "What is something you’re glad your parents doesn’t know about you?",
    "13": "Have you ever gone skinny dipping?",
    "14": "What’s the one thing you’d never do for all the money in the world?",
    "15": "Who do you think is the worst dressed person in the room?",
    "16": "Who in the room would be the worst person to date and why?",
    "17": "What’s your biggest turn off?",
    "18": "Does size really matter?",
    "19": "Have you ever faked an orgasm?",
    "20": "Have you ever been caught in action? If so, by who?",
    "21": "If you could only ever do one position for the rest of your life, which one would it be and why?",
    "22": "What’s the most embarrassing thing that’s happened to you during sex?",
    "23": "Where’s the riskiest place you’ve done it?",
    "24": "Have you ever filmed a sex tape?",
    "25": "What’s your biggest turn on?",
    "26": "Do you have any fetishes?",
    "27": "Do you like loud or silent people in bed?",
    "28": "What is your favourite song when it comes to action in the bedroom?",
    "29": "What is the most embarrassing thing you have ever done?",
    "30": "What is the weirdest dream you have ever had?",
    "31": "What is the weirdest thing you have ever done in front of the mirror?",
    "32": "What would you do if you got locked in a supermarket overnight?",
    "33": "If you were the opposite sex for one day, what would you do?",
    "34": "What’s the strangest thing someone would find in your web search history?",
    "35": "What’s the weirdest role play you’ve ever done?",
    "36": "What's the scariest thing you've ever done?",
    "37": "If you met a genie, what would your three wishes be?",
    "38": "What is something that no one else knows about you?",
    "39": "What’s the one thing you’d do if you knew there were no consequences?",
    "40": "Tell us the one bedtime secret no one knows about you?",
    "41": "Tell everyone your most embarrassing story about yourself?",
    "42": "Has anyone ever accidentally seen you naked?",
    "43": "If you could kiss someone right now, who would it be?",
    "44": "What’s the strangest adult film category you’ve ever searched for?",
    "45": "Do you own any toys? What’s your favorite?",
    "46": "How often do you think couples should have sex to keep the relationship strong?",
    "47": "If you walked in on me watching a sexy movie, what would you do?",
    "48": "When was the last time you pleasured yourself?",
    "49": "Do you prefer being dominant or submissive?",
    "50": "Do you wish to have threesome with another couple?",
    "51": "Say one honest things about everyone in the group?"
}