{
  "content": {
    "title": "Filter content between Date ranges in Drupal 7",
    "created": "11 Jul, 2015",
    "author": "Karthik Kumar D K",
    "views": "463",
    "summary": "It is tempting to believe that using the \"is between\" on a date fields will work. However, this option is used only in the case of events \"Starting\" on a range of date.",
    "content": "<p>It is tempting to believe that using the \"is between\" on a date fields will work. However, this option is used only in the case of events \"Starting\" on a range of date.</p>\n                                <p>This tutorial requires that you already have a content type with a <a href=\"https://www.drupal.org/project/date.\">date field</a> . It is not necessary to have two fields to adjust an \"end date\" for the event, only a date field with the \"Collect an end date.\"</p>\n                                <p>This part (which seems \"logical\" to start - but it is not so much) is the basis of this discussion.</p>\n                                <p>A search filter between the 11th and 31th of July should provide us the events A, B, C and D (shaded area), and Exclude E and F.</p>\n                                <p>If we have a filter with a Date field (based on the Start date) using the option \"is between\" will only show B and C since their \"start date\" is between those dates, but will exclude events A and D since their \"start date\" is before the desired search . This is not the desired result, we want to include them in the results.</p>\n                                <p>The following conversation <a href=\"https://www.drupal.org/node/1302940\">https://www.drupal.org/node/1302940</a> explains:</p>\n                                <pre>    event end date &gt;= user start date\n    AND\n    event start date &lt;= user end date\n</pre><p>Following this, we must swap the \"Start date\" and \"End date\" to the users. Users will not notice but it is crucial to obtaining the desired results.</p>\n                                <p>To include events A and D in this search, we will need two filters exposed to our Views (again: based on the same field and not two separate fields)</p>\n                                <p>In this order:</p>\n                                <ul class=\"check\">\n                                    <li>Date - end date (field_dates:value2)</li>\n                                    <li>Date - start date (field_dates)</li>\n                                </ul>\n                                <p>In \" Date - end date (field_dates:value2)\", Select popup as form element,</p>\n                                <p>In next window: Select Exposed this filter to visitor</p>\n                                <p>Even though this label says \"End date\", we are going to make believe this is the \"Start date\", so change this label to \"Start Date\" instead.</p>\n                                <p>Change the operator to \"Is greater than or equal to\", leave the \"Select a date\" as is. (event end date &gt;= user start date)</p>\n                                <p>Do the same to the second filter:</p>\n                                <pre> Date - start date (field_dates)\n  - change this label to \"End Date\",\n  - Select popup as form element,\n  - Exposed this filter to visitor\n</pre><p>This time Change to operator to \"Is less than or equal to\", leave the \"Select a date\" as is. (event start date &lt;= user end date)</p>\n                                <p>And one more thing, Make sure that you have \"AND\" between those two operators.</p>\n                                <p>Save the view.</p>\n                                <p><strong>Note : </strong> While you are working with date module, and filtering the content between dates, make sure that your Server timzone, Mysql server timezone and Drupal site timezone are same. If not you may face problems in few cases.</p>\n                                <p>Thank you :)</p>",
    "type": "Sci-Tech",
    "category": "Drupal",
    "banner394x449": "upload/banner394x449/public/Figure1.jpeg",
    "banner600x500": "upload/banner600x500/public/Figure1.jpeg",
    "banner788x443": "upload/banner788x443/public/Figure1.jpeg",
    "banner800x460": "upload/banner800x460/public/Figure1.jpeg",
    "file": "2015-07-11-filter-content-between-date-ranges-drupal7.json"
  }
}