{
  "content": {
    "title": "Create Related Content of Different Content Types through Taxonomy in Drupal7",
    "created": "11 Jul, 2015",
    "author": "Karthik Kumar D K",
    "views": "463",
    "summary": "Create a Taxonomy term field for the content type, In this article lets take example for Basic Page content type as shown in the below image. with the Autocomplete selected as settings of the term reference field",
    "content": "<p><strong>Step 1</strong> Create a Taxonomy term field for the content type, In this article lets take example for Basic Page content type as shown in the below image. with the Autocomplete selected as settings of the term reference field.</p>\n                                <img class=\"img-fluid\" src=\"../../../upload/blogs/RC1.jpg\" />\n                                <p><br/><strong>Step 2</strong> And next create/resue the Taxonomy term field for the other content type, In this article lets take example for Article content type as shown in the below image. with the Autocomplete selected as settings of the term reference field.</p>\n                                <img class=\"img-fluid\" src=\"../../../upload/blogs/RC2.jpg\" />\n                                <p><br/><strong>Step 3</strong> Then, Create a content for the basic page content type, Enter title of the field, other fields, and enter the data in the Tags field as \"Java\" as shown in the image and Save the content.</p>\n                                <p>Actually, on save of this node, a Taxonomy term as \"Java\" will be created</p>\n                                <img class=\"img-fluid\" src=\"../../../upload/blogs/RC3.jpg\" />\n                                <p><br/><strong>Step 4</strong> Next, Create a content for the Article content type, Enter title of the field, other fields, and enter the data in the Tags field as \"Java\", this time the term \"Java\" will be autopopulated as shown in the below image and save the content.</p>\n                                <img class=\"img-fluid\" src=\"../../../upload/blogs/RC4.jpg\" />\n                                <p><br/><strong>Step 5</strong> Next, Create a View block, which list all the content, below image shows the created view</p>\n                                <img class=\"img-fluid\" src=\"../../../upload/blogs/RC5.jpg\" />\n                                <p><br/><strong>Step 6</strong> Then, add a contextual filter select the field \"field_tags\", which is created earlier in the article, below image describes the settings of this field.</p>\n                                <img class=\"img-fluid\" src=\"../../../upload/blogs/RC6.jpg\" />\n                                <p><br/>Assign this view block to the header/highlight region or any the region, which will be visible in the node pages</p>\n                                <p><strong>Step 7</strong> Then, visit any node which you have created earilier in the article, this block lists the two contents which are having the Java tag in their nodes, as shown in the below image.</p>\n                                <img class=\"img-fluid\" src=\"../../../upload/blogs/RC7.jpg\" />\n                                <p><br/>Thank you :)</p>",
    "type": "Sci-Tech",
    "category": "Drupal",
    "banner394x449": "upload/banner394x449/public/RC6.jpg",
    "banner600x500": "upload/banner600x500/public/RC6.jpg",
    "banner788x443": "upload/banner788x443/public/RC6.jpg",
    "banner800x460": "upload/banner800x460/public/RC6.jpg",
    "file": "2015-07-11-create-related-content-different-content-types-through-taxonomy-drupal7.json"
  }
}