{
  "content": {
    "title": "Sites Still Vulnerable to Drupalgeddon 2",
    "created": "27 Jun, 2018",
    "author": "Karthik Kumar D K",
    "views": "463",
    "summary": "Attackers are exploiting Drupalgeddon 2 critical vulnerability in Drupal to compromise systems & secretly turn them into malicious cryptocurrency mining machines like cryptojacking malware, mine for Monero. The only side effects a victim might notice is that their system is running slower or doing more work than usual.",
    "content": "<p>Attackers are exploiting Drupalgeddon 2 critical vulnerability in Drupal to compromise systems & secretly turn them into malicious cryptocurrency mining machines like cryptojacking malware, mine for Monero.</p>\n                                <p>The only side effects a victim might notice is that their system is running slower or doing more work than usual.</p>\n                                <p>Still most of the drupal sites those are not upgraded to with the patch are having the issue..</p>\n                                <p>The worst case would be rebuilding your servers, Well you will notified by your hosting providers if you are on shared hosting and asked you to fix it because they have their AUP violations rules ;)</p>\n                                <p>So, Adding the security patch and cleaning up system would be task if at all you don't choose to rebuild servers..</p>\n                                <p>Here we go, with understanding and cleaning</p>\n                                <p><a href=\"https://www.drupal.org/SA-CORE-2018-004\" target=\"_blank\">Remote Code Execution - SA-CORE-2018-004</a></p>\n                                <p>Fix for this remote code execution vulnerability was released in Drupal - <a href=\"https://www.drupal.org/project/drupal/releases/7.59\" target=\"_blank\">7.39</a>/<a href=\"https://www.drupal.org/project/drupal/releases/8.5.4\" target=\"_blank\">8.5.4</a></p>\n                                <p>Check and keep the backup of the drupal site, obviously hosting provider and we have a backup for atleast a month or 3 months. >Replicate the site on different server with backup and keep it aside..</p>\n                                <p>In parallel to above step, Get one of the best anti-malware tools and perform scan on server, specifically for remote code execution like BitDefender. Else if you have any penetration tools could be used for scanning.</p>\n                                \n                                <p>Upgrade the drupal to the latest version Drupal -&nbsp;<a href=\"https://www.drupal.org/project/drupal/releases/7.59\" target=\"_blank\">7.39</a>/<a href=\"https://www.drupal.org/project/drupal/releases/8.5.4\" target=\"_blank\">8.5.4</a>..!!</p>\n                                <ul class=\"check\">\n                                    <li>Cleanup Decision would be made based on the result of the scan..?</li>\n                                    <li>Ideally if you see, less amount of vulnerable files the delete those..</li>\n                                    <li>Particularly should be checked for php5 files, any crons included on crontabs or any perl scripts running automatically such things should be stopped..</li>\n                                </ul>\n                                <p>Find out any outgoing request going from the server, if at all any suspicious url / activity is seen kill those, if they are initiated again, find for the ones which are initiating these tasks and kill those..</p>\n                                <p>That's it.. If you are not seeing any activity, site is safe.. Get the penetration tests in a scheduled manner, so that if any other comes that could be captured and easy to fix it..</p>\n                                <p>Bad case here would be, if you are still seeing outgoing activity from your server.. then rebuilding the servers is the option.</p>\n                                <p>Cheers :)</p>",
    "type": "Sci-Tech",
    "category": "Drupal",
    "banner394x449": "upload/banner394x449/public/web-application-firewall-blogpost-image.png",
    "banner600x500": "upload/banner600x500/public/web-application-firewall-blogpost-image.png",
    "banner788x443": "upload/banner788x443/public/web-application-firewall-blogpost-image.png",
    "banner800x460": "upload/banner800x460/public/web-application-firewall-blogpost-image.png",
    "file": "2018-06-27-sites-still-vulnerable-drupalgeddon-2.json"
  }
}