{
  "content": {
    "title": "Lunar Eclipse June 2020: When Is Next Lunar Eclipse, India Timings, How to Watch Live",
    "created": "29 May, 2020",
    "author": "Karthik",
    "views": "463",
    "content": "<p>The next lunar eclipse will grace the night skies on June 5 and June 6.<br/>The second lunar eclipse of 2020 is set to take place next month and lunar enthusiasts in India will be able to watch it with their naked eyes, although slighted fainted. It will be the second of the four lunar eclipses that will appear this year, all of which will be penumbral lunar eclipses. The last lunar eclipse occurred in January. Traditionally, the June full moon is called the Strawberry Moon, therefore, the upcoming penumbral lunar eclipse is also referred to as ‘Strawberry Moon Eclipse' by many.</p><p><strong>What is a penumbral lunar eclipse?</strong></p><p>A penumbral lunar eclipse takes place when the Moon moves through the faint, outer part of Earth's shadow called the penumbra. During this phase, the Moon appears a bit darker than usual and this type of eclipse is also often mistaken for a normal full moon.</p><div class='ads-page-3'></div><p><strong>Where will lunar eclipse June 2020 will be visible</strong></p><p>A significant portion of Earth's popular will be able to watch the June lunar eclipse. It will be visible in part of Europe, most of Asia, Australia, Africa, and parts of South America. The lunar eclipse will also be visible in India, as we mentioned earlier.</p><p><strong>Lunar Eclipse 2020 India time</strong></p><p>According to timeanddate.com, the lunar eclipse will start at 11:15pm IST on June 5 and reach the maximum eclipse at 12:54am on June 6. The penumbral eclipse will end at 2:34am. Moon enthusiasts can watch the eclipse from their home, however, it might look very pale and people would notice the difference.</p>",
    "type": "Sci-Tech",
    "category": "Eclipse",
    "banner394x449": "upload/banner394x449/public/lunar_eclipse_image_pexels_1578662474920.png",
    "banner600x500": "upload/banner600x500/public/lunar_eclipse_image_pexels_1578662474920.png",
    "banner788x443": "upload/banner788x443/public/lunar_eclipse_image_pexels_1578662474920.png",
    "banner800x460": "upload/banner800x460/public/lunar_eclipse_image_pexels_1578662474920.png",
    "file": "2020-05-29-Lunar-Eclipse-June-2020.json"
  }
}