{
  "content": {
    "title": "Openness in a Couples Relationships can be Secret/Private",
    "created": "14 Jun, 2020",
    "author": "Karthik Kumar D K",
    "views": "463",
    "summary": "In a healthy romantic relationship, as time goes on trust is earned, and we eventually open up more & more. Based on each others mutual respect & valuing, couples are sometimes unclear in how much they should or want to share within each other. Each of them have right to privacy and each decide, how much to share or how much to open up",
    "content": "<p>In a healthy romantic relationship, as time goes on trust is earned, and we eventually open up more & more. Based on each others mutual respect & valuing, couples are sometimes unclear in how much they should or want to share within each other. Each of them have right to privacy and each decide, how much to share or how much to open up.</p>\n                                <p>Few are too open or soon offer too much information, which can be inappropriate.. Few are too closed or hardly share anything personal.. Few of them share, if they feel other person is safe to share..</p>\n                                <p>Safe ones are these people, <strong>who will listen and not be judgemental or not shamed to listen</strong>. When someone listens like that, person will feel accepted for who they are. In a relationship both can experience different levels of closeness.</p>\n                                \n                                <p>If you are with someone who is close and is ready to listen and understand what you are sharing which is secret or private for you, then you are the happiest couple.</p>\n                                <p>If you are with someone who is not that close, if you feel so then its your responsibility to sort it like set the boundaries, which can be improved in further time. <strong>End of the day you are dealing with your life partner</strong>.</p>\n                                <h3>Upto what extent I can share?</h3>\n                                <p>Hahaa.. Its difficult, if you are not sure what level of openness is fine or not. This actually depends upon your past experiences, and the person whom you communicate too.</p>\n                                <p>You generally share your most intimate stuff with your romatic partners, <strong>you will tend to create or already have a special bond</strong>, thats unique and only one to say. This is the one which creates strong attachment, a sense of trust & a sense of that partner belongs to you.</p>\n                                \n                                <h3>What if I hold back?</h3>\n                                <p>Here is the relationship starts suffering, when we are holding back. Yes we have right, to have privacy and secrets to ourself, but this is the point where we start loosing the trust, Emotionally we might not be able to show up, It might lead to decrease in the intimacy levels with partner. Its nearly impossible to feel connected.</p>\n                                <h3>Why do you want to hold back?</h3>\n                                <p>Their could be many reasons, may be you have shared something in the past and did not felt safe. This is not something you have to be worried or feared about, You have to move towards more trusting ways so that you can open up to experience the emotional feel of connection.</p>\n                                <h3>Why will I keep it private?</h3>\n                                <p>Keeping private is very individuals choice, It is really not required to share every thought, feeling or an experience. Healthy Adult relationship between couple will be more like have each others space and respect each others privacy.</p>\n                                \n                                <h3>What is the difference? Secret & Privacy</h3>\n                                <p>Having privacy in a relationship might not affect on your relationship, but a secret will surely make any one you hurt.</p>\n                                <p><strong>Lets deal with a example</strong>, If you do not like your partners hairstyle or eating/sleeping habits or friends. If you are keeping it private, then as time goes on this will be a secret which can hurt your relationship.</p>\n                                <p>So <strong>how do you deal with such stuff?</strong> Best way is start revealing part by part to your partner, so that you are getting into same pace with the conflicts with your relationship.</p>\n                                <p>Also keeping something secret from your partner, will feel the partner like in some way you are manipulating. You loose trust, intimacy & emotion between partners.</p>\n                                <p>Finally, what i want to say is.. <strong>we have to learn to give ourself..</strong> In a healthy relationship, we will find the words to convey what we want to share, so that it will be received as a welcomed gift by other.</p>",
    "type": "Lifestyle",
    "category": "Couple",
    "banner394x449": "upload/banner394x449/public/People&#039;s-Blog-Openness-in-couples-relationship_0.jpg",
    "banner600x500": "upload/banner600x500/public/People&#039;s-Blog-Openness-in-couples-relationship_0.jpg",
    "banner788x443": "upload/banner788x443/public/People&#039;s-Blog-Openness-in-couples-relationship_0.jpg",
    "banner800x460": "upload/banner800x460/public/People&#039;s-Blog-Openness-in-couples-relationship_0.jpg",
    "file": "2020-06-14-Openness-in-Relationships-Secret-or-Private.json"
  }
}