{
  "content": {
    "title": "Egg Stuffed Paratha Recipe - Home made",
    "created": "04 Jun, 2020",
    "author": "Karthik Kumar D K",
    "views": "463",
    "content": "<p>Egg Stuffed Paratha is a delicious and healthy Paratha dish, filled with egg mixture. Both the eggs and whole wheat are healthy as it provides the right amount of proteins and carbs. The egg mixture has finely chopped onions, green chili and coriander leaves. This is then slided into the half cooked paratha pockets and cooked further. The Egg Stuffed Parathas are quite filling in itself.</p><h3>Ingredients Needed?</h3><p><strong>For the dough: </strong> Wheat flour 1 cup, Water, Oil & Salt for taste.</p><p><strong>For the egg stuffing: </strong> 2 Eggs, 1 Onion, 5 Green chilli, Coriander leaves, Chilli powder, Cumin powder, Garam masala, Chaat masala & Salt for taste.</p><div class=\"ads-page-3\"></div><h3>How to Cook?</h3><p>In a bowl, add wheat flour, salt, oil and mix.. Gradually add water and knead the dough.. Divide the dough into equal portions.. Place one of the portions onto a rolling surface and flatten it.. Roll out the dough flat..</p><p>Meanwhile, crack open the eggs into a glass/bowl, add all the ingredients for the stuffing.. Mix everything well (keep it dry, not too watery)..</p><p>Heat a tawa, place the rolled out chapati onto the tawa.. Flip the chapati and cook on both sides for a 10 - 15 seconds..</p><p>Make a slit on the chapati, create a pocket.. Pour the egg mixture into the slit and seal it.. Let the chapati cook and egg set inside.. Apply ghee and cook on both sides till it is completely cooked..</p><p>Cut the parathas and serve hot..</p><ul class=\"check\"><li>Prep time: 30 minutes</li><li>Cook time: 15 minutes</li><li>Number of servings: 4 persons</li></ul>",
    "type": "Food",
    "category": "Egg",
    "banner394x449": "upload/banner394x449/public/egg.jpg",
    "banner600x500": "upload/banner600x500/public/egg.jpg",
    "banner788x443": "upload/banner788x443/public/egg.jpg",
    "banner800x460": "upload/banner800x460/public/egg.jpg",
    "file": "2020-06-04-Egg-Stuffed-Paratha-Home-made-recipe.json"
  }
}