{
  "content": {
    "title": "TRAI wants to change your 10-digit phone number into 11-digit number",
    "created": "30 May, 2020",
    "author": "Karthik",
    "views": "463",
    "content": "<p>The existing mobile numbers could have an additional zero and the new mobile numbers could start with a new digit in future</p><p>The Telecom Regulatory Authority of India (TRAI) is planning to make some big changes in the telecom sector of India. The regulatory body on Friday released recommendations for developing a “Unified Number Plan” to ensure adequate numbering resources for fixed line and mobile services. TRAI in the press statement says that these recommendations are based on the comments and inputs given by various stakeholders in the discussion held during OHD in January. However, migration to the unified number scheme involves large scale changes and is not recommended at this stage.</p><ul class=\"check\">    <li>Change in the mobile number scheme is expected to give capacity of 10 billion numbers.</li>    <li>TRAI also recommends mandatory 0 for calling mobile number from landline.</li>    <li>Migration to unified number scheme is not recommended now.</li></ul><p>One of the major recommendations mentioned in the release is changing the 10 digits to 11 digits for regular mobile numbers. The existing mobile numbers could have an additional zero and the new mobile numbers could start with a new digit in future. This change is expected to give a total capacity of 10 billion numbers</p><div class='ads-page-3'></div><p>The second biggest recommendation from TRAI is adding compulsory zero for calling mobile numbers from landline. Currently mobile numbers can be called from landline without adding zero. Going ahead it can become mandatory to dial zero ahead of mobile numbers dialled from landline. However, there won’t be any change in dialling landline to landline, mobile to landline, or mobile to mobile calls. This announcement would be played whenever a fixed line subscriber dials a mobile number without a ‘0’.All the fixed line subscribers should be provided with ‘0’ dialling facility.</p><p>In another important recommendation, it is said that the mobile numbers assigned to internet dongles will also change to 13 digits. Currently, just like our mobile numbers our dongles also have 10 digits. This will be shifted to 13 digits scheme. A total time of month could be given to Telecom service providers to implement this scheme</p>",
    "type": "News",
    "category": "Mobile",
    "banner394x449": "upload/banner394x449/public/google-dialer_4.jpg",
    "banner600x500": "upload/banner600x500/public/google-dialer_4.jpg",
    "banner788x443": "upload/banner788x443/public/google-dialer_4.jpg",
    "banner800x460": "upload/banner800x460/public/google-dialer_4.jpg",
    "file": "2020-05-30-TRAI-wants-to-change-your-10-digit-phone-number.json"
  }
}