{
  "content": {
    "title": "Courtship time - Make it memorable, ways to add some spice",
    "created": "04 June, 2020",
    "author": "Karthik Kumar D K",
    "views": "463",
    "content": "<p>Finally you found a guy/girl with whom you can't wait to start most excitement time of your life.. But you see lot of time for wedding and So you got lot of time to know each other even more better.. The Best you can do is make this time memorable ;)</p><h3>1. Wedding planning, will be best time pass for each of you.</h3><p>Hmm, Obviously meeting in person in this courtship period would happen with this wedding planning action items.. So plan a day before like what else can be done on each wedding planning action item execution.. Like Need to buy a dress, plan something like we get matching dress and you both can have a walk, after this purchase ;)</p><h3>2. Try to know about Family, Friends of each other.</h3><p>Discuss in general like, how every day goes.. get to know who does what?</p><h3>3. Leave hints about what each of you like.</h3><p>Both of you should be leaving hints like what you like, what you expect.. none of you both are mind readers so make it easy for each other.. by doing so, both will know exactly what you are ;)</p><div class=\"ads-page-3\"></div><h3>4. Stop being shy, flirt a little.</h3><p>Yeah, stop being shy you two are going to get married soon.. complement each other, be honest about it.. and flirt a little.. makes your time memorable.</p><h3>5. Plan surprises once/twice</h3><p>Okay surprises, Men are little slow when it comes to planning surprises.. So try to make it memorable..</p><p>You found a person with whom you want to grow up old, Make the moments special and meaningful..</p>",
    "type": "Lifestyle",
    "category": "Love",
    "banner394x449": "upload/banner394x449/public/courtship_1.jpg",
    "banner600x500": "upload/banner600x500/public/courtship_1.jpg",
    "banner788x443": "upload/banner788x443/public/courtship_1.jpg",
    "banner800x460": "upload/banner800x460/public/courtship_1.jpg",
    "file": "2020-06-04-Courtship-time-Make-it-memorable-ways-to-add-some-spice.json"
  }
}