{
  "content": {
    "title": "Why to have a Green Roof or Eco Friendly Roof on a Building",
    "created": "21 Jun, 2020",
    "author": "Karthik Kumar D K",
    "views": "463",
    "summary": "A roof of a building that is partially or completely covered with vegetation, that is planted over a waterproofing membrane. It may also include additional layers such as a root barrier and drainage and irrigation systems. Rooftop ponds are another form of green roofs which are used to treat greywater",
    "content": "<p>A roof of a building that is <strong>partially or completely covered with vegetation</strong>, that is planted over a waterproofing membrane. It may also include additional layers such as a root barrier and drainage and irrigation systems. <strong>Rooftop ponds</strong> are another form of green roofs which are used to treat greywater.</p>\n                                <p><strong>Vegetation, soil, drainage layer, roof barrier and irrigation system</strong> constitute green roof.</p>\n                                <p>Green roofs serve several purposes for a building, like absorbing rainwater, providing insulation, creating a habitat for wildlife. They <strong>effectively use the natural functions of plants</strong> to filter water and will have quality air around the home.</p>\n                                \n                                <p>There are many <strong>Environmental benefits of having a Eco friendly roof</strong> for a building.</p>\n                                <ul class=\"check\">\n                                    <li>Thermal Reduction & Energy Conservation.</li>\n                                    <li>Management of Oxygen & CO2 levels naturally.</li>\n                                    <li>Ecological benefits.</li>\n                                </ul>\n                                <h3>Thermal Reduction & Energy Conservation</h3>\n                                <p>Green roofs will <strong>reduce heating by adding mass and thermal resistance value</strong>, also will reduce the heat island by increasing evapotranspiration. Green roofs improve and reduce energy consumption. Green roof <strong>reduces cooling (by evaporative cooling) loads on a building</strong> by fifty to ninety percent.</p>\n                                <p>Temperature inside the home will be less than outside during summers & Temperature will be more inside than outside the home in the winters.</p>\n                                \n                                <h3>Management of Oxygen & CO2 levels naturally</h3>\n                                <p>Environmental benefit of greens roofs is the ability to sequester carbon. This <strong>CO2 is naturally absorbed by plant tissue</strong>. The carbon is stored in the plant tissue and the soil substrate through plant litter and root exudates it. Green roofs also indirectly reduce CO2 given off by power plants through their ability to insulate buildings.</p>\n                                <h3>Ecological benefits</h3>\n                                <p>Green roofs create natural habitat for wild. <strong>Green roofs can attract beneficial insects, birds, bees and butterflies</strong>. Rooftop greenery complements wild areas by providing stepping stones for songbirds, migratory birds and other wildlife creatures.</p>\n                                \n                                <h3>Cons</h3>\n                                <ul class=\"check\">\n                                    <li>Green roofs <strong>requires bit more maintenance</strong> energy compared to a standard roof. Standard maintenance include removing stones, <strong>controlling weeds, cutting plants</strong> so that it will not grow very big, <strong>checking moisture levels, and fertilizing</strong>.</li>\n                                    <li>The maintenance energy use for green roofs <strong>varies on many things like: climate, intensity of rainfall, type of building, type of vegetation, and external coatings</strong>.</li>\n                                </ul>",
    "type": "Sci-Tech",
    "category": "Environment",
    "banner394x449": "upload/banner394x449/public/Peoples-Blog-Green-Roof.jpg",
    "banner600x500": "upload/banner600x500/public/Peoples-Blog-Green-Roof.jpg",
    "banner788x443": "upload/banner788x443/public/Peoples-Blog-Green-Roof.jpg",
    "banner800x460": "upload/banner800x460/public/Peoples-Blog-Green-Roof.jpg",
    "file": "2020-06-21-Why-to-have-a-Green-Roof-or-Eco-Friendly-Roof-on-a-Building.json"
  }
}