{
  "content": {
    "title": "Un-Conditional Love in a Couple's Relationship",
    "created": "06 June, 2020",
    "author": "Sathya",
    "views": "463",
    "content": "<p>It is commonly said that Women are complex in mental nature while Men remain easy to understand and simple. Whatever be the reasons that backup this comment, <strong>in relationships both Men and Women follow slightly diverted paths.</strong> What Men look for in a relationship is not what motivates Women to fall in relationships. The differences in desires, mentalities, passion, expression levels etc., are resulted from some unknown causes; might be hormonal differences, mindset changes or social concepts.</p>\n                                <p><strong>Women get time to be settled in a relationship</strong>, but if settled down, they remain dedicated and sacrificing for it; while <strong>Men jump into relationships so easily and get out of it with same easiness</strong>. However, experts say that if provided with the requirements and if matched with his desires, even Men ardently remain in the relationships.</p>\n                                <div class=\"ads-page-3\"></div>\n                                <h3>Un-Conditional Love ??</h3>\n                                <p>Un-Conditional Love is the active choice to Love someone no matter what may come your way.</p>\n                                <p>In Un-Conditional Love, satisfaction comes from putting someone else first and prioritizing their health and happiness with no expectation of reward for yourself. Experts agree that this is only possible if <strong>you first practice un-conditional Love with yourself</strong>.</p>\n                                <ul class=\"check\">\n                                    <li><strong>Practice open communication</strong>, so that both of your needs can be met.</li>\n                                    <li><strong>Communicate in a non-defensive way</strong>. Express your feelings while listening and taking the other person's feelings into account.</li>\n                                    <li><strong>Don't let the little annoyances of life override your Love</strong>. Unconditional Love means seeing past the squabbles about the little things in life. If you have a commitment of Love that is larger than those things, you will have staying power.</li>\n                                    <li><strong>Share power in your relationship</strong>. No one person should get everything they want, or this will lead to resentment by the other person.</li>\n                                </ul>\n                                <p>One thing is certain; relationships that are completely lacking in un-conditional Love are unlikely to succeed. <strong>Beliefs and Lifestyle are likely to change over time</strong>.</p>",
    "type": "Lifestyle",
    "category": "Couple, Love",
    "banner394x449": "upload/banner394x449/public/rafal_0.jpg",
    "banner600x500": "upload/banner600x500/public/rafal_0.jpg",
    "banner788x443": "upload/banner788x443/public/rafal_0.jpg",
    "banner800x460": "upload/banner800x460/public/rafal_0.jpg",
    "file": "2020-06-06-Un-Conditional-Love-in-a-relationship.json"
  }
}