{
  "content": {
    "title": "'PigeonBot' is the first robot that can bend its wings like a real bird",
    "created": "31 May, 2020",
    "author": "Karthik Kumar D K",
    "views": "463",
    "content": "<p>Pigeons may be considered rats of the sky, but some scientists have found greater value in these urban birds: <strong>the blueprint for a new generation of flying machines.</strong></p><p>Birds can modify the shape of their wings by fanning out their feathers or shuffling them closer together. Those adjustments allow birds to cut through the sky more nimbly than rigid drones. Now, using new insights into exactly how pigeons joints control the spread of their wing feathers, researchers have built a robotic pigeon, dubbed <strong>PigeonBot</strong>, whose feathered wings change shape like the real deal</p><p>This research paves the way for creating more agile aircraft, says <strong>Dario Floreano, a roboticist at the Swiss Federal Institute of Technology Lausanne in Switzerland</strong> not involved in the work.</p><p>With birdlike wings, airborne machines could make tighter turns in cluttered spaces, such as around buildings or in forests, and could better navigate rough air, Floreano says (SN: 1/24/15). The new robot, described January 16 in Science Robotics, also offers a way to study the nuts and bolts of bird flight without animal experiments.</p><div class=\"ads-page-3\"></div><p>Researchers bent and extended the wings of dead pigeons to investigate how the birds control their wing shape. Those experiments revealed that the angles of two wing joints, the wrist and the finger, most affect the alignment of a wings flight feathers. The orientations of those long, stiff feathers, which support the bird in flight, help determine the wings shape. Based on those findings, the team built a robot with real pigeon feathers, whose faux wrists and fingers can morph its wing shape as seen in the pigeon cadavers.</p><p>Besides laying the groundwork for building more graceful drones, whats really cool about this robot is  you can make manipulations in a robot wing that you could never do or want to do in a bird to study flight, says <strong>David Lentink, an engineer and biologist at Stanford University.</strong></p><p>For instance, Lentink wondered whether a pigeon could steer itself just by bending the finger joint of either its left or right wing. The problem is, of course, I dont really know how to train a bird to just move its finger  and I actually am very good in bird training, he says by phone, as two pet birds chirp in the background.</p><p>A controllable robotic pigeon solves that problem. In flight tests, Lentinks team observed that bending only the finger of one wing eased the robot into a banked turn  offering the first evidence that birds may sometimes use just their fingers to steer in flight.</p><div class=\"ads-page-3\"></div><p>In a second study, reported in the Jan. 17 Science, Lentinks group used their robotic wing design to confirm another insight into bird flight: how gaps are prevented from forming between feathers on extended wings. In experiments that involved rubbing one bird feather across the top of another  to mimic overlapping flight feathers fanning out  researchers found that two feathers initially slid apart easily, but then snagged on each other. Scanning electron and X-ray microscopy images revealed that tiny hooks protruding from the top of one feather latch onto ridges on the underside of the other when they slide too far apart. Those microscopic hooks unfasten when the feathers slot back together.</p><p><strong>Thats the secret. They have this directional Velcro that holds feathers together</strong>, Lentink says.</p><p>To confirm the effect of these microstructures, the researchers rotated the feathers on their robot so that they wouldnt slide against each other when wings were extended. In wind tunnel and outdoor flight tests, gaps formed between feathers on the modified robot wings, undermining the wings stability.</p><p>This is the best set of robotic wings yet for testing how birds coordinate their flight feathers to maneuver through the air, says Tyson Hedrick, a biomechanist the University of North Carolina at Chapel Hill not involved in the work. But theres plenty of room for improvement. For instance, a future flying robot could include a shoulder joint, to investigate how tilting a birds wings up and down influences flight, he says.</p>",
    "type": "Social Media",
    "category": "Robot",
    "banner394x449": "upload/banner394x449/public/pigeon-bot_feat.jpg",
    "banner600x500": "upload/banner600x500/public/pigeon-bot_feat.jpg",
    "banner788x443": "upload/banner788x443/public/pigeon-bot_feat.jpg",
    "banner800x460": "upload/banner800x460/public/pigeon-bot_feat.jpg",
    "file": "2020-05-31-PigeonBot-is-the-first-robot-that-can-bend-its-wings.json"
  }
}