{
  "content": {
    "title": "Fighting in a Couple's Relationship is Normal",
    "created": "04 December, 2020",
    "author": "Karthik",
    "views": "463",
    "content": "<p>Every Couple will fight & <strong>it's completely Normal</strong>, unless its scares both of them. No two people are exactly the same way, each of them are unique. Couples can <strong>occasionally or often</strong> might have conflicts or disagreements which might lead to an <strong>argument of fight</strong>. If that particular conflict of argument is <strong>taken as a healthy discussion</strong>, then you will be knowing more about your partner and you both will surely work as a team.</p>\n                                <div class=\"ads-page-3\"></div>\n                                <p>As I see, <strong>having an healthy discussion in such arguments of fight, you will have few advantages</strong> like..</p>\n                                <p>\n                                    <strong>You care a lot</strong>: <span>You are making an healthy argument, that means you are more committed & you will care a lot about your partner.</span>\n                                    <br/><strong>You will have a strong bond</strong>: <span>In such healthy arguments of fight, you will get a chance to learn more about each others, that will strengthen your bond.</span>\n                                    <br/><strong>You have a mature Relationship</strong>: <span>If you are telling your thoughts clearly while arguing, then their will be a chance for compromise and you will see improvements in your Relationship.</span>\n                                    <br/><strong>Your Relationship will be healthy</strong>: <span>In such fights, If you are never arguing means, their is something wrong. Arguments will help in reconsidering the feelings/expectations on each other, which in return makes your Relationship healthy.</span>\n                                </p>\n                                <p>Overall, if you are have a healthy argument and a reasonable communication in such fights, then you are <strong>going to stay together for long</strong>.</p>\n                                <div class=\"ads-page-3\"></div>\n                                <p>As I see, Fighting in a Relationship is Normal and even fine.. Below are few tips to keep such arguments healthy..</p>\n                                <ul class=\"check\">\n                                    <li><strong>Respect each other</strong>, Stick to the point.</li>\n                                    <li><strong>Express your curiosity</strong>, Discuss the emotional cause of the issue.</li>\n                                    <li><strong>Apologize</strong>, Begin carefully.</li>\n                                    <li><strong>Listen</strong>, You should be a good listener, listen first & then act.</li>\n                                    <li><strong>Very important</strong>, Avoid making demands or engaging in disrespect or lashing out in anger.</li>\n                                    <li><strong>Also</strong>, Discuss the past feelings of affection & love.</li>\n                                </ul>\n                                <div class=\"ads-page-3\"></div>\n                                <p>Finally.. Having a fight in a Couples Relationship is quite Normal and by having healthy arguments in such fights is really good, and Couples gona stay together for long.</p>\n                                <p>If any Couple tells me that <strong>they never fight</strong>, then I would think their is something wrong.</p>\n                                <p>Let's say, such <strong>fights between Couple are going indefinitely</strong> going-on, i mean like starting fights, <strong>involving your children or making threats</strong>, or constantly bringing up other peoples comparison into your Relationship or <strong>physical abuse</strong>. Then, external persons help is needed to sort out such issue, so that Couple can get their Relationship back on track.</p>",
    "type": "Lifestyle",
    "category": "Relationship, Couple",
    "banner394x449": "upload/banner394x449/public/2020-12-04-Fighting-in-a-Relationship-is-Normal_0.jpg",
    "banner600x500": "upload/banner600x500/public/2020-12-04-Fighting-in-a-Relationship-is-Normal_0.jpg",
    "banner788x443": "upload/banner788x443/public/2020-12-04-Fighting-in-a-Relationship-is-Normal_0.jpg",
    "banner800x460": "upload/banner800x460/public/2020-12-04-Fighting-in-a-Relationship-is-Normal_0.jpg",
    "file": "2020-12-04-Fighting-in-a-Relationship-is-Normal.json"
  }
}