{
  "content": {
    "title": "Fighting in a Couple's Relationship is Normal",
    "created": "04 December, 2020",
    "author": "Karthik",
    "views": "463",
    "content": "<p>Every couple will fight and <strong>it's completely normal</strong>, unless its scares both of them. No two peoples are exact same way, each of them are unique. Couple's can <strong>occasionally or often</strong> might have conflicts or disagreements which might lead to argument of fight. <strong>If that conflict of argument is taken as healthy discussion</strong> then you gona know more about your partner and you both will surely work as a team.</p>\n                                <div class=\"ads-page-3\"></div>\n                                <p>As I see, their are few advantages of having such fights. like..</p>\n                                <p>\n                                    <strong>You care a lot</strong>: <span>You are making a heathy argument, means you are more committed and you will care a lot.</span>\n                                    <br/><strong>You communicate easily</strong>: <span>It's kind of Trust in your relationship, you will not be quite and you will communicate it, like whatever it is.</span>\n                                    <br/><strong>You will have a strong bond</strong>: <span>In the arguments, you get a chance to learn more about each other, that will strengthen your bond with each other.</span>\n                                    <br/><strong>You have a mature relationship</strong>: <span>Means, If you are tell your thoughts clearly while arguing, their will be a chance for compromise and have improvements in the relationship.</span>\n                                    <br/><strong>Your relationship will be healthy</strong>: <span>If you are never arguing means, their is something wrong. Arguments will help in reconsidering the feelings/expectations on each other.</span>\n                                    <br/><strong>You will stay together for long</strong>: <span>A good reason for not living together is not having a reasonable communication, So if you are have a healthy argument means you are staying together for long time.</span>\n                                </p>\n                                <div class=\"ads-page-3\"></div>\n                                <p>As I see, fighting in a relationship is normal and even good too.. Below are few tips to keep the argument healthy..</p>\n                                <ul class=\"check\">\n                                    <li><strong>Respect each other</strong>, Stick to the point.</li>\n                                    <li><strong>Express your curiosity</strong>, Discuss the emotional cause of the issue</li>\n                                    <li><strong>Apologize</strong>, Begin carefully.</li>\n                                    <li><strong>Listen</strong>, You should be a good listener, listen first & then act.</li>\n                                    <li><strong>Very important</strong>, Avoid making demands or engaging in disrespect or lashing out in anger.</li>\n                                    <li><strong>Finally</strong> Discuss the past feelings of affection & love.</li>\n                                </ul>\n                                <div class=\"ads-page-3\"></div>\n                                <p>Having fight in a couples relationship is quite normal, if a couple told me <strong>they never fight</strong>, then i would think their is some issue.</p>\n                                <p>Let's say, these fights between couple are going indefinitely, i mean like starting fights, <strong>involving your children or making threats</strong>, or constantly bringing up other peoples comparison into your relationship or <strong>physical abuse</strong>, then really some others help is need to sort it out and get your relationship on to track.</p>",
    "type": "Lifestyle",
    "category": "Relationship, Couple",
    "banner394x449": "upload/banner394x449/public/2020-12-04-Fighting-in-a-Relationship-is-Normal_0.jpg",
    "banner600x500": "upload/banner600x500/public/2020-12-04-Fighting-in-a-Relationship-is-Normal_0.jpg",
    "banner788x443": "upload/banner788x443/public/2020-12-04-Fighting-in-a-Relationship-is-Normal_0.jpg",
    "banner800x460": "upload/banner800x460/public/2020-12-04-Fighting-in-a-Relationship-is-Normal_0.jpg",
    "file": "2020-12-04-Fighting-in-a-Relationship-is-Normal.json"
  }
}