{
  "content": {
    "title": "Scientists Have Created Hexagonal Salt, For First Time Ever",
    "created": "01 Jun, 2020",
    "author": "Karthik Kumar D K",
    "views": "463",
    "summary": "While it probably won't make it to your dining table, a new scientific achievement might be able to help in everything from radar equipment to electric cars: scientists have been able to form salt, aka sodium chloride (NaCl), in a hexagonal shape",
    "content": "<p>While it probably won't make it to your dining table, a new scientific achievement might be able to help in everything from radar equipment to electric cars: <strong>scientists have been able to form salt, aka sodium chloride (NaCl), in a hexagonal shape</strong></p><p>This is work done at the smallest of scales, with researchers able to get a thin film of hexagonal salt to form on top of a layer of diamond, due to the chemical interaction of both film and diamond substrate - something the team actually predicted would happen in advance through simulations.</p><div class=\"ads-page-3\"></div><p>It's the latest in a series of discoveries where scientists have been <strong>able to synthesise 2D materials with unusual crystal structures</strong>, and it's partly this self-imposed restriction to two dimensions that is enabling new and exotic structures to be formed.</p><p>\"Initially we decided to perform only a computational study of the formation of new 2D structures on different substrates, driven by the hypothesis that if a substrate interacts strongly with the NaCl thin film, one can expect major changes in the structure of the thin film,\" says material scientist Kseniya Tikhomirova from the Skolkovo Institute of Science and Technology (Skoltech) in Russia.</p><p>\"<strong>Indeed, we obtained very interesting results and predicted the formation of a hexagonal NaCl film on the diamond substrate</strong>, and decided to perform experiments. Thanks to our colleagues who performed the experiments, we synthesised this hexagonal NaCl, which proves our theory.\"</p><p>To begin with, Tikhomirova and her colleagues used a custom algorithm called USPEX to predict low-energy crystal structures based on the chemical elements used to make them. That in turn led to a hypothesis about the <strong>formation of NaCl structures on top of the diamond layer</strong>.</p><div class=\"ads-page-3\"></div><p>In order to prove the hypothesis correct, a series of high-pressure experiments were carried out to create a layer of hexagonal NaCl averaging just 6 nanometres thick - a layer that was verified with X-ray and electron diffraction measurements.</p><p>As soon as the film got any thicker than that, it reverted back to the standard cubic structure of salt - the one you would see if you seasoned your food with it and looked under an ultra-powerful microscope.</p><p>\"<strong>This shows that this simple and common compound, seemingly well-studied, hides many interesting phenomena, especially in nanoscale</strong>,\" says material scientist Alexander Kvashnin.</p><p>Where this might prove most useful is in diamond field-effect transistors or FETs, which can be deployed in a variety of high-powered electronics, including electric vehicles and telecommunications devices.</p><div class=\"ads-page-3\"></div><p>These FETs currently rely on hexagonal boron nitride, but hexagonal NaCl is likely to improve the stability of FETs even further (and make them more suitable for a broader range of purposes).</p><p>There's plenty more research ahead, too, not only in developing the hexagonal NaCl structures and the FETs based on them, but also <strong>predicting how exotic structures could be formed from other kinds of compounds</strong>.</p><p>Graphene remains the standard bearer for a 2D material that can exhibit surprising and useful properties, but it's likely that there are many other such discoveries still to come. As methods of modelling and analysis develop, hexagonal salt is likely to be just the start.</p><p>\"Our results show that the <strong>field of 2D materials is still very young, and scientists have discovered only a small portion of possible materials with intriguing properties</strong>,\" says Kvashnin.</p><p>The research has been published in the Journal of Physical Chemistry Letters.</p>",
    "type": "Sci-Tech",
    "category": "Salt",
    "banner394x449": "upload/banner394x449/public/salt-2.jpg",
    "banner600x500": "upload/banner600x500/public/salt-2.jpg",
    "banner788x443": "upload/banner788x443/public/salt-2.jpg",
    "banner800x460": "upload/banner800x460/public/salt-2.jpg",
    "file": "2020-06-01-Scientists-Have-Created-Hexagonal-Salt.json"
  }
}