{
  "content": {
    "title": "Growing Enough Food to Feed a Family Year-Round by Yourself",
    "created": "28 Jun, 2020",
    "author": "Karthik Kumar D K",
    "views": "463",
    "summary": "It's a great thought of growing enough food to feed your family year round by yourself. Certain things are really important for such a though, like how much food is needed for your family, which crops to plant, how to get the most from your plot, and how to preserve your extra harvest",
    "content": "<p>It's a great thought of growing enough food to feed your family year round by yourself. Certain things are really important for such a though, like <strong>how much food is needed</strong> for your family, <strong>which crops to plant</strong>, how to <strong>get the most from your plot</strong>, and how to <strong>preserve your extra harvest.</strong></p>\n                                <h3>How much food is needed?</h3>\n                                <p>Let's say a 200 square feet plot will harvest the feeds for a single person all around the year. Then, 800 square feet of plot should do for 4 people family (bigger the family scale up the plot as needed).</p>\n                                <p>Some crops can take up more space than others, so based on these also plot size would increase.. Let's say 1600 square feet (double) of plot would do for 4 people of family.</p>\n                                \n                                <h3>Which crops to plant?</h3>\n                                <p>Plant more of what your family likes to eat a lot, and we have to consider the climate as well, and also you should have a plan to preserve during off season.</p>\n                                <p>Here are few vegetables utilized in daily life.. Tomatoes, Carrot, Potatoes, Beet root, Broccoli, Corn, Spinach, Onion, Chilli, Beans, Cabbage, Chives, Cassava, Cauliflower, Cucumber, Daikon, Fennel, Ginger, Gourd, Horseradish, Lettuce, Lime, Mushroom, Olives, Oyster, Pumpkins, Parsley, Palm Heart, Quince, Radish, Rosemary, Red Cabbage, Shallots, Snow Peas, Sorrel, Spinach, Turnips, Watercress, Yam.</p>\n                                <h3>How to get most from your plot?</h3>\n                                <p>Their are several factors on how to get most from the Plot, such as quality of seeds, quality of soil, required amount of water, required planting space and photosynthesis (weather). Also, few steps can be taken to maximize production through the year from the Plot.</p>\n                                <ul class=\"check\">\n                                    <li>Do Intercropping</li>\n                                    <li>Plant again and again</li>\n                                    <li>Harvest early & consistently</li>\n                                    <li>Grow vegetables suited to your area</li>\n                                </ul>\n                                \n                                <h3>How to preserve your extra harvest?</h3>\n                                <p>Their are many ways to preserve the harvest for the future utilization. and Also we should consider few things, which vegetables are good for preserving long term and short term. Few of popular ways to preserve food are..</p>\n                                <ul class=\"check\">\n                                    <li>Frezzing</li>\n                                    <li>Drying etc..</li>\n                                </ul>\n                                <h4>Finally..</h4>\n                                <p>The key is to start early planting and have a plan for next planting and preserving. If things are going good, means you have enough food for next one month.</p>",
    "type": "Food",
    "category": "Family",
    "banner394x449": "upload/banner394x449/public/People&#039;s-Blog-Growing-Enough-Food-to-Feed-a-Family.jpg",
    "banner600x500": "upload/banner600x500/public/People&#039;s-Blog-Growing-Enough-Food-to-Feed-a-Family.jpg",
    "banner788x443": "upload/banner788x443/public/People&#039;s-Blog-Growing-Enough-Food-to-Feed-a-Family.jpg",
    "banner800x460": "upload/banner800x460/public/People&#039;s-Blog-Growing-Enough-Food-to-Feed-a-Family.jpg",
    "file": "2020-06-28-Growing-Enough-Food-to-Feed-a-Family.json"
  }
}