{
  "content": {
    "title": "World's Fastest Anti-Ship Cruise Missile in Operation",
    "created": "30 Nov, 2020",
    "author": "Karthik Kumar D K",
    "views": "463",
    "content": "<p>BrahMos is a <strong>medium-range ramjet supersonic cruise missile</strong> that can be launched from submarine, ships, aircraft, or land. It is the <strong>fastest supersonic cruise missile</strong> in the world. It is a joint venture between the Russian Federation's <strong>NPO Mashinostroyeniya</strong> and India's Defence Research and Development Organisation <strong>(DRDO)</strong>, who together have formed <strong>BrahMos Aerospace</strong>. The name BrahMos is formed from the names of two rivers, the <strong>Brahmaputra</strong> of India and the <strong>Moskva</strong> of Russia.</p>\n                                <p>It is the world's <strong>fastest anti-ship cruise missile</strong> in operation. The land-launched and ship-launched versions are already in service. An air-launched variant of BrahMos appeared in 2012 and entered service in 2019. A <strong>hypersonic version</strong> of the missile, <strong>BrahMos-II</strong>, is also presently under development with a <strong>speed of Mach 7-8</strong> to boost aerial fast strike capability. It is expected to be ready for testing by 2020.</p>\n                                <div class=\"ads-page-3\"></div>\n                                <p>India wanted the BrahMos to be based on a mid range cruise missile like the <strong>P-700 Granit</strong>. Its <strong>propulsion</strong> is based on the Russian missile, and <strong>missile guidance</strong> has been developed by BrahMos Aerospace. The missile is expected to reach a total order of US$13 billion.</p>\n                                <p>In 2016, as India became a member of the Missile Technology Control Regime (<strong>MTCR</strong>), India and Russia are now planning to jointly develop a <strong>new generation</strong> of Brahmos missiles with 800 km-plus range and an ability to hit protected targets with <strong>pinpoint accuracy</strong>. In 2019, India upgraded the missile with a new range of 650 km with plans to eventually upgrade all missiles to a range of 1500 km.</p>\n                                <div class=\"ads-page-3\"></div>\n                                <h5>Further developments</h5>\n                                <ul class=\"check\">\n                                    <li>Extended range</li>\n                                    <li>BrahMos-II</li>\n                                    <li>BrahMos-NG</li>\n                                    <li>UCAV variant</li>\n                                </ul>\n                                <p>The former President of India, <strong>A. P. J. Abdul Kalam</strong> asked BrahMos Aerospace to develop an <strong>advanced version</strong> of the BrahMos cruise missile <strong>to maintain India's lead in the field</strong>. He stated that a <strong>hypersonic version</strong> of BrahMos would be needed that could <strong>deliver its payload and return to base</strong>.</p>",
    "type": "Social Media",
    "category": "Missile",
    "banner394x449": "upload/banner394x449/public/Worlds-fastest-anti-ship-cruise-missile-in-operation_1.jpg",
    "banner600x500": "upload/banner600x500/public/Worlds-fastest-anti-ship-cruise-missile-in-operation_1.jpg",
    "banner788x443": "upload/banner788x443/public/Worlds-fastest-anti-ship-cruise-missile-in-operation_1.jpg",
    "banner800x460": "upload/banner800x460/public/Worlds-fastest-anti-ship-cruise-missile-in-operation_1.jpg",
    "file": "2020-11-30-Worlds-fastest-anti-ship-cruise-missile-in-operation.json"
  }
}