{
  "content": {
    "title": "SpaceX, NASA make history with first launch of astronauts",
    "created": "31 May, 2020",
    "author": "Karthik",
    "views": "463",
    "content": "<p>A new era of human spaceflight is set to begin as American astronauts once again launch on an American rocket from American soil to the International Space Station as part of NASA Commercial Crew Program. <strong>NASA astronauts Robert Behnken and Douglas Hurley will fly on SpaceXs Crew Dragon spacecraft</strong>, lifting off on a Falcon 9 rocket at 3:22 p.m. EDT May 30, from Launch Complex 39A in Florida, for an extended stay at the space station for the Demo-2 mission. The specific duration of the mission is to be determined.</p><p>As the final flight test for SpaceX, this mission will validate the companys crew transportation system, including the launch pad, rocket, spacecraft, and operational capabilities. This also will be the first time NASA astronauts will test the spacecraft systems in orbit. </p><p><strong>Behnken and Hurley</strong> were among the first astronauts to begin working and training on SpaceXs next-generation human space vehicle and were selected for their extensive test pilot and flight experience, including several missions on the space shuttle.</p><div class=\"ads-page-3\"></div><p><strong>Behnken will be the joint operations commander for the mission, responsible for activities such as rendezvous, docking and undocking, as well as Demo-2 activities while the spacecraft is docked to the space station</strong>. He was selected as a NASA astronaut in 2000 and has completed two space shuttle flights. Behnken flew STS-123 in March 2008 and STS-130 in February 2010, and he performed three spacewalks during each mission. Born in St. Anne, Missouri, he has bachelors degrees in physics and mechanical engineering from Washington University and earned a masters and doctorate in mechanical engineering from California Institute of Technology. Before joining NASA, Behnken was a flight test engineer with the U.S. Air Force.</p><p><strong>Hurley will be the spacecraft commander for Demo-2, responsible for activities such as launch, landing and recovery</strong>. He was selected as an astronaut in 2000 and has completed two spaceflights. Hurley served as pilot and lead robotics operator for both STS‐127 in July 2009 and STS‐135, the final space shuttle mission, in July 2011. The New York native was born in Endicott but considers Apalachin his hometown. He holds a Bachelor of Science degree in Civil Engineering from Tulane University in Louisiana and graduated from the U.S. Naval Test Pilot School in Maryland. Before joining NASA, he was a fighter pilot and test pilot in the U.S. Marine Corps.</p><p>Lifting off from Launch Pad 39A atop a specially instrumented Falcon 9 rocket, Crew Dragon will accelerate its two passengers to approximately 17,000 mph and put it on an intercept course with the International Space Station. Once in orbit, the crew and SpaceX mission control will verify the spacecraft is performing as intended by testing the environmental control system, the displays and control system and the maneuvering thrusters, among other things. In about 24 hours, Crew Dragon will be in position to rendezvous and dock with the space station. The spacecraft is designed to do this autonomously but astronauts aboard the spacecraft and the station will be diligently monitoring approach and docking and can take control of the spacecraft if necessary.</p><p>After successfully docking, Behnken and Hurley will be welcomed aboard station and will become members of the Expedition 63 crew. They will perform tests on Crew Dragon in addition to conducting research and other tasks with the space station crew.</p></p><div class=\"ads-page-3\"></div><p>Although the Crew Dragon being used for this flight test can stay in orbit about 110 days, the specific mission duration will be determined once on station based on the readiness of the next commercial crew launch. The operational Crew Dragon spacecraft will be capable of staying in orbit for at least 210 days as a NASA requirement.<p><strong>Upon conclusion of the mission, Crew Dragon will autonomously undock with the two astronauts on board, depart the space station and re-enter the Earths atmosphere</strong>. Upon splashdown just off Floridas Atlantic Coast, the crew will be picked up at sea by SpaceXs Go Navigator recovery vessel and return to Cape Canaveral.</p><p>The Demo-2 mission will be the final major step before NASAs Commercial Crew Program certifies Crew Dragon for operational, long-duration missions to the space station. This certification and regular operation of Crew Dragon will enable NASA to continue the important research and technology investigations taking place onboard the station, which benefits people on Earth and lays the groundwork for future exploration of the Moon and Mars starting with the agencys Artemis program, which will land the first woman and the next man on the lunar surface in 2024.</p>",
    "type": "News",
    "category": "NASA, Astronaut",
    "banner394x449": "upload/banner394x449/public/5ecebfae5af6cc2ad1440cd4.png",
    "banner600x500": "upload/banner600x500/public/5ecebfae5af6cc2ad1440cd4.png",
    "banner788x443": "upload/banner788x443/public/5ecebfae5af6cc2ad1440cd4.png",
    "banner800x460": "upload/banner800x460/public/5ecebfae5af6cc2ad1440cd4.png",
    "file": "2020-05-31-SpaceX-NASA-make-history-with-first-launch-of-astronauts.json"
  }
}