{
  "content": {
    "title": "It is OK.. to not be ok !!! - Hanukkah John",
    "created": "29 Dec, 2020",
    "author": "Hanukkah John",
    "views": "463",
    "content": "<p>Ever felt that you are worthless or a burden to others? Ever felt so exhausted mentally? Ever felt sad not for a day or two but for weeks continuously? I'm not talking about grieving over a loss but feeling sad for something which you could have let go easily at least after a day or two.</p>\n                                <p>Have you ever found yourself lying in bed all day continuously for days doing nothing even though you've got work to do. Have you ever found yourself losing interest in everything that makes you happy at a time? Have you ever found yourself emotionless when you are supposed to be excited or extremely happy?</p>\n                                <p>You might be wondering what I am trying to dig into. These things might sound a bit lame or you might even think, who does not feel this way in this day to day busy world. But hold on!! Yes, it is ok if this happens once in a blue moon but not when it is frequent enough to effect your day to day living.</p>\n                                <div class=\"ads-page-3\"></div>\n                                <p>Won't you take a frequent headache or a back that aches continuously seriously? Won't you be worried if suddenly your vision is blurred and check with a doctor? In the same aspect emotions, feelings, thought pattern are equally important.</p>\n                                <p>Given the present societal norms, mental health needs attention. Yes, it is hard to come out and share something you have never bothered or thought of talking about. But you never know. You never know what comes out of that tiny step you have taken to approach someone who could help you out. You never know the kind of peace you get when you resolve things within yourself from years of bondage. You never know the people you wanted to cut ties with might be someone who turns out to love you more than you ever thought. You never know you might discover something so good in yourself that you never imagined you would be. It is not easy but it is not impossible as well.</p>\n                                <p>All you need to know is it is ok to not be ok and it is also ok to seek a professional help.</p>",
    "type": "Lifestyle",
    "category": "Mental Health",
    "banner394x449": "upload/banner394x449/public/ok-hanukkah-john.jpeg",
    "banner600x500": "upload/banner600x500/public/ok-hanukkah-john.jpeg",
    "banner788x443": "upload/banner788x443/public/ok-hanukkah-john.jpeg",
    "banner800x460": "upload/banner800x460/public/ok-hanukkah-john.jpeg",
    "file": "2020-12-29-It-is-ok-to-not-be-ok-Hanukkah-John.json"
  }
}