{
  "content": {
    "title": "Construction materials for Thermal Resistance Walls, Earth Bricks",
    "created": "20 Jun, 2020",
    "author": "Karthik Kumar D K",
    "views": "463",
    "summary": "Construction process can be tedious, time consuming, and expensive. To overcome this during construction, varied methods of construction is being considered and developed. Also, materials and equipment used for construction are also being fabricated to enhance the quality of construction and furthermore minimize the time and cost. Interlocking bricks is one such advancement in construction industry",
    "content": "<p>Construction process can be tedious, time consuming, and expensive. To overcome this during construction, varied methods of construction is being considered and developed. Also, materials and equipment used for construction are also being fabricated to enhance the quality of construction and furthermore minimize the time and cost. <strong>Interlocking bricks is one such advancement in construction industry</strong>.</p>\n                                <p>Interlocking bricks are <strong>enhanced form of conventional clay bricks</strong>. Each brick is designed to lock itself to the other bricks around without the use of much mortar. The self-locking is achieved using shear-key and lock mechanism. Based on the design, the shape of shear-key will vary and a complimentary lock is provided on the opposite side of brick. Load transfer is achieved by shear transfer and gravity.</p>\n                                \n                                <p>Interlocking bricks are <strong>compressed and stabilized earth bricks which contributes to strength of the structure</strong>.</p>\n                                <h3>How Interlocking Bricks are made?</h3>\n                                <ul class=\"check\">\n                                    <li>These Bricks are made by mixing soil, cement and sand mixture. The finished blocks even stronger than masonry stones.</li>\n                                    <li>The soil which is choosen <strong>should not be too sandy, it should actually be lumps and cracks</strong>.</li>\n                                    <li>Should not use soil, which is on the surface. It contains too much organics. Organic matter continues to breakdown over time while sand, silt, and clay are much more stable and will not rot away.</li>\n                                    <li>Material ratio: <strong>Cement (10%) + Clay (90%) + Water (appropriate)</strong>.</li>\n                                    <li>Bricks are cured for 7 - 14 days and it will reach its highest strength after 28 days.</li>\n                                </ul>\n                                \n                                <h3>Pros and Cons of these Earth Bricks</h3>\n                                <strong>Pros</strong>\n                                <ul class=\"check\">\n                                    <li>These bricks <strong>result in higher density, which in turn converts itself into high thermal mass</strong>.</li>\n                                    <li>No need of plastering or very less plastering.</li>\n                                    <li>Interlocking bricks are an effective and proven earthquake resistant construction materials.</li>\n                                    <li>Less Labour cost, Less time for construction.</li>\n                                </ul>\n                                <strong>Cons</strong>\n                                <ul class=\"check\">\n                                    <li>You can build upto two storey building, more than 2-3 storey building is not recommended.</li>\n                                    <li>If rain water enters to the walls, it might be a hostage for insects and other undesired things. Solution for this is, doing minimal plastering for lines & corners</li>\n                                </ul>",
    "type": "Sci-Tech",
    "category": "Environment",
    "banner394x449": "upload/banner394x449/public/Peoples-Blog-Interlock-Clay-Brick.webp",
    "banner600x500": "upload/banner600x500/public/Peoples-Blog-Interlock-Clay-Brick.webp",
    "banner788x443": "upload/banner788x443/public/Peoples-Blog-Interlock-Clay-Brick.webp",
    "banner800x460": "upload/banner800x460/public/Peoples-Blog-Interlock-Clay-Brick.webp",
    "file": "2020-06-20-Construction-materials-for-Thermal-Resistant-Walls.json"
  }
}