{
  "content": {
    "title": "Rainwater Collection, Storage & Purification",
    "created": "18 December, 2020",
    "author": "Karthik",
    "views": "463",
    "content": "<p>Rainwater Harvesting is the <strong>collection & storage of rain water</strong>, rather than allowing it to run off. Rainwater is <strong>collected from</strong> a roof-like surface and <strong>redirected to</strong> a tank, cistern, deep pit (well, shaft, or borehole), aquifer, or a reservoir with percolation. We <strong>can utilize this water for many purposes</strong> like, include watering gardens, livestock, irrigation, domestic use with proper treatment, and domestic heating. Importantly, <strong>purifying rain water for drinking & cooking</strong> purposes.</p>\n                                <p>Also, The harvested water can also be committed to <strong>groundwater recharge</strong>.</p>\n                                <p>We are taking about rainwater harvesting, utilization & purification <strong>for a family</strong>, Lets see different ways where they are <strong>optimal, reliable and doable</strong> by a family.</p>\n                                <h3>1. Collection & Storage of rain water</h3>\n                                <ul class=\"check\">\n                                    <li>Collect from <strong>Roof Top</strong>, redirect water to the storage tanks & artificial ponds in your compound.</li>\n                                    <li>Collect from a <strong>RainSaucer</strong>, an upside-down umbrella, can be further used for cooking.</li>\n                                    <li><strong>Any flat surface above 10 feet</strong> in your compound can collect rain water.</li>\n                                    <li>Something interesting, <strong>Groasis Waterboxx</strong> useful for growing trees with stored and rainwater.</li>\n                                    <li>Collect from <strong>Solar Panels</strong>, can be utlized for drinking.</li>\n                                </ul>\n                                <p>In above all methods, while we collect water, we need to have a <strong>filtration checkpoints</strong> at every level before storing it for other purposes.</p>\n                                <p><strong>Example</strong> <br/>1. While collecting from <strong>Roof top</strong>, your roof will be atleast 12-13 feet height, while water flows from that height, you should have <strong>2-3 filtration checkpoints</strong> so that you can store water which is somewhat purified & can be used for domestic purposes. <br/>2. While collecting from <strong>Solar Panels</strong>, with use of <strong>few filtration techniques</strong>, you can use water for drinking.</p>\n                                <h3>2. Purification for drinking & cooking</h3>\n                                <p>For drinking & cooking purposes, water should be collected bit differently like <strong>RainSaucer or Solar Panels</strong>, and futher passed this collected water to <strong>few Membrane filters & Disinfections</strong>, later store in a place where its ready for <strong>RO or UV filtration</strong>.</p>\n                                <ul class=\"check\">\n                                    <li><strong>Reverse Osmosis (RO):</strong> Will remove particles as fine as .001 microns, helps remove radium, natural organics, pesticides, cysts, bacteria and viruses. RO systems produce waste water that needs to be processed further.</li>\n                                    <li><strong>Ultraviolet Light (UV):</strong> Works by penetrating an organisms cell walls and disrupting the cells genetic makeup, making it impossible to reproduce and rendering it harmless. This process doesn't kill microorganism, it just makes them unable to reproduce and thus harmless.</li>\n                                </ul>\n                                <p>Rainwater can be safely used outdoors and indoors, if the correct steps are taken to handle, store and clean it.</p>",
    "type": "Sci-Tech",
    "category": "Environment",
    "banner394x449": "upload/banner394x449/public/Rain-Water-Harvesting1.jpeg",
    "banner600x500": "upload/banner600x500/public/Rain-Water-Harvesting1.jpeg",
    "banner788x443": "upload/banner788x443/public/Rain-Water-Harvesting1.jpeg",
    "banner800x460": "upload/banner800x460/public/Rain-Water-Harvesting1.jpeg",
    "file": "2020-12-18-Rain-water-collection-storage-purification.json"
  }
}