{
  "content": {
    "title": "Indian style Spanish omelette, Egg + Potato + Onion",
    "created": "07 Jun, 2020",
    "author": "Karthik Kumar D K",
    "views": "463",
    "content": "<p>Egg with Potato plus Onion will make a delicious and healthy breakfast, You have have it as a Breakfast or you can have it as a Snack in the day, will also be a great starter in the barbecue. This combination of dish is called Spanish omelette, but lets make it in Indian Style.</p>\n                                <h3>Ingredients Needed?</h3>\n                                <p>3 Eggs, 4 medium sized Potato (chopped in small) & 4 medium sized Onion (chopped in small), 4-5 Green chilli (chopped in small), Chilli powder Oil & Salt for taste.</p>\n                                <div class=\"ads-page-3\"></div>\n                                <h3>How to Cook?</h3>\n                                <p>Have a bowl on stove with low flame, Put 3-4 table spoons of Oil (as needed).. Put the chopped Onion, chopped Potato & chopped Chilli and Fry in the low flame.. Put some salt and continue to Fry for 6-8 min untill the stuff is medium fried..</p>\n                                <p>Take the Fried stuff into another bowl and let it cool for a while, Meanwhile you prepare the other stuff</p>\n                                <p>Take a bowl and break the Eggs & add Salt + Chilli powder and Mix it well, actually mix it for 2-3 min.. so that the mixture is thick..</p>\n                                <p>Now mix the Fried stuff in to the Egg stuff and mix it well, Now you have the complete stuff ready which is ready for cooking..</p>\n                                <p>Now have a tawa on the stove and Put 2-3 tea spoons of Oil and Pour the prepared stuff, Let it Fry in the low flame for 2-3 min.. Now Fry the other side of Omellete for 2-3 min.. Once its fried on both sides take it to out, its ready for serve..</p>\n                                <ul class=\"check\">\n                                    <li>Prep time: 30 minutes</li>\n                                    <li>Cook time: 15 minutes</li>\n                                    <li>Number of servings: 3 persons</li>\n                                </ul>",
    "type": "Food",
    "category": "Egg",
    "banner394x449": "upload/banner394x449/public/spanish-omelette.jpg",
    "banner600x500": "upload/banner600x500/public/spanish-omelette.jpg",
    "banner788x443": "upload/banner788x443/public/spanish-omelette.jpg",
    "banner800x460": "upload/banner800x460/public/spanish-omelette.jpg",
    "file": "2020-06-07-Indian-style-spanish-omellete.json"
  }
}