{
  "content": {
    "title": "What to Eat & What to Avoid, after a Tooth Extraction",
    "created": "21 Jan, 2021",
    "author": "Jyothi S N",
    "views": "463",
    "summary": "Tooth extraction is a long chain of steps where you have to take care of the area of the extraction for weeks of extration steps. Means you need to take care of brushing and cleaning the area properly & avoiding too much activity right after the extraction.",
    "content": "<p>Tooth extraction is a long chain of steps where you have to take care of the area of the extraction for weeks of extration steps. Means you need to take care of brushing and cleaning the area properly & avoiding too much activity right after the extraction.</p>\n                                <p>Since you have to consume food everyday, you can do by <strong>taking certain restrictions</strong> like what you can eat and what you cannot eat after having a tooth extraction.</p>\n                                <h3>How to Eat?</h3>\n                                <p>It is recommended to use the opposite side of the tooth extrated site in the mouth to chew and eat your food for a few days post-extraction.</p>\n                                <p>You would be in <strong>liquid diet post-extration</strong>. Its important to note, <strong>don't use straw..</strong> Using straw to suck the liquid food may cause the blood clot to get dislodged and <strong>increase your healing period</strong>.</p>\n                                <h3>What to Eat?</h3>\n                                <p>For the first 48 hours, liquid and soft food is the only food you need to consume. Gradually you can take normal food once you feel comfortable.</p>\n                                <p>Recommended food for first few days are like.. scrambled eggs, yoghurt, sauce etc. Also you can have Ice cream, but <strong>not chewing</strong> ones.</p>\n                                <p>Make sure, you take <strong>food which is at room temperature</strong>.. not too hot or not too cold..</p>\n                                <h3>What to Avoid?</h3>\n                                <p>For the first few days, completely avoid food where you need to chew.. Also grainy & crispy foods are <strong>not recommended</strong>. Your choice of food should be Dairy products, but not Meat..</p>\n                                <p>Overall, <br/>Tooth extraction can take few weeks to recover fully, even when everything goes good.<br/>In <strong>case of a sudden pain</strong>, you must immediately get back to soft foods and get in touch with a <a target=\"_blank\" title=\"Dr. Jyothi S N\" href=\"https://jyothisnagaraja.github.io/\">Dentist</a> .</p>",
    "type": "Food",
    "category": "Dental",
    "banner394x449": "upload/banner394x449/public/foods-to-eat-after-teeth-removal.jpeg",
    "banner600x500": "upload/banner600x500/public/foods-to-eat-after-teeth-removal.jpeg",
    "banner788x443": "upload/banner788x443/public/foods-to-eat-after-teeth-removal.jpeg",
    "banner800x460": "upload/banner800x460/public/foods-to-eat-after-teeth-removal.jpeg",
    "file": "2021-01-21-What-to-Eat-and-What-to-Avoid-after-a-Tooth-Extraction.json"
  }
}