{
  "content": {
    "title": "Your Oral Health is Your Total Health",
    "created": "08 January, 2021",
    "author": "Jyothi S N",
    "views": "463",
    "content": "<p>We human beings, to live and survive consume food as a basic need. How many of us have thought that food we consume orally is keeping one's dental health in good condition.</p>\n                                <p>Studies and researchers have proven that.. plaque and calculus in dental terminology which contains aerobic and anaerobic bacteria which accumulated and attached to teeth slowly discharge and goes along with food.. So Bacteria reaches to intestine, heart valves, liver.. Which leads to damages in slow process.</p>\n                                <div class=\"ads-page-3\"></div>\n                                <p>So what all measures we can do to keep clean and healthy of our teeth and tongue for good oral health</p>\n                                <ul class=\"check\">\n                                    <li>Every six months go to dental check up and check your teeth that all teeth are free from cavity</li>\n                                    <li>Every 6 months get cleaning of all your teeth from dentist</li>\n                                    <li>Change your tooth brush for every 3 months</li>\n                                    <li>Eat gouva fruit which helps your teeth to be strong</li>\n                                    <li>Brush your teeth daily twice a day.. Morning before food and night before going to sleep</li>\n                                    <li>Use antidiscolour agent mouth wash as recommend by your dentist.</li>\n                                    <li>Clean your tongue with tongue cleaner</li>\n                                    <li>Use interdental brush and dental floss as recommended by your dentist.</li>\n                                </ul>\n                                <p>We eat plenty Times a day without thinking about our teeth and Oral health status.. Atleast from now on words let's do atleast few of the above measures to maintain oral health..</p>\n                                <p>So finally, your oral health is your total health..</p>",
    "type": "Food",
    "category": "Health",
    "banner394x449": "upload/banner394x449/public/teeth1.jpeg",
    "banner600x500": "upload/banner600x500/public/teeth1.jpeg",
    "banner788x443": "upload/banner788x443/public/teeth1.jpeg",
    "banner800x460": "upload/banner800x460/public/teeth1.jpeg",
    "file": "2021-01-08-Your-Oral-Health-is-Your-Total-Health.json"
  }
}