{
  "content": {
    "title": "Saving Vegetable seeds for your backyard gardening",
    "created": "14 Jan, 2021",
    "author": "Karthik Kumar D K",
    "views": "463",
    "summary": "To become more food self-sufficient, we should plan to collect, store and use some of the seed for your own garden. With this we can create new, custom varieties of vegetables that grow best in our backyard. This can be done with small amount of effort involved. Also you will have fun in the process too.",
    "content": "<p>To become more food self-sufficient, we should plan to collect, store and use some of the seed for your own garden. With this we can create new & custom varieties of vegetables that grow best in our backyard. This can be done with small amount of effort involved. Also you will have fun in the process too.</p>\n                                <p>You can save vegetable seeds from your garden produce to plant next year. Seed saving involves selecting suitable plants from which to save seed, harvesting seeds at the right time and storing them properly over the winter.</p>\n                                <p>Their are different types of pollinating plants, based on this we should plan and save seeds for next season plantation.. like</p>\n                                <h5>Self-pollinating plants</h5>\n                                <ul class=\"check\">\n                                    <li>Plants having flowers that are self-pollinating and seeds that require little or no special treatment before storage</li>\n                                    <li>Tomatoes, peppers, beans and peas are good choices for seed saving.</li>\n                                </ul>\n                                <h5>Cross-pollinated plants</h5>\n                                <ul class=\"check\">\n                                    <li>Plants with separate male and female flowers, may cross-pollinate. It is difficult to keep the seed strain pure</li>\n                                    <li>Insects also can cross-pollinate few Plants</li>\n                                </ul>\n                                <h5>Hybrid plants</h5>\n                                <ul class=\"check\">\n                                    <li>Hybrid vegetable plants are products of crosses between two different varieties, combining traits of the parent plants.</li>\n                                </ul>\n                                <p>Few tips to Preserving and Storing Seeds from Your backyard garden</p>\n                                <ul class=\"check\">\n                                    <li>Clean Your Seeds Promptly After Removing them from Your Plants</li>\n                                    <li>Dry Your Seeds Before Storing</li>\n                                    <li>Freezing Seeds for Long Term Storage</li>\n                                    <li>Open Area Storing of Seeds for Shorter Term</li>\n                                    <li>Monitor the Seed Storage Environment Once Per Month</li>\n                                    <li>Careful Transition from Storage to Planting</li>\n                                </ul>\n                                <p>To improve the chances of starting plantationg with healthy seeds during your next season. If you suspect seed may be contaminated, there are two seed treatment options that can help to clean seed. Both treatments can reduce germination of seed that is old or of poor quality, but have minimal effect on fresh, good quality seed.</p>\n                                <ul class=\"check\">\n                                    <li>Bleach treatment</li>\n                                    <li>Hot water treatment</li>\n                                </ul>\n                                <p>Basically, Avoid all types of garden diseases to have a good crop at your backyard garden.</p>",
    "type": "Food",
    "category": "Family",
    "banner394x449": "upload/banner394x449/public/gardening-seeds.jpeg",
    "banner600x500": "upload/banner600x500/public/gardening-seeds.jpeg",
    "banner788x443": "upload/banner788x443/public/gardening-seeds.jpeg",
    "banner800x460": "upload/banner800x460/public/gardening-seeds.jpeg",
    "file": "2021-01-14-Saving-Vegetable-seeds-for-your-backyard-gardening.json"
  }
}